000010 @OPTIONS ALPHAL(WORD)
000020*
000030 identification division.
000040 PROGRAM-ID. MAKEFORM.
000050 AUTHOR. FEDERICO PRIOLO AGOSTO 2022
000060
000070*
000080* Copyright (C) 2010-2022 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000090*
000100* This program is free software; you can redistribute it and/or modify
000110* it under the terms of the GNU General Public License as published by
000120* the Free Software Foundation; either version 2, or (at your option)
000130* any later version.
000140*
000150* This program is distributed in the hope that it will be useful,
000160* but WITHOUT ANY WARRANTY; without even the implied warranty of
000170* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000180* GNU General Public License for more details.
000190*
000200* You should have received a copy of the GNU General Public License
000210* along with this software; see the file COPYING.  If not, write to
000220* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000230* Boston, MA 02110-1301 USA
000240*
000250 ENVIRONMENT DIVISION.
000260 CONFIGURATION    SECTION.
000270
000280          COPY "SPECIAL.CBL".
000290
000300 INPUT-OUTPUT SECTION.
000310 FILE-CONTROL.
000320
000330*
000340          COPY "SELWEB.CBL".
000350          COPY "SELMENU.CBL".
000360          COPY "SELABI.CBL".
000370          COPY "SELVIEW.CBL".
000380          COPY "SELUTEN.CBL".
000390          COPY "SELHTM.CBL".
000400
000410 DATA DIVISION.
000420 FILE SECTION.
000430
000440
000450          COPY "FDEWEB.CBL".
000460          COPY "FDEABI.CBL".
000470          COPY "FDEMENU.CBL".
000480          COPY "FDEVIEW.CBL".
000490          COPY "FDEUTEN.CBL".
000500          COPY "FDEHTM.CBL".
000510
000520
000530
000540
000550
000560 WORKING-STORAGE SECTION.
000570
000580
000590          COPY "GLOBALS.CBL".
000600          COPY "IMAGES.CBL".
000610
000620
000630 77 FILENAME          PIC X(50).
000640 77 DATI              PIC X(1024).
000650 77 NAME              PIC X(100).
000660 77 WDATI-LIB         PIC X(2048).
000670 77 SW-TABLE          PIC X.
000680   88 table-on        VALUE "Y".
000690   88 table-oFF       VALUE "N".
000700
000710 77 DEBUG             PIC X.
000720   88 debug-on        VALUE "Y".
000730   88 debug-oFF       VALUE "N".
000740
000750 77 FAST              PIC X.
000760 77 CHECKED           PIC XX.
000770 01 TAB-TABLE.
000780      02 INDEX-TABLE  PIC 9999.
000790      02 IND-TABLE    PIC 9999.
000800      02 ITEM-TABLE OCCURS 20 TIMES.
000810       09 NAME-TABLE  PIC X(30).
000820       09 VALUE-TABLE PIC X(512).
000830      02 TIMES-TABLE  PIC 99.
000840
000850 77 IND1              PIC 9(9).
000860 77 IND2              PIC 9(9).
000870 77 IND3              PIC 9(9).
000880 77 SPAZI				PIC X(100) VALUE SPACE.
000890  LINKAGE SECTION.
000900
000910          COPY "COBW3.CBL".
000920
000930  PROCEDURE       DIVISION USING COBW3.
000940  DECLARATIVES.
000950
000960  MANCA-FILE SECTION.
000970      USE AFTER STANDARD ERROR PROCEDURE ON ARKLIB ARKHTM.
000980  MANCAFILE.
000990          CONTINUE.
001000  EX-MANCAFILE.
001010      EXIT.
001020  END DECLARATIVES.
001030
001040
001050      PERFORM OPEN-I-MENU     THRU EX-OPEN-I-MENU.
001060
001070      MOVE ENTITA-WEB         TO ENT-MENU
001080      MOVE FUNZIONE-WEB       TO FUNZ-MENU
001090      PERFORM LEGGO-TER-MENU  THRU EX-LEGGO-TER-MENU.
001100
001110      IF ESITO-NOK MOVE SPACES TO DESC-MENU.
001120
001130      CLOSE ARKMENU.
001140
001150      MOVE "MENU"             TO NOME-VIEW
001160      MOVE DESC-MENU          TO STRINGA-VIEW.
001170      PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001180
001190
001200      MOVE "N"            TO SW-TABLE.
001210      MOVE "N"            TO DEBUG.
001220
001230      MOVE SPACES         TO FILE-WEB.
001240      MOVE ZEROS          TO IND-WEB.
001250
001260      INSPECT PAGE-WEB TALLYING IND-WEB FOR ALL "\"
001270      INSPECT PAGE-WEB TALLYING IND-WEB FOR ALL "/"
001280      IF IND-WEB = ZEROS
001290      STRING "TEMPLATE\" PAGE-WEB
001300      DELIMITED BY SIZE INTO FILE-WEB
001310      ELSE
001320      MOVE PAGE-WEB       TO FILE-WEB.
001330
001340
001350
001360      MOVE "PAGINA-HTM"       TO NOME-VIEW
001370      MOVE FILE-WEB           TO STRINGA-VIEW.
001380      PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001390
001400
001410
001420      OPEN INPUT ARKWEB.
001430
001440      IF STATUS-WEB NOT = "00"
001450         MOVE SPACES TO COBW3-PUT-STRING
001460         STRING "FILE TEMPLATE NON PRESENTE IN "  FILE-WEB
001470         DELIMITED BY SIZE INTO  COBW3-PUT-STRING
001480         PERFORM LINE-WEB THRU EX-LINE-WEB
001490          GO TO FINE.
001500
001510 CICLO.
001520
001530      READ ARKWEB NEXT RECORD AT END GO TO FINE.
001540
001550      IF DATI-WEB = SPACES GO TO CICLO.
001560
001570***** asterisco commenta la riga
001580
001590      PERFORM VARYING IND FROM 1 BY 1 UNTIL DATI-WEB(IND:1) > SPACES
001600       CONTINUE
001610      END-PERFORM
001620
001630      IF DATI-WEB(IND:1) = "*" GO TO CICLO.
001640
001650      MOVE ZERO   TO IND.
001660
001670      INSPECT DATI-WEB TALLYING IND FOR ALL "("
001680      INSPECT DATI-WEB TALLYING IND FOR ALL ")"
001690
001700
001710      IF IND = 1
001720      STRING "mancano (/) " FILE-WEB DELIMITED BY "  "
001730       " riga: " DATI-WEB
001740      delimited by size into COBW3-PUT-STRING
001750      PERFORM LINE-WEB THRU EX-LINE-WEB
001760       GO TO CICLO.
001770
001780
001790      IF IND NOT = 2 GO TO CICLO.
001800
001810
001820
001830*** softwire switches= FAST(value="SI") scrive la pagina intera invece della singola riga
001840
001850      MOVE ZERO TO IND.
001860      INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND
001870       FOR ALL 'FAST(ENABLED="SI")'
001880      IF IND = 1
001890      MOVE "S"        TO  FAST
001900
001910      MOVE SPACES TO FILE-HTM
001920      ACCEPT TIME-SECTION-NOW FROM TIME
001930      STRING "C:\TEMP\" DELIMITED BY SIZE
001940          SECTION-WEB DELIMITED BY "  "
001950          TIME-SECTION-NOW DELIMITED BY "  "
001960          ".htm" delimited by size
001970           INTO FILE-HTM
001980
001990      OPEN OUTPUT ARKHTM
002000
002010        IF STATUS-HTM NOT = "00"
002020         MOVE SPACES TO FAST
002030         STRING "FILE HTM NON GENERATO "  FILE-HTM
002040         DELIMITED BY SIZE INTO  COBW3-PUT-STRING
002050         PERFORM LINE-WEB THRU EX-LINE-WEB
002060         GO TO FINE
002070        END-IF
002080
002090
002100      go to ciclo.
002110
002120
002130*** softwire switches= debug(value="SI")
002140
002150      MOVE ZERO TO IND.
002160      INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND
002170       FOR ALL 'DEBUG(ENABLED="SI")'
002180      IF IND = 1
002190      SET DEBUG-ON TO TRUE
002200      go to ciclo.
002210
002220      MOVE ZERO TO IND.
002230      INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND
002240       FOR ALL 'DEBUG(ENABLED="NO")'
002250      IF IND = 1
002260      SET DEBUG-OFF TO TRUE
002270      go to ciclo.
002280
002290
002300
002310
002320
002330****  FILENAME nella forma AZIONE(PARAMETRI) DOVE:
002340*
002350*     AZIONE      (il nome del template da aprire su template\AZIONE.HTM
002360*     PARAMETRI   (nella forma NOME="valore")
002370
002380      MOVE SPACES  TO FILENAME DATI INITIALIZE TAB-TABLE.
002390
002400      UNSTRING DATI-WEB DELIMITED BY "("
002410       INTO FILENAME DATI.
002420
002430      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF FILENAME
002440       OR FILENAME(IND:1) > SPACES
002450       CONTINUE
002460      END-PERFORM
002470
002480      IF IND NOT > LENGTH OF FILENAME
002490       MOVE FILENAME(IND:)    TO BUFFER
002500       MOVE BUFFER            TO FILENAME.
002510
002520
002530**** SOFTWIRED= "HTML"
002540
002550      IF FUNCTION UPPER-CASE(FILENAME) = "HTML"
002560       MOVE DATI          TO COBW3-PUT-STRING
002570       PERFORM VARYING IND FROM LENGTH OF COBW3-PUT-STRING BY -1
002580       UNTIL IND = ZERO OR COBW3-PUT-STRING(IND:1) = ")"
002590        CONTINUE
002600       END-PERFORM
002610       MOVE SPACES        TO COBW3-PUT-STRING(IND:1)
002620        PERFORM LINE-WEB THRU EX-LINE-WEB
002630          GO TO CICLO.
002640
002650
002660       MOVE ZERO TO IND IND1
002670       INSPECT DATI TALLYING IND FOR ALL "="
002680
002690       IF IND NOT = ZEROS
002700       MOVE ZERO TO IND
002710       INSPECT DATI-WEB TALLYING IND FOR ALL QUOTE
002720        DIVIDE IND BY  2 GIVING IND REMAINDER IND1
002730
002740        IF IND1 = ZEROS
002750        PERFORM DO-TABLE  THRU EX-DO-TABLE
002760
002770
002780*
002790**** in presenza di use="unfile..." prende solo il valore del file  e lo accoda ignorando il token() che ha solo valore di commento
002800*
002810
002820              if FUNCTION UPPER-CASE(NAME-TABLE (1)) = "USE"
002830                  go to ciclo
002840              end-if
002850
002860
002870         ELSE
002880         STRING "INDICARE UN NUMERO CORRETTO DI PARAMETRI CON GLI APICI"  DATI-WEB
002890         DELIMITED BY SIZE INTO  COBW3-PUT-STRING
002900         PERFORM LINE-WEB THRU EX-LINE-WEB
002910        END-IF
002920       END-IF.
002930
002940
002950
002960
002970
002980      IF TIMES-TABLE = ZERO MOVE 1 TO TIMES-TABLE.
002990
003000      PERFORM ELABORA-LIBRERIA    THRU EX-ELABORA-LIBRERIA
003010          TIMES-TABLE  TIMES.
003020
003030      GO TO CICLO.
003040
003050 FINE.
003060
003070      CLOSE ARKWEB.
003080
003090
003100      IF FAST = "S"
003110       CLOSE ARKHTM
003120        MOVE FILE-HTM TO COBW3-HTML-FILENAME
003130         CALL "COBW3_PUT_HTML" USING COBW3.
003140
003150
003160      EXIT PROGRAM.
003170
003180      COPY "PIOABI.CBL".
003190      COPY "PIOMENU.CBL".
003200      COPY "PIOVIEW.CBL".
003210
003220  FAI-NOME.
003230
003240          IF PATH-WEB = SPACE
003250          MOVE "FILES/FILES.TXT"  TO WDOVE
003260           ELSE
003270          MOVE SPACES             TO WDOVE
003280
003290          STRING PATH-WEB DELIMITED BY "  "
003300            "FILES.TXT" DELIMITED BY SIZE INTO WDOVE.
003310
003320          CALL "NOMIFILE" USING WDOVE WNOME
003330            RETURNING WFILE.
003340
003350  EX-FAI-NOME.
003360          EXIT.
003370
003380
003390
003400 ELABORA-LIBRERIA.
003410
003420**** eventuali librerie personalizzate
003430
003440      MOVE SPACES     TO FILE-LIB
003450      STRING "lib\" DELIMITED BY SIZE
003460           FUNCTION LOWER-CASE(FILENAME) DELIMITED BY "   "
003470              ".htm" delimited by size into FILE-LIB.
003480
003490      OPEN INPUT ARKLIB.
003500
003510
003520      IF STATUS-LIB = "35"
003530       MOVE ZERO TO IND
003540       INSPECT FUNCTION UPPER-CASE(FILE-LIB) TALLYING IND FOR  ALL "OPENFORM"
003550       IF IND = 1
003560       STRING "QUESTO template: " FILE-LIB  DELIMITED BY "   "
003570          " DEVE ESSERE SU ./LIB INVECE NON E' PRESENTE"
003580       delimited by SIZE INTO  COBW3-PUT-STRING
003590       PERFORM LINE-WEB THRU EX-LINE-WEB
003600       GO TO FINE.
003610
003620
003630
003640
003650      IF STATUS-LIB = "35"
003660      MOVE SPACES     TO FILE-LIB
003670      STRING "..\OPENPA\lib\" DELIMITED BY SIZE
003680           FUNCTION LOWER-CASE(FILENAME) DELIMITED BY "   "
003690              ".htm" delimited by size into FILE-LIB
003700      ELSE
003710      CLOSE ARKLIB.
003720
003730
003740
003750      MOVE SPACES     TO COBW3-PUT-STRING
003760
003770      IF DEBUG-ON
003780      STRING  "<!- "  delimited by size
003790           file-lib   delimited by "   "
003800              "->"    delimited by SIZE INTO  COBW3-PUT-STRING
003810      PERFORM LINE-WEB THRU EX-LINE-WEB.
003820
003830      OPEN INPUT ARKLIB.
003840
003850      IF STATUS-LIB = "35"
003860      STRING "template: " FILE-LIB " NON PRESENTE"
003870       delimited by SIZE INTO  COBW3-PUT-STRING
003880      PERFORM LINE-WEB THRU EX-LINE-WEB
003890      ELSE
003900      PERFORM TRATTA-LIB THRU EX-TRATTA-LIB
003910      CLOSE ARKLIB.
003920
003930 EX-ELABORA-LIBRERIA.
003940      EXIT.
003950
003960 LINE-WEB.
003970*
003980      IF COBW3-PUT-STRING = SPACES GO TO EX-LINE-WEB.
003990
004000      IF FAST = "S"
4010
			MOVE ZERO TO WMAXSIZE
			INSPECT function reverse(COBW3-PUT-STRING)
			  	 TALLYING WMAXSIZE FOR LEADING SPACES
				COMPUTE WMAXSIZE = LENGTH OF COBW3-PUT-STRING - WMAXSIZE

004210       MOVE COBW3-PUT-STRING     TO REC-HTM
004220       WRITE REC-HTM
004230         ELSE
004240
004250      MOVE ZEROS              TO     COBW3-PUT-STRING-LENGTH
004260      CALL  "COBW3_PUT_TEXT"  USING  COBW3.
004270
004280
004290      MOVE SPACES             TO COBW3-PUT-STRING.
004300
004310
004320 EX-LINE-WEB.
004330      EXIT.
004340
004350 TRATTA-LIB.
004360
004370      READ ARKLIB NEXT RECORD AT END GO TO EX-TRATTA-LIB.
004380
004390      IF DATI-LIB = SPACES GO TO TRATTA-LIB.
004400
004410*** DOPPIO {{  VUOL DIRE CHE NON DEVE ESSERE PROCESSATO COME VARIABILE MA SOLO COME ISTRUZIONE EASYUI E DIVENTA QUINDI {
004420
004430      MOVE ZERO TO IND.
004440      INSPECT DATI-LIB TALLYING IND FOR ALL "{{"
004450      IF IND NOT = ZEROS
004460      INSPECT DATI-LIB REPLACING ALL "{{" BY " {"
004470      INSPECT DATI-LIB REPLACING ALL "}}" BY "} "
004480      GO TO RICICLO-LIB.
004490
004500
004510
004520      MOVE ZERO TO IND.
004530      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "<TABLE"
004540      IF IND = 1
004550      SET TABLE-ON TO TRUE.
004560
004570      MOVE ZERO TO IND.
004580      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "</TABLE"
004590      IF IND = 1
004600      SET TABLE-OFF TO TRUE.
004610
004620
004630      MOVE ZERO TO IND.
004640      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "</TD"
004650      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004660
004670      MOVE ZERO TO IND.
004680      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "<TD"
004690      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004700
004710
004720      MOVE ZERO TO IND.
004730      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "</TR"
004740      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004750
004760      MOVE ZERO TO IND.
004770      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "<TR"
004780      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004790
004800
004810
004820
004830***** asterisco commenta la riga
004840
004850      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF DATI-LIB
004860          OR DATI-LIB(IND:1) > SPACES
004870       CONTINUE
004880      END-PERFORM.
004890
004900      IF DATI-LIB(IND:1) = "*"
004910
004920       IF DEBUG-OFF
004930        GO TO TRATTA-LIB
004940        ELSE
004950        STRING "<!- "     delimited by size
004960        dati-lib delimited by "   "
004970          "->"    delimited by SIZE INTO  COBW3-PUT-STRING
004980        PERFORM LINE-WEB THRU EX-LINE-WEB
004990        go to TRATTA-LIB
005000       END-IF
005010      END-IF.
005020
005030*
005040***  EVENTUALI {STRINGA} PRESENTI IN NAME-TABLE(1.....N) DA USARE PER COSTANTI TITOLO="PROVA"
005050*      VANNO SOSTITUITI CON VALUE-TABLE(1....N)
005060
005070      PERFORM ESTRAI-STRINGA  THRU EX-ESTRAI-STRINGA.
005080
005090*
005100***  EVENTUALI <COBOL>VARIABILE</COBOL> PRESENTI          DA USARE PER VARIABILI ALLOCATE SU ARKVIEW.
005110*      VANNO SOSTITUITI CON RELATIVO VALORE..
005120
005130
005140      MOVE DATI-LIB           TO WDATI-LIB.
005150
005160      PERFORM ESTRAI-COBOL    THRU EX-ESTRAI-COBOL.
005170
005180      MOVE WDATI-LIB          TO DATI-LIB.
005190
005200
005210      IF DATI-LIB = SPACES GO TO TRATTA-LIB.
005220
005230*
005240***  EVENTUALI @XXXXXYY SOFTWIRED INTERNAL PROCEDURE
005250*
005260
005270      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF DATI-LIB
005280       OR DATI-LIB(IND:1) > SPACES
005290       CONTINUE
005300      END-PERFORM.
005310
005320
005330      IF FUNCTION UPPER-CASE(DATI-LIB(IND:5)) = "@MESI"
005340       PERFORM DO-MESI        THRU EX-DO-MESI
005350       GO TO TRATTA-LIB.
005360
005370
005380      IF FUNCTION UPPER-CASE(DATI-LIB(IND:5)) = "@LOAD"
005390       PERFORM OPEN-I-MENU    THRU EX-OPEN-I-MENU
005400       PERFORM OPEN-I-ABI     THRU EX-OPEN-I-ABI
005410       PERFORM LETTURA-MOD    THRU EX-LETTURA-MOD
005420       CLOSE ARKMENU ARKABI
005430        GO TO TRATTA-LIB.
005440
005450 RICICLO-LIB.
005460
005470      IF DATI-LIB > SPACES
005480      MOVE DATI-LIB           TO COBW3-PUT-STRING
005490      PERFORM LINE-WEB THRU EX-LINE-WEB.
005500
005510      GO TO TRATTA-LIB.
005520
005530 EX-TRATTA-LIB.
005540      EXIT.
005550
005560 ESTRAI-COBOL.
005570
005580      move zeros              TO ind.
005590
005600      INSPECT FUNCTION UPPER-CASE(WDATI-LIB) TALLYING IND FOR ALL "<COBOL>"
005610
005620      IF IND = ZEROS  GO TO EX-ESTRAI-COBOL.
005630
005640
005650 CICLO-ESTRAI-COBOL.
005660
005670      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF WDATI-LIB
005680       OR FUNCTION UPPER-CASE(WDATI-LIB(IND:7)) = "<COBOL>"
005690       CONTINUE
005700      END-PERFORM.
005710
005720      MOVE IND   TO IND-WEB
005730
005740      SUBTRACT 1 FROM IND-WEB.
005750
005760*** se adesso ind-WEB VALE ZERO vuol dire che la stringa iniziava con <COBOL> CIOE' E' lanciata da file(file="<COBOL>NOME</COBOL>"
005770
005780      ADD 7 TO IND
005790
005800      MOVE ZERO TO SIZE-WEB
005810
005820      PERFORM VARYING IND1 FROM IND BY 1 UNTIL IND1 > LENGTH OF WDATI-LIB
005830       OR FUNCTION UPPER-CASE(WDATI-LIB(IND1:8)) = "</COBOL>"
005840       ADD 1 TO SIZE-WEB
005850      END-PERFORM
005860
005870
005880**** nome-VIEW= "LABEL" inserisce la DESC-VIEW della precedente lettura
005890
005900      IF WDATI-LIB(IND:SIZE-WEB) = "LABEL"
005910          MOVE DESC-VIEW          TO BUFFER
005920
005930          IF DESC-VIEW = SPACES
005940          MOVE "descrizione default" to BUFFER
005950          END-IF
005960
005970          MOVE SPACES             TO WDATI-LIB(IND1:8)
005980          ADD 8                   TO IND1
005990          GO TO END-ESTRAI-COBOL.
006000
006010
006020**** nome-VIEW= "CHECK" inserisce la parola checked o spazio per usare lo switchbutton
006030
006040      IF WDATI-LIB(IND:SIZE-WEB) = "CHECK"
006050
006060          INSPECT WDATI-LIB REPLACING ALL '"<COBOL>CHECK</COBOL>"'
006070                                      BY '                      '
006080          INSPECT WDATI-LIB REPLACING ALL '"<cobol>CHECK</cobol>"'
006090                                      BY '                      '
006100
006110              MOVE EDIT-VIEW          TO BUFFER
006120
006130          IF CHECKED = "S"
006140          MOVE "CHECKED"          to BUFFER
006150          ELSE
006160          MOVE SPACES             to BUFFER
006170          END-IF
006180
006190          MOVE SPACES             TO WDATI-LIB(IND1:8)
006200          ADD 8                   TO IND1
006210          GO TO END-ESTRAI-COBOL.
006220
006230
006240
006250**** nome-VIEW= "CHECKED" inserisce la parola checked o spazio per usare lo CHECKBOX
006260
006270      IF WDATI-LIB(IND:SIZE-WEB) = "CHECKED"
006280
006290          INSPECT WDATI-LIB REPLACING ALL '"<COBOL>CHECKED</COBOL>"'
006300                                      BY  '                        '
006310          INSPECT WDATI-LIB REPLACING ALL '"<cobol>CHECKED</cobol>"'
006320                                      BY  '                        '
006330                                                              
006340              MOVE EDIT-VIEW          TO BUFFER
006350
006360          IF CHECKED = "S"
006370          MOVE 'checked="true"'   TO BUFFER
006380          ELSE
006390          MOVE SPACES             to BUFFER
006400          END-IF
006410
006420          MOVE SPACES             TO WDATI-LIB(IND1:8)
006430          ADD 8                   TO IND1
006440          GO TO END-ESTRAI-COBOL.
006450
006460
006470
006480
006490
006500
006510
006520      INITIALIZE VIEW.
006530
006540      MOVE WDATI-LIB(IND:SIZE-WEB)  TO NOME-VIEW
006550
006560
006570**** ELIMINA </COBOL> dal buffer WDATI-LIB
006580
006590      MOVE SPACES TO WDATI-LIB(IND1:8)
006600
006610      ADD 8           TO IND1.
006620
006630
006640      PERFORM LEGGO-NOLOCK-VIEW   THRU EX-LEGGO-NOLOCK-VIEW.
006650
006660      IF ESITO-NOK MOVE SPACES TO EDIT-VIEW.
006670
006680      MOVE EDIT-VIEW              TO BUFFER.
006690
006700
006710      IF NOME-VIEW(1:7) = "COGNOME"
006720       OR NOME-VIEW(1:4) = "NOME"
006730
006740      INSPECT BUFFER REPLACING FIRST "'" BY " ".
006750
006760
006770      MOVE EDIT-VIEW              TO CHECKED.
006780
006790
006800
006810
006820 END-ESTRAI-COBOL.
006830
006840      PERFORM DIVISORE            THRU EX-DIVISORE.
006850
006860      MOVE BUFFER                 TO ARGUMENT.
006870
006880      IF IND-WEB > ZEROS
006890        MOVE WDATI-LIB(1:IND-WEB) TO BUFFER
006900       ELSE
006910        MOVE SPACES               TO BUFFER.
006920
006930      PERFORM DIVISORE            THRU EX-DIVISORE.
006940
006950      MOVE WDATI-LIB(IND1:)       TO BUFFER1.
006960
006970      MOVE SPACES TO WDATI-LIB
006980       STRING BUFFER DELIMITED BY "/DIVISORE/"
006990           ARGUMENT DELIMITED BY "/DIVISORE/"
007000            BUFFER1 DELIMITED BY SIZE INTO WDATI-LIB.
007010
007020**** GESTISCE PIU CAMPI NELLA STESSA RIGA...
007030
007040      GO TO ESTRAI-COBOL.
007050
007060 EX-ESTRAI-COBOL.
007070      EXIT.
007080
007090***** attenzione usare sempre coppie !!! se c'e uno script javascript va in loop...
007100
007110 ESTRAI-STRINGA.
007120
007130      move zeros              TO ind.
007140
007150      INSPECT DATI-LIB TALLYING IND FOR ALL "{"
007160      INSPECT DATI-LIB TALLYING IND FOR ALL "}"
007170
007180      IF IND < 2      GO TO EX-ESTRAI-STRINGA.
007190
007200 CICLO-ESTRAI-STRINGA.
007210
007220      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF DATI-LIB
007230       OR DATI-LIB(IND:1) = "{"
007240       CONTINUE
007250      END-PERFORM.
007260
007270
007280      MOVE IND            TO IND1
007290      MOVE IND1           TO IND2
007300      ADD  1              TO IND2
007310      SUBTRACT 1 FROM IND1
007320
007330      MOVE SPACES         TO FIELD-WEB
007340      MOVE ZEROS          TO IND3
007350
007360      PERFORM VARYING IND FROM IND2 BY 1 UNTIL IND2 > LENGTH OF DATI-LIB
007370       OR DATI-LIB(IND:1) = "}"
007380
007390           ADD 1                TO IND3
007400           MOVE DATI-LIB(IND:1) TO FIELD-WEB(IND3:1)
007410
007420      END-PERFORM.
007430
007440      MOVE DATI-LIB(1:IND1)       TO BUFFER
007450
007460      PERFORM DIVISORE            THRU EX-DIVISORE
007470
007480
007490
007500      ADD 1                       TO IND
007510      MOVE DATI-LIB(IND:)         TO BUFFER1
007520
007530      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND >  20
007540       OR FUNCTION UPPER-CASE(FIELD-WEB) = FUNCTION UPPER-CASE(NAME-TABLE(IND))
007550      CONTINUE
007560
007570      END-PERFORM.
007580
007590
007600
007610*** NON C'E
007620
007630      IF IND > 20
007640       MOVE SPACES TO DATI-LIB
007650       STRING BUFFER DELIMITED BY "/DIVISORE/"
007660           " " BUFFER1 DELIMITED BY SIZE INTO DATI-LIB
007670
007680***** ELIMINA LA STRINGA non assegnata che rimane titolo=" "
007690          PERFORM VARYING IND-WEB FROM 1 BY 1 UNTIL IND-WEB > LENGTH OF DATI-LIB
007700
007710
007720           IF IND-WEB < LENGTH OF DATI-LIB - 4
007730           AND DATI-LIB(IND-WEB:4) = '=" "'
007740           MOVE SPACES TO DATI-LIB(IND-WEB:4)
007750           SUBTRACT 1 FROM IND-WEB
007760           PERFORM VARYING IND-WEB FROM IND-WEB BY -1 UNTIL IND-WEB = ZERO
007770           OR DATI-LIB(IND-WEB:1) = SPACES
007780           MOVE SPACES TO DATI-LIB(IND-WEB:1)
007790           END-PERFORM
007800           END-IF
007810
007820          END-PERFORM
007830
007840      ELSE
007850
007860       MOVE SPACES TO DATI-LIB
007870
007880* item-- combo formato VALORE, STRINGA COMBO ESEMPIO M, MASCHIO la variabile per il confronto con M e' in memoria n.b deve essere
007890
007900          IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "ITEM"
007910          PERFORM DO-ITEM     THRU EX-DO-ITEM
007920          GO TO EX-ESTRAI-STRINGA
007930          END-IF
007940
007950* DEFAULT valore di default da assegnare ad un CHECK perche se non spuntato il programma web NON riporta nessun valore e lascerebbe il precedente
007960
007970
007980          IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "DEFAULT"
007990          PERFORM DO-DEFAULT  THRU EX-DO-DEFAULT
008000          GO TO EX-ESTRAI-STRINGA
008010          END-IF
008020
008030
008040
008050      IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "NAME"
008060          MOVE VALUE-TABLE(IND)       TO NAME
008070          INSPECT NAME REPLACING ALL "/DIVISORE/"
008080                                  BY "          "
008090          END-IF
008100
008110
008120
008130
008140       STRING BUFFER DELIMITED BY "/DIVISORE/"
008150           VALUE-TABLE(IND) DELIMITED BY "/DIVISORE/"
008160            BUFFER1 DELIMITED BY SIZE INTO DATI-LIB.
008170
008180
008190      GO TO ESTRAI-STRINGA.
008200
008210 EX-ESTRAI-STRINGA.
008220      EXIT.
008230
008240 DO-DEFAULT.
008250
008260
008270      MOVE NAME               TO NOME-VIEW.
008280
008290      READ ARKVIEW NO LOCK KEY IS CHIAVE-VIEW
008300       INVALID KEY  GO TO EX-DO-DEFAULT.
008310
008320
008330      MOVE VALUE-TABLE(IND)   TO DEFAULT-VIEW.
008340
008350      INSPECT DEFAULT-VIEW REPLACING ALL "/DIVISORE/"
008360                                      BY "          "
008370
008380
008390      MOVE "S"                TO USA-DEFAULT-VIEW.
008400
008410      PERFORM AGGIORNO-VIEW   THRU EX-AGGIORNO-VIEW
008420
008430      IF ESITO-NOK
008440          STRING "Errore rewrite " CHIAVE-VIEW
008450           DElimited by SIZE INTO  COBW3-PUT-STRING
008460            PERFORM LINE-WEB THRU EX-LINE-WEB.
008470
008480
008490 EX-DO-DEFAULT.
008500      EXIT.
008510
008520 DO-MESI.
008530
008540      PERFORM VARYING MM-NORMALE FROM 1 BY 1 UNTIL MM-NORMALE > 12
008550
008560          MOVE SPACES     TO COBW3-PUT-STRING
008570
008580          IF MM-NORMALE = EDIT-VIEW(1:2)
008590           MOVE " selected:true, " TO ARGUMENT
008600          ELSE
008610           MOVE SPACES             TO ARGUMENT
008620          END-IF
008630
008640          STRING "{ value:'" DELIMITED BY SIZE
008650              MM-NORMALE DELIMITED BY SIZE
008660              "'," DELIMITED BY SIZE
008670              ARGUMENT DELIMITED BY "   "
008680              " text:'" DELIMITED BY SIZE
008690              MESE-IN-CORSO(MM-NORMALE) DELIMITED BY "   "
008700              "',iconCls:'icon-" DELIMITED BY SIZE
008710              FUNCTION LOWER-CASE(MESE-IN-CORSO(MM-NORMALE)) (1:3)
008720                  "'},"
008730                   DELIMITED BY SIZE INTO COBW3-PUT-STRING
008740
008750          IF MM-NORMALE = 12
008760           INSPECT COBW3-PUT-STRING REPLACING ALL "}," BY "} "
008770          END-IF
008780
008790
008800
008810          PERFORM LINE-WEB                THRU EX-LINE-WEB
008820
008830      END-PERFORM.
008840
008850
008860 EX-DO-MESI.
008870      EXIT.
008880
008890
008900**** VALUE-TABLE(IND) = "M, MASCHIO" > value:'M' , text:'MASCHIO'....
008910
008920 DO-ITEM.
008930
008940         MOVE SPACES TO ARGUMENT BUFFER BUFFER1 DATI-LIB
008950         UNSTRING VALUE-TABLE(IND) DELIMITED   ","
008960           INTO ARGUMENT  BUFFER
008970           UNSTRING BUFFER DELIMITED BY "/DIVISORE/"
008980           INTO BUFFER1.
008990*** add a required comma ! be carefull
009000
009010          INSPECT BUFFER1 REPLACING ALL "' iconCls:"
009020                               BY       "',iconCls:"
009030
009040** clear the item (so I'll process next in the table list
009050
009060           INITIALIZE ITEM-TABLE (IND).
009070
009080****
009090           IF ARGUMENT = EDIT-VIEW
009100           MOVE SPACES TO DATI-LIB
009110           STRING "          { value:'" DELIMITED BY SIZE
009120                              ARGUMENT  DELIMITED BY "    "
009130                             "',selected:true, text:'"
009140                                        DELIMITED BY SIZE
009150                              BUFFER1   DELIMITED BY "    "
009160                              "'},"     DELIMITED BY SIZE
009170           INTO DATI-LIB
009180          ELSE
009190           STRING "          { value:'" DELIMITED BY SIZE
009200                              ARGUMENT  DELIMITED BY "    "
009210                             "',text:'" DELIMITED BY SIZE
009220                              BUFFER1   DELIMITED BY "    "
009230                              "'},"     DELIMITED BY SIZE
009240           INTO DATI-LIB.
009250
009260          IF IND < INDEX-TABLE
009270           AND FUNCTION UPPER-CASE(NAME-TABLE(IND + 1)) NOT = "ITEM"
009280           INSPECT DATI-LIB REPLACING ALL "}," BY "} ".
009290
009300 EX-DO-ITEM.
009310      EXIT.
009320
009330 DIVISORE.
009340
009350			IF BUFFER = SPACES
009360		       MOVE "/DIVISORE/" TO BUFFER
009370			ELSE
009380			MOVE SPACES			TO BUFFER1
009390			STRING BUFFER DELIMITED BY SPAZI 
009400			 "/DIVISORE/"	DELIMITED BY SIZE 
009410			 INTO BUFFER1
009420
009430			MOVE BUFFER1		TO BUFFER.
009440
009450
009460*         PERFORM VARYING IND4-WEB FROM LENGTH OF BUFFER  BY -1
009470*				  UNTIL IND4-WEB = ZEROS
009480*				OR BUFFER(IND4-WEB:1) > SPACES
009490*                CONTINUE
009500*                END-PERFORM.
009510
009520*      ADD 1 TO IND4-WEB.
009530
009540*     MOVE "/DIVISORE/" TO BUFFER(IND4-WEB:).
009550
009560 EX-DIVISORE.
009570      EXIT.
009580
009590
009600
009610 DO-TABLE.
009620
009630      MOVE 0                  TO INDEX-TABLE.
009640      MOVE 1                  TO IND.
009650
009660 CICLO-TABLE.
009670
009680       ADD  1                 TO INDEX-TABLE.
009690
009700
009710*** SI POSIZIONA SUL PRIMO CARATTERE  SIGNIFICATIVO
009720
009730      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
009740       OR DATI(IND:1) > SPACES
009750       CONTINUE
009760      END-PERFORM.
009770
009780      IF IND > LENGTH OF DATI
009790      GO TO END-DO-TABLE.
009800
009810
009820      IF DATI(IND:) = ")"
009830       GO TO END-DO-TABLE.
009840
009850
009860      MOVE 1                  TO IND-TABLE
009870
009880      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
009890       OR DATI(IND:1) = "="
009900       OR DATI(IND:) = SPACES
009910
009920          IF IND-TABLE NOT  > LENGTH OF NAME-TABLE( INDEX-TABLE)
009930          MOVE DATI(IND:1)    TO NAME-TABLE( INDEX-TABLE) (IND-TABLE:1)
009940          ADD 1               TO IND-TABLE
009950          END-IF
009960
009970       CONTINUE
009980      END-PERFORM.
009990
010000      IF IND > LENGTH OF DATI
010010      GO TO END-DO-TABLE.
010020
010030
010040      IF DATI(IND:1) = "="
010050      ADD 1       TO IND
010060      MOVE 1      TO IND-TABLE
010070
010080****  SI POSIZIONA SUL PRIMO '"' DOPO '=" esempio title="TESTO"
010090*                                                       ! < qui
010100
010110      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
010120       OR DATI(IND:1) = '"'
010130       CONTINUE
010140      END-PERFORM
010150
010160      ADD 1               TO IND
010170
010180      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
010190       OR DATI(IND:1) = '"'
010200       OR DATI(IND:) = SPACES
010210
010220          IF IND-TABLE NOT  > LENGTH OF VALUE-TABLE( INDEX-TABLE)
010230          MOVE DATI(IND:1)    TO VALUE-TABLE( INDEX-TABLE) (IND-TABLE:1)
010240          ADD 1               TO IND-TABLE
010250          END-IF
010260
010270       CONTINUE
010280      END-PERFORM
010290
010300****SOFWIRED update: FILE -> appende il file indicato ignorando il token di provenienza qualcosa()
010310
010320
010330      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "USE"
010340      MOVE VALUE-TABLE(INDEX-TABLE)       TO WDATI-LIB
010350      PERFORM ESTRAI-COBOL                THRU EX-ESTRAI-COBOL
010360      move WDATI-LIB                      TO FILE-LIB
010370      PERFORM APPEND-FILE                 THRU EX-APPEND-FILE
010380      GO TO EX-DO-TABLE
010390      END-IF
010400
010410****SOFWIRED update: size--> width:
010420
010430
010440
010450      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "SIZE"
010460      MOVE VALUE-TABLE(INDEX-TABLE)       TO ARGUMENT
010470       MOVE SPACES TO VALUE-TABLE(INDEX-TABLE)
010480      STRING "width:" DELIMITED BY SIZE ARGUMENT DELIMITED BY "    "
010490          ";"  DELIMITED BY SIZE INTO VALUE-TABLE(INDEX-TABLE)
010500      END-IF
010510
010520
010530      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "CHAR"
010540      MOVE VALUE-TABLE(INDEX-TABLE)       TO ARGUMENT
010550       MOVE SPACES TO VALUE-TABLE(INDEX-TABLE)
010560      STRING "validType:'length[0," DELIMITED BY SIZE ARGUMENT DELIMITED BY "    "
010570          "]',"    DELIMITED BY SIZE INTO VALUE-TABLE(INDEX-TABLE)
010580      END-IF
010590
010600
010610      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "TYPE"
010620      MOVE VALUE-TABLE(INDEX-TABLE)       TO ARGUMENT
010630       IF FUNCTION UPPER-CASE(ARGUMENT) = "MAIL"
010640       MOVE "validType:'email' ," TO VALUE-TABLE(INDEX-TABLE)
010650      END-IF
010660      END-IF.
010670
010680
010690
010700
010710      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "TIMES"
010720           MOVE VALUE-TABLE(INDEX-TABLE)      TO TIMES-TABLE(1:)
010730           IF TIMES-TABLE(2:1) = SPACES
010740           MOVE TIMES-TABLE(1:1)  TO TIMES-TABLE(2:1)
010750           MOVE 0                 TO TIMES-TABLE(1:1).
010760
010770***** CE' UN ELEMENTO DI MENU: DEVE CONTROLLARE SE ABILITATO O MENO
010780      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "DISABLED"
010790       PERFORM OPEN-I-ABI             THRU EX-OPEN-I-ABI
010800
010810       INITIALIZE ABILITAZIONE
010820
010830       MOVE VALUE-TABLE(INDEX-TABLE)  TO MOD-ABI
010840       MOVE 01                        TO ENTE-ABI
010850       IF GRUPPO-UTEN = ZEROS MOVE 1  TO GRUPPO-UTEN END-IF
010860       MOVE GRUPPO-UTEN               TO GRUPPO-ABI
010870
010880       PERFORM LEGGO-ABI              THRU EX-LEGGO-ABI
010890
010900       IF ESITO-NOK MOVE "true "      TO VALUE-TABLE(INDEX-TABLE)
010910
010920          IF NOME-UTEN = "ADMIN"
010930              OR GRUPPO-UTEN = 99
010940              MOVE "false"            TO VALUE-TABLE(INDEX-TABLE)
010950          end-if
010960
010970      ELSE
010980       MOVE "false"                   TO VALUE-TABLE(INDEX-TABLE)
010990       end-if
011000
011010       CLOSE ARKABI.
011020
011030
011040
011050      PERFORM VARYING IND-WEB FROM LENGTH OF VALUE-TABLE(INDEX-TABLE) BY -1
011060       UNTIL VALUE-TABLE(INDEX-TABLE) (IND-WEB:1) > SPACES
011070          OR IND-WEB = ZERO
011080       CONTINUE
011090      END-PERFORM
011100
011110      ADD 1 TO IND-WEB
011120      MOVE "/DIVISORE/" TO VALUE-TABLE(INDEX-TABLE) (IND-WEB:).
011130
011140
011150
011160      IF IND NOT > LENGTH OF DATI
011170       ADD 1                  TO IND
011180       GO TO CICLO-TABLE.
011190
011200 END-DO-TABLE.
011210
011220      SUBTRACT 1 FROM INDEX-TABLE
011230
011240      IF DEBUG-ON
011250
011260      MOVE 1                  TO IND
011270
011280      PERFORM INDEX-TABLE TIMES
011290
011300      STRING  "<!- "  delimited by size
011310           " Ind "  IND  " "
011320              NAME-TABLE(IND) DELIMITED BY "    "
011330                   " contiene: " DELIMITED BY SIZE
011340              VALUE-TABLE(IND) DELIMITED BY "    "
011350              " ->"   delimited by SIZE INTO  COBW3-PUT-STRING
011360      PERFORM LINE-WEB THRU EX-LINE-WEB
011370
011380      ADD 1 TO IND
011390
011400      END-PERFORM.
011410
011420
011430 EX-DO-TABLE.
011440      EXIT.
011450
011460**** DUMMY
011470 VIS-MESS.
011480 EX-VIS-MESS.
011490      EXIT.
011500
011510
011520
011530**** DEVE ESISTERE UNA VARIABILE {menu} IN TABELLA
011540
011550 LETTURA-MOD.
011560
011570          INITIALIZE MENU.
011580
011590          PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > INDEX-TABLE
011600
011610          IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "MENU"
011620            MOVE VALUE-TABLE(IND)     TO DATI-LIB(6:2)
011630          END-IF
011640
011650          END-PERFORM.
011660
011670          MOVE DATI-LIB(6:2)      TO DEP-MOD.
011680
011690          PERFORM STARTO-MENU     THRU EX-STARTO-MENU.
011700          IF ESITO-NOK
011710          STRING  "MANCA MENU" MOD-MENU DELIMITED BY SIZE INTO MESSAGGIO
011720           PERFORM VIS-MESS    THRU EX-VIS-MESS
011730            GO TO EX-LETTURA-MOD.
011740
011750          SET FIRST-TIME  TO TRUE.
011760
011770 CICLO-LETTURA-MOD.
011780
011790          PERFORM LEGGO-NEXT-MENU THRU EX-LEGGO-NEXT-MENU.
011800
011810          IF FINE-FILE = "S" GO TO END-LETTURA-MOD.
011820
011830          IF MOD-MENU NOT = DEP-MOD GO CICLO-LETTURA-MOD.
011840
011850          IF ENT-MENU = SPACES GO TO CICLO-LETTURA-MOD.
011860
011870
011880          IF FUNCTION UPPER-CASE(DESC-MENU) = "SEPARATORE"
011890           MOVE '        <div class="menu-sep"></div>' TO DATI-WEB
011900           PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB
011910            GO TO CICLO-LETTURA-MOD.
011920
011930          INITIALIZE ABILITAZIONE.
011940
011950          MOVE GRUPPO-UTEN        TO GRUPPO-ABI.
011960          IF GRUPPO-ABI = ZEROS
011970            MOVE 1                TO GRUPPO-ABI.
011980
011990          MOVE 01                 TO ENTE-ABI.
012000          MOVE CHIAVE-SEC-MENU    TO CHIAMATA-ABI.
012010
012020          PERFORM ABILITAZIONI    THRU EX-ABILITAZIONI.
012030
012040          IF DISABLED AND MOSTRA-MENU-UTEN = "N"
012050           GO TO CICLO-LETTURA-MOD.
012060
012070
012080          IF FUNZ-MENU = SPACES
012090              PERFORM MAKE-ENTITA   THRU EX-MAKE-ENTITA
012100           ELSE
012110              PERFORM MAKE-FUNZIONE THRU EX-MAKE-FUNZIONE.
012120
012130          GO TO CICLO-LETTURA-MOD.
012140
012150 END-LETTURA-MOD.
012160
012170          MOVE "          </div></div>"     TO DATI-WEB
012180          PERFORM PREPARA-LINE-WEB                  THRU EX-PREPARA-LINE-WEB.
012190
012200 EX-LETTURA-MOD.
012210          EXIT.
012220
012230 ABILITAZIONI.
012240
012250          MOVE "N"                TO FLAG-DISABLED.
012260
012270          PERFORM LEGGO-ABI       THRU EX-LEGGO-ABI.
012280
012290          IF ESITO-NOK
012300           SET DISABLED           TO TRUE.
012310
012320          IF NOME-UTEN = "ADMIN" OR GRUPPO-UTEN > 99
012330           MOVE "N"                TO FLAG-DISABLED.
012340
012350 EX-ABILITAZIONI.
012360          EXIT.
012370 MAKE-ENTITA.
012380
012390          IF NOT FIRST-TIME
012400          MOVE   "        </div></div>"     TO DATI-WEB
012410          PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB
012420          ELSE
012430          MOVE "N"                        TO FLAG-TIME.
012440
012450
012460
012470          IF DISABLED
012480                  MOVE "disabled:true"            to wdisable
012490          else
012500                  MOVE "disabled:false"           to wdisable.
012510
012520          IF IMG-MENU > ZEROS
012530                  AND IMG-MENU < 20
012540                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
012550
012560              else
012570                  MOVE SPACES                     to wIMAGES.
012580
012590          MOVE SPACES TO DATI-WEB.
012600
012610
012620          STRING "             " DELIMITED BY SIZE
012630          '<div style="color:#0066cc" data-options="'
012640                  wdisable delimited by  "  "
012650                  wimages delimited by "   "
012660                   '"><span>' delimited BY  SIZE
012670          DESC-MENU DELIMITED BY "    " "</span><div>"
012680              DELIMITED BY SIZE INTO DATI-WEB.
012690
012700          PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB.
012710
012720
012730 EX-MAKE-ENTITA.
012740          EXIT.
012750
012760
012770
012780 MAKE-FUNZIONE.
012790
012800
012810          IF DISABLED
012820          string
012830          '            <div data-options="disabled:true">'
012840          DESC-MENU DELIMITED BY "     " "</div>"
012850              DELIMITED BY SIZE INTO DATI-WEB
012860          ELSE
012870          STRING
012880          '            <div style="color:#0066cc">'  DELIMITED BY SIZE
012890          DESC-MENU DELIMITED BY "     " "</div>"
012900              DELIMITED BY SIZE INTO DATI-WEB.
012910
012920          IF DISABLED
012930                  MOVE "disabled:true"            to wdisable
012940                  else
012950                  MOVE "disabled:false"           to wdisable.
012960
012970          IF IMG-MENU > ZEROS
012980                  AND IMG-MENU < 20
012990                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
013000
013010                  else
013020                  MOVE SPACES                     to wIMAGES.
013030
013040          MOVE SPACES TO DATI-WEB.
013050
013060          IF NOT DISABLED
013070
013080          STRING "             " DELIMITED BY SIZE
013090                  '<div data-options="'
013100                  wdisable delimited by  "  "
013110                  wimages delimited by "   "
013120                  '"><a style="text-decoration:none;" href="' DELIMITED BY SIZE
013130                  PROG-MENU DELIMITED BY "   "
013140                  ".exe?MK-KEY=" SECTION-WEB DELIMITED BY SIZE
013150                  "&MK-ENTITA=" ENT-MENU DELIMITED BY SIZE
013160                  "&MK-FUNZIONE=" FUNZ-MENU DELIMITED BY SIZE
013170                  "&MK-PAGE=" DLL-MENU DELIMITED BY "   "
013180*                '" class="easyui-menubotton">' DELIMITED BY SIZE
013190                 '">' DELIMITED BY SIZE
013190                  DESC-MENU DELIMITED BY "    "
013200                  "</a></div>"
013210                  DELIMITED BY SIZE INTO DATI-WEB
013220            ELSE
013230
013240          STRING "             " DELIMITED BY SIZE
013250                  '<div data-options="'
013260                  wdisable delimited by  "  "
013270                  wimages delimited by "   "
013280                  '"><a style="text-decoration:none;" href="javascript:void(0)"' DELIMITED BY SIZE
013290                  '" class="easyui-menubotton">' DELIMITED BY SIZE
013300                  DESC-MENU DELIMITED BY "    "
013310                  "</a></div>"
013320                  DELIMITED BY SIZE INTO DATI-WEB.
013330
013340
013350          PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB.
013360
013370 EX-MAKE-FUNZIONE.
013380          EXIT.
013390
013400 PREPARA-LINE-WEB.
013410
013420          MOVE DATI-WEB                   TO COBW3-PUT-STRING.
013430
013440          PERFORM LINE-WEB                THRU EX-LINE-WEB.
013450
013460 EX-PREPARA-LINE-WEB.
013470          EXIT.
013480
013490 APPEND-FILE.
013500
013510
013520          OPEN INPUT ARKLIB.
013530
013540          IF STATUS-LIB = "35"
013550*         STRING "file da appendere:" FILE-LIB " NON PRESENTE"
013560*          delimited by SIZE INTO  COBW3-PUT-STRING
013570*         PERFORM LINE-WEB THRU EX-LINE-WEB
013580
013590          MOVE 'var data = [{"ELEMENTO":"<strong>SCHEDA</strong>","RIGA":"0001","DESC":"<strong>DATI NON PRESENTI</strong>"}];'
013600          TO COBW3-PUT-STRING     PERFORM LINE-WEB THRU EX-LINE-WEB
013610           go to EX-APPEND-FILE.
013620
013630 CICLO-APPEND.
013640
013650          READ ARKLIB NEXT RECORD AT END GO TO END-APPEND-FILE.
013660
013670
013680***** asterisco commenta la riga
013690
013700          PERFORM VARYING IND FROM 1 BY 1 UNTIL DATI-LIB(IND:1) > SPACES
013710           CONTINUE
013720          END-PERFORM
013730
013740          IF DATI-LIB(IND:1) = "*"
013750
013760           IF DEBUG-OFF
013770            GO TO CICLO-APPEND
013780                ELSE
013790            STRING "<!- "     delimited by size
013800            dati-lib delimited by "   "
013810              "->"    delimited by SIZE INTO  COBW3-PUT-STRING
013820            PERFORM LINE-WEB THRU EX-LINE-WEB
013830            go to CICLO-APPEND
013840           END-IF
013850          END-IF.
013860

005140      	MOVE DATI-LIB           TO WDATI-LIB.
005150
005160      	PERFORM ESTRAI-COBOL    THRU EX-ESTRAI-COBOL.
005170
005180      	MOVE WDATI-LIB          TO DATI-LIB.
005190
005200

013870
013880          MOVE DATI-LIB           TO COBW3-PUT-STRING.
013890
013900          IF DATI-LIB NOT = SPACES
013910          PERFORM LINE-WEB THRU EX-LINE-WEB.
013920
013930          GO TO CICLO-APPEND.
013940
013950 END-APPEND-FILE.
013960
013970          CLOSE ARKLIB.
013980
013990 EX-APPEND-FILE.
014000          EXIT.
