000010 @OPTIONS ALPHAL(WORD)
000020*
000030 identification division.
000040 PROGRAM-ID. MAKEFORM.
000050 AUTHOR. FEDERICO PRIOLO AGOSTO 2023
000060
000070*
000080* Copyright (C) 2010-2022 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000090*
000100* This program is free software; you can redistribute it and/or modify
000110* it under the terms of the GNU General Public License as published by
000120* the Free Software Foundation; either version 2, or (at your option)
000130* any later version.
000140*
000150* This program is distributed in the hope that it will be useful,
000160* but WITHOUT ANY WARRANTY; without even the implied warranty of
000170* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000180* GNU General Public License for more details.
000190*
000200* You should have received a copy of the GNU General Public License
000210* along with this software; see the file COPYING.  If not, write to
000220* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000230* Boston, MA 02110-1301 USA
000240*
000250 ENVIRONMENT DIVISION.
000260 CONFIGURATION    SECTION.
000270
000280          COPY "SPECIAL.CBL".
000290
000300 INPUT-OUTPUT SECTION.
000310 FILE-CONTROL.
000320
000330*
000340          COPY "SELWEB.CBL".
000350          COPY "SELMENU.CBL".
000360          COPY "SELABI.CBL".
000370          COPY "SELVIEW.CBL".
000380          COPY "SELUTEN.CBL".
000390          COPY "SELHTM.CBL".
000400
000410 DATA DIVISION.
000420 FILE SECTION.
000430
000440
000450          COPY "FDEWEB.CBL".
000460          COPY "FDEABI.CBL".
000470          COPY "FDEMENU.CBL".
000480          COPY "FDEVIEW.CBL".
000490          COPY "FDEUTEN.CBL".
000500          COPY "FDEHTM.CBL".
000510
000520
000530
000540
000550
000560 WORKING-STORAGE SECTION.
000570
000580
000590          COPY "GLOBALS.CBL".
000600          COPY "IMAGES.CBL".
000610
000620
000630 77 FILENAME          PIC X(50).
000640 77 DATI              PIC X(1024).
000650 77 NAME              PIC X(100).
000660 77 WDATI-LIB         PIC X(2048).
000670 77 SW-TABLE          PIC X.
000680   88 table-on        VALUE "Y".
000690   88 table-oFF       VALUE "N".
000700
000710 77 DEBUG             PIC X.
000720   88 debug-on        VALUE "Y".
000730   88 debug-oFF       VALUE "N".
000740
000750 77 FAST              PIC X.
000760 77 CHECKED           PIC XX.
000770 01 TAB-TABLE.
000780      02 INDEX-TABLE  PIC 9999.
000790      02 IND-TABLE    PIC 9999.
000800      02 ITEM-TABLE OCCURS 20 TIMES.
000810       09 NAME-TABLE  PIC X(30).
000820       09 VALUE-TABLE PIC X(512).
000830      02 TIMES-TABLE  PIC 99.
000840
000850 77 IND1              PIC 9(9).
000860 77 IND2              PIC 9(9).
000870 77 IND3              PIC 9(9).
000880 77 SPAZI				PIC X(100) VALUE SPACE.
000890  LINKAGE SECTION.
000900
000910          COPY "COBW3.CBL".
000920
000930  PROCEDURE       DIVISION USING COBW3.
000940  DECLARATIVES.
000950
000960  MANCA-FILE SECTION.
000970      USE AFTER STANDARD ERROR PROCEDURE ON ARKLIB  ARKLIB1 ARKHTM.
000980  MANCAFILE.
000990          CONTINUE.
001000  EX-MANCAFILE.
001010      EXIT.
001020  END DECLARATIVES.
001030
001040
001050      PERFORM OPEN-I-MENU     THRU EX-OPEN-I-MENU.
001060
001070      MOVE ENTITA-WEB         TO ENT-MENU
001080      MOVE FUNZIONE-WEB       TO FUNZ-MENU
001090      PERFORM LEGGO-TER-MENU  THRU EX-LEGGO-TER-MENU.
001100
001110      IF ESITO-NOK MOVE SPACES TO DESC-MENU.
001120
001130      CLOSE ARKMENU.
001140
001150      MOVE "MENU"             TO NOME-VIEW
001160      MOVE DESC-MENU          TO STRINGA-VIEW.
001170      PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001180
001190
001200      MOVE "N"            TO SW-TABLE.
001210      MOVE "N"            TO DEBUG.
001220
001230      MOVE SPACES         TO FILE-WEB.
001240      MOVE ZEROS          TO IND-WEB.
001250
001260      INSPECT PAGE-WEB TALLYING IND-WEB FOR ALL "\"
001270      INSPECT PAGE-WEB TALLYING IND-WEB FOR ALL "/"
001280      IF IND-WEB = ZEROS
001290      STRING "TEMPLATE\" PAGE-WEB
001300      DELIMITED BY SIZE INTO FILE-WEB
001310      ELSE
001320      MOVE PAGE-WEB       TO FILE-WEB.
001330
001340
001350
001360      MOVE "PAGINA-HTM"       TO NOME-VIEW
001370      MOVE FILE-WEB           TO STRINGA-VIEW.
001380      PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001390
001400
001410
001420      OPEN INPUT ARKWEB.
001430
001440      IF STATUS-WEB NOT = "00"
001450         MOVE SPACES TO COBW3-PUT-STRING
001460         STRING  " ERRORE: "  STATUS-WEB "  "  FILE-WEB
001470         DELIMITED BY "   " INTO  COBW3-PUT-STRING
001480         PERFORM LINE-WEB THRU EX-LINE-WEB
001490          GO TO FINE.
001500
001510 CICLO.
001520
001530      READ ARKWEB NEXT RECORD AT END GO TO FINE.
001540
001550      IF DATI-WEB = SPACES GO TO CICLO.
001560
001570***** asterisco commenta la riga
001580
001590      PERFORM VARYING IND FROM 1 BY 1 UNTIL DATI-WEB(IND:1) > SPACES
001600       CONTINUE
001610      END-PERFORM
001620
001630      IF DATI-WEB(IND:1) = "*" GO TO CICLO.
001640
001650      MOVE ZERO   TO IND.
001660
001670      INSPECT DATI-WEB TALLYING IND FOR ALL "("
001680      INSPECT DATI-WEB TALLYING IND FOR ALL ")"
001690
001700
001710      IF IND = 1
001720      STRING "mancano (/) " FILE-WEB DELIMITED BY "  "
001730       " riga: " DATI-WEB
001740      delimited by size into COBW3-PUT-STRING
001750      PERFORM LINE-WEB THRU EX-LINE-WEB
001760       GO TO CICLO.
001770
001780
001790      IF IND NOT = 2 GO TO CICLO.
001800
001810
001820
001830*** softwire switches= FAST(value="SI") scrive la pagina intera invece della singola riga
001840
001850      MOVE ZERO TO IND.
001860      INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND
001870       FOR ALL 'FAST(ENABLED="SI")'
001880      IF IND = 1
001890      MOVE "S"        TO  FAST
001900
001910      MOVE SPACES TO FILE-HTM
001920      ACCEPT TIME-SECTION-NOW FROM TIME
001930      STRING "C:\TEMP\" DELIMITED BY SIZE
001940          SECTION-WEB DELIMITED BY "  "
001950          TIME-SECTION-NOW DELIMITED BY "  "
001960          ".htm" delimited by size
001970           INTO FILE-HTM
001980
001990      OPEN OUTPUT ARKHTM
002000
002010        IF STATUS-HTM NOT = "00"
002020         MOVE SPACES TO FAST
002030         STRING "FILE HTM NON GENERATO "  STATUS-HTM " " FILE-HTM
002040         DELIMITED BY SIZE INTO  COBW3-PUT-STRING
002050         PERFORM LINE-WEB THRU EX-LINE-WEB
002060         GO TO FINE
002070        END-IF
002080
002090
002100      go to ciclo.
002110
002120
002130*** softwire switches= debug(value="SI")
002140
002150      MOVE ZERO TO IND.
002160      INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND
002170       FOR ALL 'DEBUG(ENABLED="SI")'
002180      IF IND = 1
002190      SET DEBUG-ON TO TRUE
002200      go to ciclo.
002210
002220      MOVE ZERO TO IND.
002230      INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND
002240       FOR ALL 'DEBUG(ENABLED="NO")'
002250      IF IND = 1
002260      SET DEBUG-OFF TO TRUE
002270      go to ciclo.
002280
002290
002300
002310
002320
002330****  FILENAME nella forma AZIONE(PARAMETRI) DOVE:
002340*
002350*     AZIONE      (il nome del template da aprire su template\AZIONE.HTM
002360*     PARAMETRI   (nella forma NOME="valore")
002370
002380      MOVE SPACES  TO FILENAME DATI INITIALIZE TAB-TABLE.
002390
002400      UNSTRING DATI-WEB DELIMITED BY "("
002410       INTO FILENAME DATI.
002420
002430      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF FILENAME
002440       OR FILENAME(IND:1) > SPACES
002450       CONTINUE
002460      END-PERFORM
002470
002480      IF IND NOT > LENGTH OF FILENAME
002490       MOVE FILENAME(IND:)    TO BUFFER
002500       MOVE BUFFER            TO FILENAME.
002510
002520
002530**** SOFTWIRED= "HTML"
002540
002550      IF FUNCTION UPPER-CASE(FILENAME) = "HTML"
002560       MOVE DATI          TO COBW3-PUT-STRING
002570       PERFORM VARYING IND FROM LENGTH OF COBW3-PUT-STRING BY -1
002580       UNTIL IND = ZERO OR COBW3-PUT-STRING(IND:1) = ")"
002590        CONTINUE
002600       END-PERFORM
002610       MOVE SPACES        TO COBW3-PUT-STRING(IND:1)
002620        PERFORM LINE-WEB THRU EX-LINE-WEB
002630          GO TO CICLO.
002640
002650
002660       MOVE ZERO TO IND IND1
002670       INSPECT DATI TALLYING IND FOR ALL "="
002680
002690       IF IND NOT = ZEROS
002700       MOVE ZERO TO IND
002710       INSPECT DATI-WEB TALLYING IND FOR ALL QUOTE
002720        DIVIDE IND BY  2 GIVING IND REMAINDER IND1
002730
002740        IF IND1 = ZEROS
002750        PERFORM DO-TABLE  THRU EX-DO-TABLE
002760
002770
002780*
002790**** in presenza di use="unfile..." prende solo il valore del file  e lo accoda ignorando il token() che ha solo valore di commento
002800*
002810
002820              if FUNCTION UPPER-CASE(NAME-TABLE (1)) = "USE"
002830                  go to ciclo
002840              end-if
002850
002860
002870         ELSE
002880         STRING "INDICARE UN NUMERO CORRETTO DI PARAMETRI CON GLI APICI"  DATI-WEB
002890         DELIMITED BY SIZE INTO  COBW3-PUT-STRING
002900         PERFORM LINE-WEB THRU EX-LINE-WEB
002910        END-IF
002920       END-IF.
002930
002940
002950
002960
002970
002980      IF TIMES-TABLE = ZERO MOVE 1 TO TIMES-TABLE.
002990
003000      PERFORM ELABORA-LIBRERIA    THRU EX-ELABORA-LIBRERIA
003010          TIMES-TABLE  TIMES.
003020
003030      GO TO CICLO.
003040
003050 FINE.
003060
003070      CLOSE ARKWEB.
003080
003090
003100      IF FAST = "S"
003110       CLOSE ARKHTM
003120        MOVE FILE-HTM TO COBW3-HTML-FILENAME
003130         CALL "COBW3_PUT_HTML" USING COBW3.
003140
003150
003160      EXIT PROGRAM.
003170
003180      COPY "PIOABI.CBL".
003190      COPY "PIOMENU.CBL".
003200      COPY "PIOVIEW.CBL".
003210
003220  FAI-NOME.
003230
003240          IF PATH-WEB = SPACE
003250          MOVE "FILES/FILES.TXT"  TO WDOVE
003260           ELSE
003270          MOVE SPACES             TO WDOVE
003280
003290          STRING PATH-WEB DELIMITED BY "  "
003300            "FILES.TXT" DELIMITED BY SIZE INTO WDOVE.
003310
003320          CALL "NOMIFILE" USING WDOVE WNOME
003330            RETURNING WFILE.
003340
003350  EX-FAI-NOME.
003360          EXIT.
003370
003380
003390
003400 ELABORA-LIBRERIA.
003410
003420**** eventuali librerie personalizzate
003430
003440      MOVE SPACES     TO FILE-LIB
003450      STRING "lib\" DELIMITED BY SIZE
003460           FUNCTION LOWER-CASE(FILENAME) DELIMITED BY "   "
003470              ".htm" delimited by size into FILE-LIB.
003480
003490      OPEN INPUT ARKLIB.
003500
003510
003520      IF STATUS-LIB = "35"
003530       MOVE ZERO TO IND
003540       INSPECT FUNCTION UPPER-CASE(FILE-LIB) TALLYING IND FOR  ALL "OPENFORM"
003550       IF IND = 1
003560       STRING "QUESTO template: " FILE-LIB  DELIMITED BY "   "
003570          " DEVE ESSERE SU ./LIB INVECE NON E' PRESENTE"
003580       delimited by SIZE INTO  COBW3-PUT-STRING
003590       PERFORM LINE-WEB THRU EX-LINE-WEB
003600       GO TO FINE.
003610
003620
003630
003640
003650      IF STATUS-LIB = "35"
003660      MOVE SPACES     TO FILE-LIB
003670      STRING "..\OPENPA\lib\" DELIMITED BY SIZE
003680           FUNCTION LOWER-CASE(FILENAME) DELIMITED BY "   "
003690              ".htm" delimited by size into FILE-LIB
003700      ELSE
003710      CLOSE ARKLIB.
003720
003730
003740
003750      MOVE SPACES     TO COBW3-PUT-STRING
003760
003770      IF DEBUG-ON
003780      STRING  "<!- "  delimited by size
003790           file-lib   delimited by "   "
003800              "->"    delimited by SIZE INTO  COBW3-PUT-STRING
003810      PERFORM LINE-WEB THRU EX-LINE-WEB.
003820
003830      OPEN INPUT ARKLIB.
003840
003850      IF STATUS-LIB = "35"
003860      STRING "template: " FILE-LIB " NON PRESENTE"
003870       delimited by SIZE INTO  COBW3-PUT-STRING
003880      PERFORM LINE-WEB THRU EX-LINE-WEB
003890      ELSE
003900      PERFORM TRATTA-LIB THRU EX-TRATTA-LIB
003910      CLOSE ARKLIB.
003920
003930 EX-ELABORA-LIBRERIA.
003940      EXIT.
003950
003960 LINE-WEB.
003970*
003980      IF COBW3-PUT-STRING = SPACES GO TO EX-LINE-WEB.
003990
004000      IF FAST = "S"
004010
004020		MOVE ZERO TO WMAXSIZE
004030		INSPECT function reverse(COBW3-PUT-STRING)
004040		  	 TALLYING WMAXSIZE FOR LEADING SPACES
004050			COMPUTE WMAXSIZE = LENGTH OF COBW3-PUT-STRING - WMAXSIZE
004060
004070       MOVE COBW3-PUT-STRING     TO REC-HTM
004080       WRITE REC-HTM
004090         ELSE
004100
004110      MOVE ZEROS              TO     COBW3-PUT-STRING-LENGTH
004120      CALL  "COBW3_PUT_TEXT"  USING  COBW3.
004130
004140
004150      MOVE SPACES             TO COBW3-PUT-STRING.
004160
004170
004180 EX-LINE-WEB.
004190      EXIT.
004200
004210 TRATTA-LIB.
004220
004230      READ ARKLIB NEXT RECORD AT END GO TO EX-TRATTA-LIB.
004240
004250      IF DATI-LIB = SPACES GO TO TRATTA-LIB.
004260
004270*** DOPPIO {{  VUOL DIRE CHE NON DEVE ESSERE PROCESSATO COME VARIABILE MA SOLO COME ISTRUZIONE EASYUI E DIVENTA QUINDI {
004280
004290      MOVE ZERO TO IND.
004300      INSPECT DATI-LIB TALLYING IND FOR ALL "{{"
004310      IF IND NOT = ZEROS
004320      INSPECT DATI-LIB REPLACING ALL "{{" BY " {"
004330      INSPECT DATI-LIB REPLACING ALL "}}" BY "} "
004340      GO TO RICICLO-LIB.
004350
004360
004370
004380      MOVE ZERO TO IND.
004390      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "<TABLE"
004400      IF IND = 1
004410      SET TABLE-ON TO TRUE.
004420
004430      MOVE ZERO TO IND.
004440      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "</TABLE"
004450      IF IND = 1
004460      SET TABLE-OFF TO TRUE.
004470
004480
004490      MOVE ZERO TO IND.
004500      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "</TD"
004510      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004520
004530      MOVE ZERO TO IND.
004540      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "<TD"
004550      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004560
004570
004580      MOVE ZERO TO IND.
004590      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "</TR"
004600      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004610
004620      MOVE ZERO TO IND.
004630      INSPECT FUNCTION UPPER-CASE(DATI-LIB) TALLYING IND FOR ALL "<TR"
004640      IF IND = 1 AND TABLE-OFF GO TO TRATTA-LIB.
004650
004660
004670
004680
004690***** asterisco commenta la riga
004700
004710      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF DATI-LIB
004720          OR DATI-LIB(IND:1) > SPACES
004730       CONTINUE
004740      END-PERFORM.
004750
004760      IF DATI-LIB(IND:1) = "*"
004770
004780       IF DEBUG-OFF
004790        GO TO TRATTA-LIB
004800        ELSE
004810        STRING "<!- "     delimited by size
004820        dati-lib delimited by "   "
004830          "->"    delimited by SIZE INTO  COBW3-PUT-STRING
004840        PERFORM LINE-WEB THRU EX-LINE-WEB
004850        go to TRATTA-LIB
004860       END-IF
004870      END-IF.
004880
004890*
004900***  EVENTUALI {STRINGA} PRESENTI IN NAME-TABLE(1.....N) DA USARE PER COSTANTI TITOLO="PROVA"
004910*      VANNO SOSTITUITI CON VALUE-TABLE(1....N)
004920
004930      PERFORM ESTRAI-STRINGA  THRU EX-ESTRAI-STRINGA.
004940
004950*
004960***  EVENTUALI <COBOL>VARIABILE</COBOL> PRESENTI          DA USARE PER VARIABILI ALLOCATE SU ARKVIEW.
004970*      VANNO SOSTITUITI CON RELATIVO VALORE..
004980
004990
005000      MOVE DATI-LIB           TO WDATI-LIB.
005010
005020      PERFORM ESTRAI-COBOL    THRU EX-ESTRAI-COBOL.
005030
005040      MOVE WDATI-LIB          TO DATI-LIB.
005050
005060
005070      IF DATI-LIB = SPACES GO TO TRATTA-LIB.
005080
005090*
005100***  EVENTUALI @XXXXXYY SOFTWIRED INTERNAL PROCEDURE
005110*
005120
005130      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF DATI-LIB
005140       OR DATI-LIB(IND:1) > SPACES
005150       CONTINUE
005160      END-PERFORM.
005170
005180
005190      IF FUNCTION UPPER-CASE(DATI-LIB(IND:5)) = "@MESI"
005200       PERFORM DO-MESI        THRU EX-DO-MESI
005210       GO TO TRATTA-LIB.
005220
005230
005240      IF FUNCTION UPPER-CASE(DATI-LIB(IND:5)) = "@LOAD"
005250       PERFORM OPEN-I-MENU    THRU EX-OPEN-I-MENU
005260       PERFORM OPEN-I-ABI     THRU EX-OPEN-I-ABI
005270       PERFORM LETTURA-MOD    THRU EX-LETTURA-MOD
005280       CLOSE ARKMENU ARKABI
005290        GO TO TRATTA-LIB.
005300
005310
005320      IF FUNCTION UPPER-CASE(DATI-LIB(IND:7)) = "@APPEND"
005330		ADD 7 					TO IND
005331
005332		IF DATI-LIB(IND:) > SPACES
005340		PERFORM VARYING IND FROM IND BY 1 UNTIL 
005350         DATI-LIB(IND:1) > SPACES
005351         CONTINUE
005360		END-PERFORM
005370		MOVE DATI-LIB(IND:)		TO WDATI-LIB
005380      PERFORM ESTRAI-COBOL    THRU EX-ESTRAI-COBOL
005390      MOVE WDATI-LIB          TO FILE-LIB1
005400      PERFORM APPEND-FILE     THRU EX-APPEND-FILE
005410        GO TO TRATTA-LIB
005411		   ELSE
005412        GO TO TRATTA-LIB
005413		 END-IF
005414		END-IF.
005415
005420
005430
005440
005450
005460 RICICLO-LIB.
005470
005480      IF DATI-LIB > SPACES
005490      MOVE DATI-LIB           TO COBW3-PUT-STRING
005500      PERFORM LINE-WEB THRU EX-LINE-WEB.
005510
005520      GO TO TRATTA-LIB.
005530
005540 EX-TRATTA-LIB.
005550      EXIT.
005560
005570 ESTRAI-COBOL.
005580
005590      move zeros              TO ind.
005600
005610      INSPECT FUNCTION UPPER-CASE(WDATI-LIB) TALLYING IND FOR ALL "<COBOL>"
005620
005630      IF IND = ZEROS  GO TO EX-ESTRAI-COBOL.
005640
005650
005660 CICLO-ESTRAI-COBOL.
005670
005680      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF WDATI-LIB
005690       OR FUNCTION UPPER-CASE(WDATI-LIB(IND:7)) = "<COBOL>"
005700       CONTINUE
005710      END-PERFORM.
005720
005730      MOVE IND   TO IND-WEB
005740
005750      SUBTRACT 1 FROM IND-WEB.
005760
005770*** se adesso ind-WEB VALE ZERO vuol dire che la stringa iniziava con <COBOL> CIOE' E' lanciata da file(file="<COBOL>NOME</COBOL>"
005780
005790      ADD 7 TO IND
005800
005810      MOVE ZERO TO SIZE-WEB
005820
005830      PERFORM VARYING IND1 FROM IND BY 1 UNTIL IND1 > LENGTH OF WDATI-LIB
005840       OR FUNCTION UPPER-CASE(WDATI-LIB(IND1:8)) = "</COBOL>"
005850       ADD 1 TO SIZE-WEB
005860      END-PERFORM
005870
005880
005890**** nome-VIEW= "LABEL" inserisce la DESC-VIEW della precedente lettura
005900
005910      IF WDATI-LIB(IND:SIZE-WEB) = "LABEL"
005920          MOVE DESC-VIEW          TO BUFFER
005930
005940          IF DESC-VIEW = SPACES
005950          MOVE "descrizione default" to BUFFER
005960          END-IF
005970
005980          MOVE SPACES             TO WDATI-LIB(IND1:8)
005990          ADD 8                   TO IND1
006000          GO TO END-ESTRAI-COBOL.
006010
006020
006030**** nome-VIEW= "CHECK" inserisce la parola checked o spazio per usare lo switchbutton
006040
006050      IF WDATI-LIB(IND:SIZE-WEB) = "CHECK"
006060
006070          INSPECT WDATI-LIB REPLACING ALL '"<COBOL>CHECK</COBOL>"'
006080                                      BY '                      '
006090          INSPECT WDATI-LIB REPLACING ALL '"<cobol>CHECK</cobol>"'
006100                                      BY '                      '
006110
006120              MOVE EDIT-VIEW          TO BUFFER
006130
006140          IF CHECKED = "S"
006150          MOVE "CHECKED"          to BUFFER
006160          ELSE
006170          MOVE SPACES             to BUFFER
006180          END-IF
006190
006200          MOVE SPACES             TO WDATI-LIB(IND1:8)
006210          ADD 8                   TO IND1
006220          GO TO END-ESTRAI-COBOL.
006230
006240
006250
006260**** nome-VIEW= "CHECKED" inserisce la parola checked o spazio per usare lo CHECKBOX
006270
006280      IF WDATI-LIB(IND:SIZE-WEB) = "CHECKED"
006290
006300          INSPECT WDATI-LIB REPLACING ALL '"<COBOL>CHECKED</COBOL>"'
006310                                      BY  '                        '
006320          INSPECT WDATI-LIB REPLACING ALL '"<cobol>CHECKED</cobol>"'
006330                                      BY  '                        '
006340                                                              
006350              MOVE EDIT-VIEW          TO BUFFER
006360
006370          IF CHECKED = "S"
006380          MOVE 'checked="true"'   TO BUFFER
006390          ELSE
006400          MOVE SPACES             to BUFFER
006410          END-IF
006420
006430          MOVE SPACES             TO WDATI-LIB(IND1:8)
006440          ADD 8                   TO IND1
006450          GO TO END-ESTRAI-COBOL.
006460
006470
006480
006490
006500
006510
006520
006530      INITIALIZE VIEW.
006540
006550      MOVE FUNCTION UPPER-CASE(WDATI-LIB(IND:SIZE-WEB))  TO NOME-VIEW
006560
006570
006580**** ELIMINA </COBOL> dal buffer WDATI-LIB
006590
006600      MOVE SPACES TO WDATI-LIB(IND1:8)
006610
006620      ADD 8           TO IND1.
006630
006640
006650      PERFORM LEGGO-NOLOCK-VIEW   THRU EX-LEGGO-NOLOCK-VIEW.
006660
006670      IF ESITO-NOK MOVE SPACES TO EDIT-VIEW.
006680
006690      MOVE EDIT-VIEW              TO BUFFER.
006700
006710
006720      IF NOME-VIEW(1:7) = "COGNOME"
006730       OR NOME-VIEW(1:4) = "NOME"
006740
006750      INSPECT BUFFER REPLACING FIRST "'" BY " ".
006760
006770
006780      MOVE EDIT-VIEW              TO CHECKED.
006790
006800
006810
006820
006830 END-ESTRAI-COBOL.
006840
006850      PERFORM DIVISORE            THRU EX-DIVISORE.
006860
006870      MOVE BUFFER                 TO ARGUMENT.
006880
006890      IF IND-WEB > ZEROS
006900        MOVE WDATI-LIB(1:IND-WEB) TO BUFFER
006910       ELSE
006920        MOVE SPACES               TO BUFFER.
006930
006940      PERFORM DIVISORE            THRU EX-DIVISORE.
006950
006960      MOVE WDATI-LIB(IND1:)       TO BUFFER1.
006970
006980      MOVE SPACES TO WDATI-LIB
006990       STRING BUFFER DELIMITED BY "/DIVISORE/"
007000           ARGUMENT DELIMITED BY "/DIVISORE/"
007010            BUFFER1 DELIMITED BY SIZE INTO WDATI-LIB.
007020
007030**** GESTISCE PIU CAMPI NELLA STESSA RIGA...
007040
007050      GO TO ESTRAI-COBOL.
007060
007070 EX-ESTRAI-COBOL.
007080      EXIT.
007090
007100***** attenzione usare sempre coppie !!! se c'e uno script javascript va in loop...
007110
007120 ESTRAI-STRINGA.
007130
007140      move zeros              TO ind.
007150
007160      INSPECT DATI-LIB TALLYING IND FOR ALL "{"
007170      INSPECT DATI-LIB TALLYING IND FOR ALL "}"
007180
007190      IF IND < 2      GO TO EX-ESTRAI-STRINGA.
007200
007210 CICLO-ESTRAI-STRINGA.
007220
007230      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF DATI-LIB
007240       OR DATI-LIB(IND:1) = "{"
007250       CONTINUE
007260      END-PERFORM.
007270
007280
007290      MOVE IND            TO IND1
007300      MOVE IND1           TO IND2
007310      ADD  1              TO IND2
007320      SUBTRACT 1 FROM IND1
007330
007340      MOVE SPACES         TO FIELD-WEB
007350      MOVE ZEROS          TO IND3
007360
007370      PERFORM VARYING IND FROM IND2 BY 1 UNTIL IND2 > LENGTH OF DATI-LIB
007380       OR DATI-LIB(IND:1) = "}"
007390
007400           ADD 1                TO IND3
007410           MOVE DATI-LIB(IND:1) TO FIELD-WEB(IND3:1)
007420
007430      END-PERFORM.
007440
007450**** se { e' posizionato a colonna 1 allora IND1 -1 = ZERO
007460		IF IND1 = ZEROS
007470		 MOVE SPACES				TO BUFFER
007480		ELSE
007490      MOVE DATI-LIB(1:IND1)       TO BUFFER
007500		 END-IF
007510
007520      PERFORM DIVISORE            THRU EX-DIVISORE
007530
007540
007550
007560      ADD 1                       TO IND
007570      MOVE DATI-LIB(IND:)         TO BUFFER1
007580
007590      PERFORM VARYING IND FROM 1 BY 1 UNTIL IND >  20
007600       OR FUNCTION UPPER-CASE(FIELD-WEB) = FUNCTION UPPER-CASE(NAME-TABLE(IND))
007610      CONTINUE
007620
007630      END-PERFORM.
007640
007650
007660
007670*** NON C'E
007680
007690      IF IND > 20
007700       MOVE SPACES TO DATI-LIB
007710       STRING BUFFER DELIMITED BY "/DIVISORE/"
007720           " " BUFFER1 DELIMITED BY SIZE INTO DATI-LIB
007730
007740***** ELIMINA LA STRINGA non assegnata che rimane titolo=" "
007750          PERFORM VARYING IND-WEB FROM 1 BY 1 UNTIL IND-WEB > LENGTH OF DATI-LIB
007760
007770
007780           IF IND-WEB < LENGTH OF DATI-LIB - 4
007790           AND DATI-LIB(IND-WEB:4) = '=" "'
007800           MOVE SPACES TO DATI-LIB(IND-WEB:4)
007810           SUBTRACT 1 FROM IND-WEB
007820           PERFORM VARYING IND-WEB FROM IND-WEB BY -1 UNTIL IND-WEB = ZERO
007830           OR DATI-LIB(IND-WEB:1) = SPACES
007840           MOVE SPACES TO DATI-LIB(IND-WEB:1)
007850           END-PERFORM
007860           END-IF
007870
007880          END-PERFORM
007890
007900      ELSE
007910
007920       MOVE SPACES TO DATI-LIB
007930
007940* item-- combo formato VALORE, STRINGA COMBO ESEMPIO M, MASCHIO la variabile per il confronto con M e' in memoria n.b deve essere
007950
007960          IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "ITEM"
007970          PERFORM DO-ITEM     THRU EX-DO-ITEM
007980          GO TO EX-ESTRAI-STRINGA
007990          END-IF
008000
008010* DEFAULT valore di default da assegnare ad un CHECK perche se non spuntato il programma web NON riporta nessun valore e lascerebbe il precedente
008020
008030
008040          IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "DEFAULT"
008050          PERFORM DO-DEFAULT  THRU EX-DO-DEFAULT
008060          GO TO EX-ESTRAI-STRINGA
008070          END-IF
008080
008090
008100
008110      IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "NAME"
008120          MOVE VALUE-TABLE(IND)       TO NAME
008130          INSPECT NAME REPLACING ALL "/DIVISORE/"
008140                                  BY "          "
008150          END-IF
008160
008170
008180
008190
008200       STRING BUFFER DELIMITED BY "/DIVISORE/"
008210           VALUE-TABLE(IND) DELIMITED BY "/DIVISORE/"
008220            BUFFER1 DELIMITED BY SIZE INTO DATI-LIB.
008230
008240
008250      GO TO ESTRAI-STRINGA.
008260
008270 EX-ESTRAI-STRINGA.
008280      EXIT.
008290
008300 DO-DEFAULT.
008310
008320
008330      MOVE NAME               TO NOME-VIEW.
008340
008350      READ ARKVIEW NO LOCK KEY IS CHIAVE-VIEW
008360       INVALID KEY  GO TO EX-DO-DEFAULT.
008370
008380
008390      MOVE VALUE-TABLE(IND)   TO DEFAULT-VIEW.
008400
008410      INSPECT DEFAULT-VIEW REPLACING ALL "/DIVISORE/"
008420                                      BY "          "
008430
008440
008450      MOVE "S"                TO USA-DEFAULT-VIEW.
008460
008470      PERFORM AGGIORNO-VIEW   THRU EX-AGGIORNO-VIEW
008480
008490      IF ESITO-NOK
008500          STRING "Errore rewrite " CHIAVE-VIEW
008510           DElimited by SIZE INTO  COBW3-PUT-STRING
008520            PERFORM LINE-WEB THRU EX-LINE-WEB.
008530
008540
008550 EX-DO-DEFAULT.
008560      EXIT.
008570
008580 DO-MESI.
008590
008600      PERFORM VARYING MM-NORMALE FROM 1 BY 1 UNTIL MM-NORMALE > 12
008610
008620          MOVE SPACES     TO COBW3-PUT-STRING
008630
008640          IF MM-NORMALE = EDIT-VIEW(1:2)
008650           MOVE " selected:true, " TO ARGUMENT
008660          ELSE
008670           MOVE SPACES             TO ARGUMENT
008680          END-IF
008690
008700          STRING "{ value:'" DELIMITED BY SIZE
008710              MM-NORMALE DELIMITED BY SIZE
008720              "'," DELIMITED BY SIZE
008730              ARGUMENT DELIMITED BY "   "
008740              " text:'" DELIMITED BY SIZE
008750              MESE-IN-CORSO(MM-NORMALE) DELIMITED BY "   "
008760              "',iconCls:'icon-" DELIMITED BY SIZE
008770              FUNCTION LOWER-CASE(MESE-IN-CORSO(MM-NORMALE)) (1:3)
008780                  "'},"
008790                   DELIMITED BY SIZE INTO COBW3-PUT-STRING
008800
008810          IF MM-NORMALE = 12
008820           INSPECT COBW3-PUT-STRING REPLACING ALL "}," BY "} "
008830          END-IF
008840
008850
008860
008870          PERFORM LINE-WEB                THRU EX-LINE-WEB
008880
008890      END-PERFORM.
008900
008910
008920 EX-DO-MESI.
008930      EXIT.
008940
008950
008960**** VALUE-TABLE(IND) = "M, MASCHIO" > value:'M' , text:'MASCHIO'....
008970
008980 DO-ITEM.
008990
009000         MOVE SPACES TO ARGUMENT BUFFER BUFFER1 DATI-LIB
009010         UNSTRING VALUE-TABLE(IND) DELIMITED   ","
009020           INTO ARGUMENT  BUFFER
009030           UNSTRING BUFFER DELIMITED BY "/DIVISORE/"
009040           INTO BUFFER1.
009050*** add a required comma ! be carefull
009060
009070          INSPECT BUFFER1 REPLACING ALL "' iconCls:"
009080                               BY       "',iconCls:"
009090
009100** clear the item (so I'll process next in the table list
009110
009120           INITIALIZE ITEM-TABLE (IND).
009130
009140****
009150           IF ARGUMENT = EDIT-VIEW
009160           MOVE SPACES TO DATI-LIB
009170           STRING "          { value:'" DELIMITED BY SIZE
009180                              ARGUMENT  DELIMITED BY "    "
009190                             "',selected:true, text:'"
009200                                        DELIMITED BY SIZE
009210                              BUFFER1   DELIMITED BY "    "
009220                              "'},"     DELIMITED BY SIZE
009230           INTO DATI-LIB
009240          ELSE
009250           STRING "          { value:'" DELIMITED BY SIZE
009260                              ARGUMENT  DELIMITED BY "    "
009270                             "',text:'" DELIMITED BY SIZE
009280                              BUFFER1   DELIMITED BY "    "
009290                              "'},"     DELIMITED BY SIZE
009300           INTO DATI-LIB.
009310
009320          IF IND < INDEX-TABLE
009330           AND FUNCTION UPPER-CASE(NAME-TABLE(IND + 1)) NOT = "ITEM"
009340           INSPECT DATI-LIB REPLACING ALL "}," BY "} ".
009350
009360 EX-DO-ITEM.
009370      EXIT.
009380
009390 DIVISORE.
009400
009410			IF BUFFER = SPACES
009420		       MOVE "/DIVISORE/" TO BUFFER
009430			ELSE
009440			MOVE SPACES			TO BUFFER1
009450			STRING BUFFER DELIMITED BY SPAZI 
009460			 "/DIVISORE/"	DELIMITED BY SIZE 
009470			 INTO BUFFER1
009480
009490			MOVE BUFFER1		TO BUFFER.
009500
009510
009520*         PERFORM VARYING IND4-WEB FROM LENGTH OF BUFFER  BY -1
009530*				  UNTIL IND4-WEB = ZEROS
009540*				OR BUFFER(IND4-WEB:1) > SPACES
009550*                CONTINUE
009560*                END-PERFORM.
009570
009580*      ADD 1 TO IND4-WEB.
009590
009600*     MOVE "/DIVISORE/" TO BUFFER(IND4-WEB:).
009610
009620 EX-DIVISORE.
009630      EXIT.
009640
009650
009660
009670 DO-TABLE.
009680
009690      MOVE 0                  TO INDEX-TABLE.
009700      MOVE 1                  TO IND.
009710
009720 CICLO-TABLE.
009730
009740       ADD  1                 TO INDEX-TABLE.
009750
009760
009770*** SI POSIZIONA SUL PRIMO CARATTERE  SIGNIFICATIVO
009780
009790      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
009800       OR DATI(IND:1) > SPACES
009810       CONTINUE
009820      END-PERFORM.
009830
009840      IF IND > LENGTH OF DATI
009850      GO TO END-DO-TABLE.
009860
009870
009880      IF DATI(IND:) = ")"
009890       GO TO END-DO-TABLE.
009900
009910
009920      MOVE 1                  TO IND-TABLE
009930
009940      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
009950       OR DATI(IND:1) = "="
009960       OR DATI(IND:) = SPACES
009970
009980          IF IND-TABLE NOT  > LENGTH OF NAME-TABLE( INDEX-TABLE)
009990          MOVE DATI(IND:1)    TO NAME-TABLE( INDEX-TABLE) (IND-TABLE:1)
010000          ADD 1               TO IND-TABLE
010010          END-IF
010020
010030       CONTINUE
010040      END-PERFORM.
010050
010060      IF IND > LENGTH OF DATI
010070      GO TO END-DO-TABLE.
010080
010090
010100      IF DATI(IND:1) = "="
010110      ADD 1       TO IND
010120      MOVE 1      TO IND-TABLE
010130
010140****  SI POSIZIONA SUL PRIMO '"' DOPO '=" esempio title="TESTO"
010150*                                                       ! < qui
010160
010170      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
010180       OR DATI(IND:1) = '"'
010190       CONTINUE
010200      END-PERFORM
010210
010220      ADD 1               TO IND
010230
010240      PERFORM VARYING IND FROM IND BY 1 UNTIL IND > LENGTH OF DATI
010250       OR DATI(IND:1) = '"'
010260       OR DATI(IND:) = SPACES
010270
010280          IF IND-TABLE NOT  > LENGTH OF VALUE-TABLE( INDEX-TABLE)
010290          MOVE DATI(IND:1)    TO VALUE-TABLE( INDEX-TABLE) (IND-TABLE:1)
010300          ADD 1               TO IND-TABLE
010310          END-IF
010320
010330       CONTINUE
010340      END-PERFORM
010350
010360****SOFWIRED update: FILE -> appende il file indicato ignorando il token di provenienza qualcosa()
010370
010380
010390      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "USE"
010400      MOVE VALUE-TABLE(INDEX-TABLE)       TO WDATI-LIB
010410      PERFORM ESTRAI-COBOL                THRU EX-ESTRAI-COBOL
010420      move WDATI-LIB                      TO FILE-LIB1
010430      PERFORM APPEND-FILE                 THRU EX-APPEND-FILE
010440      GO TO EX-DO-TABLE
010450      END-IF
010460
010470****SOFWIRED update: size--> width:
010480
010490
010500
010510      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "SIZE"
010520      MOVE VALUE-TABLE(INDEX-TABLE)       TO ARGUMENT
010530       MOVE SPACES TO VALUE-TABLE(INDEX-TABLE)
010540      STRING "width:" DELIMITED BY SIZE ARGUMENT DELIMITED BY "    "
010550          ";"  DELIMITED BY SIZE INTO VALUE-TABLE(INDEX-TABLE)
010560      END-IF
010570
010580
010590      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "CHAR"
010600      MOVE VALUE-TABLE(INDEX-TABLE)       TO ARGUMENT
010610       MOVE SPACES TO VALUE-TABLE(INDEX-TABLE)
010620      STRING "validType:'length[0," DELIMITED BY SIZE ARGUMENT DELIMITED BY "    "
010630          "]',"    DELIMITED BY SIZE INTO VALUE-TABLE(INDEX-TABLE)
010640      END-IF
010650
010660
010670      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "TYPE"
010680      MOVE VALUE-TABLE(INDEX-TABLE)       TO ARGUMENT
010690       IF FUNCTION UPPER-CASE(ARGUMENT) = "MAIL"
010700       MOVE "validType:'email' ," TO VALUE-TABLE(INDEX-TABLE)
010710      END-IF
010720      END-IF.
010730
010740
010750
010760
010770      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "TIMES"
010780           MOVE VALUE-TABLE(INDEX-TABLE)      TO TIMES-TABLE(1:)
010790           IF TIMES-TABLE(2:1) = SPACES
010800           MOVE TIMES-TABLE(1:1)  TO TIMES-TABLE(2:1)
010810           MOVE 0                 TO TIMES-TABLE(1:1).
010820
010830***** CE' UN ELEMENTO DI MENU: DEVE CONTROLLARE SE ABILITATO O MENO
010840      if FUNCTION UPPER-CASE(NAME-TABLE (INDEX-TABLE)) = "DISABLED"
010850       PERFORM OPEN-I-ABI             THRU EX-OPEN-I-ABI
010860
010870       INITIALIZE ABILITAZIONE
010880
010890       MOVE VALUE-TABLE(INDEX-TABLE)  TO MOD-ABI
010900       MOVE 01                        TO ENTE-ABI
010910       IF GRUPPO-UTEN = ZEROS MOVE 1  TO GRUPPO-UTEN END-IF
010920       MOVE GRUPPO-UTEN               TO GRUPPO-ABI
010930
010940       PERFORM LEGGO-ABI              THRU EX-LEGGO-ABI
010950
010960       IF ESITO-NOK MOVE "true "      TO VALUE-TABLE(INDEX-TABLE)
010970
010980          IF NOME-UTEN = "ADMIN"
010990              OR GRUPPO-UTEN = 99
011000              MOVE "false"            TO VALUE-TABLE(INDEX-TABLE)
011010          end-if
011020
011030      ELSE
011040       MOVE "false"                   TO VALUE-TABLE(INDEX-TABLE)
011050       end-if
011060
011070       CLOSE ARKABI.
011080
011090
011100
011110      PERFORM VARYING IND-WEB FROM LENGTH OF VALUE-TABLE(INDEX-TABLE) BY -1
011120       UNTIL IND-WEB = ZERO
011130         OR VALUE-TABLE(INDEX-TABLE) (IND-WEB:1) > SPACES
011140          OR IND-WEB = ZERO
011150       CONTINUE
011160      END-PERFORM
011170
011180      ADD 1 TO IND-WEB
011190      MOVE "/DIVISORE/" TO VALUE-TABLE(INDEX-TABLE) (IND-WEB:).
011200
011210
011220
011230      IF IND NOT > LENGTH OF DATI
011240       ADD 1                  TO IND
011250       GO TO CICLO-TABLE.
011260
011270 END-DO-TABLE.
011280
011290      SUBTRACT 1 FROM INDEX-TABLE
011300
011310      IF DEBUG-ON
011320
011330      MOVE 1                  TO IND
011340
011350      PERFORM INDEX-TABLE TIMES
011360
011370      STRING  "<!- "  delimited by size
011380           " Ind "  IND  " "
011390              NAME-TABLE(IND) DELIMITED BY "    "
011400                   " contiene: " DELIMITED BY SIZE
011410              VALUE-TABLE(IND) DELIMITED BY "    "
011420              " ->"   delimited by SIZE INTO  COBW3-PUT-STRING
011430      PERFORM LINE-WEB THRU EX-LINE-WEB
011440
011450      ADD 1 TO IND
011460
011470      END-PERFORM.
011480
011490
011500 EX-DO-TABLE.
011510      EXIT.
011520
011530**** DUMMY
011540 VIS-MESS.
011550 EX-VIS-MESS.
011560      EXIT.
011570
011580
011590
011600**** DEVE ESISTERE UNA VARIABILE {menu} IN TABELLA
011610
011620 LETTURA-MOD.
011630
011640          INITIALIZE MENU.
011650
011660          PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > INDEX-TABLE
011670
011680          IF FUNCTION UPPER-CASE(NAME-TABLE(IND)) = "MENU"
011690            MOVE VALUE-TABLE(IND)     TO DATI-LIB(6:2)
011700          END-IF
011710
011720          END-PERFORM.
011730
011740          MOVE DATI-LIB(6:2)      TO DEP-MOD.
011750
011760          PERFORM STARTO-MENU     THRU EX-STARTO-MENU.
011770          IF ESITO-NOK
011780          STRING  "MANCA MENU" MOD-MENU DELIMITED BY SIZE INTO MESSAGGIO
011790           PERFORM VIS-MESS    THRU EX-VIS-MESS
011800            GO TO EX-LETTURA-MOD.
011810
011820          SET FIRST-TIME  TO TRUE.
011830
011840 CICLO-LETTURA-MOD.
011850
011860          PERFORM LEGGO-NEXT-MENU THRU EX-LEGGO-NEXT-MENU.
011870
011880          IF FINE-FILE = "S" GO TO END-LETTURA-MOD.
011890
011900          IF MOD-MENU NOT = DEP-MOD GO CICLO-LETTURA-MOD.
011910
011920          IF ENT-MENU = SPACES GO TO CICLO-LETTURA-MOD.
011930
011940
011950          IF FUNCTION UPPER-CASE(DESC-MENU) = "SEPARATORE"
011960           MOVE '        <div class="menu-sep"></div>' TO DATI-WEB
011970           PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB
011980            GO TO CICLO-LETTURA-MOD.
011990
012000          INITIALIZE ABILITAZIONE.
012010
012020          MOVE GRUPPO-UTEN        TO GRUPPO-ABI.
012030          IF GRUPPO-ABI = ZEROS
012040            MOVE 1                TO GRUPPO-ABI.
012050
012060          MOVE 01                 TO ENTE-ABI.
012070          MOVE CHIAVE-SEC-MENU    TO CHIAMATA-ABI.
012080
012090          PERFORM ABILITAZIONI    THRU EX-ABILITAZIONI.
012100
012110          IF DISABLED AND MOSTRA-MENU-UTEN = "N"
012120           GO TO CICLO-LETTURA-MOD.
012130
012140
012150          IF FUNZ-MENU = SPACES
012160              PERFORM MAKE-ENTITA   THRU EX-MAKE-ENTITA
012170           ELSE
012180              PERFORM MAKE-FUNZIONE THRU EX-MAKE-FUNZIONE.
012190
012200          GO TO CICLO-LETTURA-MOD.
012210
012220 END-LETTURA-MOD.
012230
012240          MOVE "          </div></div>"     TO DATI-WEB
012250
012260          PERFORM PREPARA-LINE-WEB                  THRU EX-PREPARA-LINE-WEB.
012270
012280 EX-LETTURA-MOD.
012290          EXIT.
012300
012310 ABILITAZIONI.
012320
012330          MOVE "N"                TO FLAG-DISABLED.
012340
012350          PERFORM LEGGO-ABI       THRU EX-LEGGO-ABI.
012360
012370          IF ESITO-NOK
012380           SET DISABLED           TO TRUE.
012390
012400          IF NOME-UTEN = "ADMIN" OR GRUPPO-UTEN > 99
012410           MOVE "N"                TO FLAG-DISABLED.
012420
012430 EX-ABILITAZIONI.
012440          EXIT.
012450 MAKE-ENTITA.
012460
012470          IF NOT FIRST-TIME
012480          MOVE   "        </div></div>"     TO DATI-WEB
012490
012500          PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB
012510          ELSE
012520          MOVE "N"                        TO FLAG-TIME.
012530
012540
012550
012560          IF DISABLED
012570                  MOVE "disabled:true"            to wdisable
012580          else
012590                  MOVE "disabled:false"           to wdisable.
012600
012610          IF IMG-MENU > ZEROS
012620                  AND IMG-MENU < 20
012630                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
012640
012650              else
012660                  MOVE SPACES                     to wIMAGES.
012670
012680          MOVE SPACES TO DATI-WEB.
012690
012700
012710          STRING "             " DELIMITED BY SIZE
012720          '<div style="color:#0066cc" data-options="'
012730                  wdisable delimited by  "  "
012740                  wimages delimited by "   "
012750                   '"><span>' delimited BY  SIZE
012760          DESC-MENU DELIMITED BY "    " "</span><div>"
012770              DELIMITED BY SIZE INTO DATI-WEB.
012780
012790          PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB.
012800
012810
012820 EX-MAKE-ENTITA.
012830          EXIT.
012840
012850
012860
012870 MAKE-FUNZIONE.
012880
012890
012900          IF DISABLED
012910          string
012920          '            <div data-options="disabled:true">'
012930          DESC-MENU DELIMITED BY "     " "</div>"
012940              DELIMITED BY SIZE INTO DATI-WEB
012950          ELSE
012960          STRING
012970          '            <div style="color:#0066cc">'  DELIMITED BY SIZE
012980          DESC-MENU DELIMITED BY "     " "</div>"
012990              DELIMITED BY SIZE INTO DATI-WEB.
013000
013010          IF DISABLED
013020                  MOVE "disabled:true"            to wdisable
013030                  else
013040                  MOVE "disabled:false"           to wdisable.
013050
013060          IF IMG-MENU > ZEROS
013070                  AND IMG-MENU < 20
013080                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
013090
013100                  else
013110                  MOVE SPACES                     to wIMAGES.
013120
013130          MOVE SPACES TO DATI-WEB.
013140
013150          IF NOT DISABLED
013160
013170          STRING "             " DELIMITED BY SIZE
013180                  '<div data-options="'
013190                  wdisable delimited by  "  "
013200                  wimages delimited by "   "
013210                  '"><a style="text-decoration:none;" href="' DELIMITED BY SIZE
013220                  PROG-MENU DELIMITED BY "   "
013230                  ".exe?MK-KEY=" SECTION-WEB DELIMITED BY SIZE
013240                  "&MK-ENTITA=" ENT-MENU DELIMITED BY SIZE
013250                  "&MK-FUNZIONE=" FUNZ-MENU DELIMITED BY SIZE
013260                  "&MK-PAGE=" DLL-MENU DELIMITED BY "   "
013270*                '" class="easyui-menubotton">' DELIMITED BY SIZE
013280                 '">' DELIMITED BY SIZE
013290                  DESC-MENU DELIMITED BY "    "
013300                  "</a></div>"
013310                  DELIMITED BY SIZE INTO DATI-WEB
013320            ELSE
013330
013340          STRING "             " DELIMITED BY SIZE
013350                  '<div data-options="'
013360                  wdisable delimited by  "  "
013370                  wimages delimited by "   "
013380                  '"><a style="text-decoration:none;" href="javascript:void(0)"' DELIMITED BY SIZE
013390                  '" class="easyui-menubotton">' DELIMITED BY SIZE
013400                  DESC-MENU DELIMITED BY "    "
013410                  "</a></div>"
013420                  DELIMITED BY SIZE INTO DATI-WEB.
013430
013440
013450          PERFORM PREPARA-LINE-WEB        THRU EX-PREPARA-LINE-WEB.
013460
013470 EX-MAKE-FUNZIONE.
013480          EXIT.
013490
013500 PREPARA-LINE-WEB.
013510
013520          MOVE DATI-WEB                   TO COBW3-PUT-STRING.
013530
013540          PERFORM LINE-WEB                THRU EX-LINE-WEB.
013550
013560 EX-PREPARA-LINE-WEB.
013570          EXIT.
013580
013590 APPEND-FILE.
013600
013610			if FILE-LIB1 = SPACES GO TO EX-APPEND-FILE.
013620
013630
013640          OPEN INPUT ARKLIB1.
013650
013660
013670          IF STATUS-LIB1 NOT = "00"
013680          STRING "ERRORE " STATUS-LIB1 "  su file da appendere:" 
013690			 delimited by size
013700			  FILE-LIB1 delimited by "   "
013710              INTO  COBW3-PUT-STRING
013720
013730			 if status-lib1 = "39"
013740			 MOVE SPACES TO         COBW3-PUT-STRING
013750          STRING "Permessi accesso al file non consentiti  -" STATUS-LIB1 "- per appendere:" 
013760			 delimited by size
013770			  FILE-LIB1 delimited by "   "  INTO  COBW3-PUT-STRING
013780
013790			 END-IF
013800
013810           PERFORM LINE-WEB THRU EX-LINE-WEB
013820*
013830*          MOVE 'var data = [{"ELEMENTO":"<strong>SCHEDA</strong>","RIGA":"0001","DESC":"<strong>DATI NON PRESENTI</strong>"}];'
013840*          TO COBW3-PUT-STRING     PERFORM LINE-WEB THRU EX-LINE-WEB
013850           go to EX-APPEND-FILE.
013860
013870 CICLO-APPEND.
013880
013890          READ ARKLIB1 NEXT RECORD AT END GO TO END-APPEND-FILE.
013900
013910
013920			IF DATI-LIB1 = SPACES GO TO CICLO-APPEND.
013930
013940***** asterisco commenta la riga
013950
013960          PERFORM VARYING IND FROM 1 BY 1 UNTIL ind1 > LENGTH OF DATI-LIB1
013970				 OR DATI-LIB1(IND:1) > SPACES
013980           CONTINUE
013990          END-PERFORM
014000
014010
014020          IF DATI-LIB1(IND:1) = "*"
014030
014040           IF DEBUG-OFF
014050            GO TO CICLO-APPEND
014060                ELSE
014070            STRING "<!- "     delimited by size
014080            dati-lib1 delimited by "   "
014090              "->"    delimited by SIZE INTO  COBW3-PUT-STRING
014100            PERFORM LINE-WEB THRU EX-LINE-WEB
014110            go to CICLO-APPEND
014120           END-IF
014130          END-IF.
014140
014150
014160      	MOVE DATI-LIB1          TO WDATI-LIB.
014170
014180      	PERFORM ESTRAI-COBOL    THRU EX-ESTRAI-COBOL.
014190
014200      	MOVE WDATI-LIB          TO DATI-LIB1.
014210
014220
014230
014240          MOVE DATI-LIB1          TO COBW3-PUT-STRING.
014250
014260          IF DATI-LIB1 NOT = SPACES
014270          PERFORM LINE-WEB THRU EX-LINE-WEB.
014280
014290          GO TO CICLO-APPEND.
014300
014310 END-APPEND-FILE.
014320
014330          CLOSE ARKLIB1.
014340
014350 EX-APPEND-FILE.
014360          EXIT.
