000010 GENERA-TAB.
000020
000030			PERFORM OPEN-I-TAB		THRU EX-OPEN-I-TAB.
000040
000050			MOVE SPACES				TO FILE-JSON.
000060
000070  		STRING "FILES/ark" DELIMITED BY SIZE
000080				SIGLA-WEB     DELIMITED  BY "    "
000090				".json" delimited bY SIZE INTO FILE-JSON.
000100
000110			OPEN OUTPUT ARKJSON.
000120
000130			MOVE ZEROS				TO CONTA.
000140
000150          MOVE LOW-VALUE          TO tabella.
000160
000170			move 01					TO ENTE-TAB.
000180			MOVE TIPO-WEB    		TO TIPO-TAB.
000190
000200          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
000210			
000220			IF ESITO-NOK GO TO END-CONTA-RECORD-TABELLA.
000230
000240 CICLO-CONTA-RECORD-TABELLA.
000250
000260			PERFORM LEGGO-NEXT-TAB 	THRU EX-LEGGO-NEXT-TAB.
000270
000280			IF TIPO-TAB NOT = TIPO-WEB move "S" to fine-file.
000290
000300			IF FINE-FILE = "S" GO TO END-CONTA-RECORD-TABELLA.
000310
000320			ADD 1					TO CONTA.
000330
000340			GO TO CICLO-CONTA-RECORD-TABELLA.
000350
000360 END-CONTA-RECORD-TABELLA.
000370
000380
000390			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
000400			 OR CONTA(IND:1) > "0"
000410			 CONTINUE
000420			END-PERFORM.
000430
000440			STRING '{"total":' CONTA(IND:) ',"rows":['		
000450			DELIMITED BY SIZE INTO DATI-JSON.
000460			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
000470
000480			MOVE SPACES				TO DATI-JSON.
000490
000500
000510          MOVE LOW-VALUE          TO tabella.
000520
000530			move 01					TO ENTE-TAB.
000540			MOVE TIPO-WEB			TO TIPO-TAB.
000550
000560          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
000570
000580          if ESITO-NOK GO TO FINE-TABELLA.
000590
000600
000610 CICLO-TABELLA.
000620
000630			PERFORM LEGGO-NEXT-TAB 	THRU EX-LEGGO-NEXT-TAB.
000640
000650			IF TIPO-TAB NOT = TIPO-WEB move "S" to fine-file.
000660
000670			IF FINE-FILE = "S" GO TO FINE-TABELLA.
000680
000690			IF DATI-JSON > SPACES
000700			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
000710
000720***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
000730
000740			INSPECT TABELLA REPLACING ALL "\" BY " ".			
000750
000760				
000770**** ITEM
000780		
000790			STRING 
000800
000810			'   {"CODICE":"'	DELIMITED BY SIZE
000820			PROG-TAB        DELIMITED BY "   "
000830			'",'			DELIMITED BY SIZE
000840			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
000850
000860**** ITEM
000870			STRING "        "
000880			'"DESCRIZ":"'	DELIMITED BY SIZE
000890			DESC-TAB         DELIMITED BY "     "
000900          '"},' DELIMITED BY SIZE 
000910			into dati-JSON.
000920
000930			GO TO CICLO-TABELLA.
000940
000950
000960 FINE-TABELLA.
000970
000980			INSPECT DATI-JSON REPLACING all "}, " BY
000990										    "}  ".
001000
001010			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001020
001030
001040			MOVE "]}"					TO DATI-JSON.
001050			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
001060
001070			CLOSE ARKJSON.
001080
001090			CLOSE ARKTAB.
001100
001110 EX-GENERA-TAB.
001120          EXIT.
