
       01 TABIMAGES.
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-man' ".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-help'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-sum' ".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-undo'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-tip' ".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-ok'  ".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-no'  ".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-pencil'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-more'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-lock'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-print'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-redo'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-search'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-cut'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-clear'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-cancel'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-filter'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-back'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-lock'".
            02 FILLER1          PIC X(30) VALUE ",iconCls:'icon-lock'".
            
       01 CARIMAGES REDEFINES TABIMAGES.
            02 WIMAGE           PIC X(30) OCCURS 20 TIMES.
            