000010*
000020***** OPERAZIONI INIZIALI COMUNI A TUTTI I PROGRAMMI
000030*
000040
000050
000060
000070          MOVE "MK-KEY"           TO FIELD-WEB
000080          PERFORM READ-WEB        THRU EX-READ-WEB
000090          MOVE VALUE-WEB          TO SECTION-WEB(1:)
000100
000110          PERFORM OPEN-IO-VIEW    THRU EX-OPEN-IO-VIEW.
000120
000130          MOVE "PATH-FILE"        TO NOME-VIEW
000140          PERFORM LEGGO-VIEW      THRU EX-LEGGO-VIEW
000150
000160          IF STRINGA-VIEW > SPACE
000170          MOVE STRINGA-VIEW       TO PATH-WEB
000180           ELSE
000190           MOVE "FILES/"          TO PATH-WEB.
000200
000210
000220          MOVE SECTION-WEB        TO STRINGA-VIEW.
000230          MOVE "SECTION-WEB"      TO NOME-VIEW
000240          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000250
000260
000270          PERFORM VALIDITA     THRU EX-VALIDITA.
000280
000290          IF ESITO-NOK
000300            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
000310                GO TO FINE.
000320
000330
000340          MOVE "MK-ENTITA"        TO FIELD-WEB
000350          PERFORM READ-WEB        THRU EX-READ-WEB
000360
000370***** se non c'e il campo ENTITA allora e' nel file di sessione
000380
000390          IF COBW3-SEARCH-FLAG-NON
000400            MOVE "MK-ENTITA"      TO NOME-VIEW
000410            PERFORM LEGGO-VIEW    THRU EX-LEGGO-VIEW
000420            MOVE STRINGA-VIEW     TO ENTITA-WEB
000430          ELSE
000440            MOVE VALUE-WEB        TO ENTITA-WEB
000450            MOVE "MK-ENTITA"      TO NOME-VIEW
000460            MOVE VALUE-WEB        TO STRINGA-VIEW
000470            PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000480
000490          MOVE "MK-FUNZIONE"      TO FIELD-WEB
000500          PERFORM READ-WEB        THRU EX-READ-WEB
000510
000520***** se non c'e il campo FUNZIONE allora e' nel file di sessione
000530
000540          IF COBW3-SEARCH-FLAG-NON
000550           MOVE "MK-FUNZIONE"     TO NOME-VIEW
000560           PERFORM LEGGO-VIEW     THRU EX-LEGGO-VIEW
000570           MOVE STRINGA-VIEW      TO FUNZIONE-WEB
000580          ELSE
000590            MOVE VALUE-WEB        TO FUNZIONE-WEB
000600            MOVE "MK-FUNZIONE"    TO NOME-VIEW
000610            MOVE VALUE-WEB        TO STRINGA-VIEW
000620            PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000630
000640
000650
000660           MOVE "UTENTE"          TO NOME-VIEW.
000670           PERFORM LEGGO-VIEW     THRU EX-LEGGO-VIEW.
000680           MOVE STRINGA-VIEW      TO UTENTE-WEB.
000690
