00010*
000020  OPEN-I-ABI.
000030
000040          PERFORM PREPARA-ABI THRU EX-PREPARA-ABI.
000050
000060          MOVE ZEROS      TO STATUS-ABI.
000070
000080          OPEN INPUT ARKABI.
000090
000100          IF STATUS-ABI = "35"
000110           OPEN OUTPUT ARKABI
000130           CLOSE ARKABI
000140
000150            GO TO OPEN-I-ABI.
000160
000170          IF STATUS-ABI NOT = ZEROS
000180           PERFORM ERRORE-ABI THRU EX-ERRORE-ABI
000190           CLOSE ARKABI.
000200
000210          INITIALIZE ABILITAZIONE.
000220
000230  EX-OPEN-I-ABI.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-ABI.
000290
000300          PERFORM PREPARA-ABI THRU EX-PREPARA-ABI.
000310
000320          MOVE ZEROS      TO STATUS-ABI.
000330
000340          OPEN I-O ARKABI.
000350
000360          IF STATUS-ABI = "35"
000370           OPEN OUTPUT ARKABI
000390           CLOSE ARKABI
000400            GO TO OPEN-IO-ABI.
000410
000420          IF STATUS-ABI NOT = ZEROS
000430           PERFORM ERRORE-ABI THRU EX-ERRORE-ABI
000440           CLOSE ARKABI.
000450
000460           INITIALIZE ABILITAZIONE.
000470
000480  EX-OPEN-IO-ABI.
000490          EXIT.
000500*
000510  ERRORE-ABI.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-ABI DELIMITED BY "   "
000550          " STATO:" STATUS-ABI
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-ABI.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-ABI.
000660          MOVE "SI"       TO ESITO.
000670          START ARKABI KEY IS NOT < CHIAVE-ABI
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-ABI.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-ABI.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKABI NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-ABI.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-ABI.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKABI KEY IS CHIAVE-ABI
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-ABI = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-ABI.
000980
000990  EX-LEGGO-ABI.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-ABI.
001050
001060          MOVE "SI"       TO ESITO.
001070          WRITE ABILITAZIONE
001080           INVALID KEY
001090           MOVE "NO"      TO ESITO.
001100
001110          IF STATUS-ABI(1:1) > "2"
001120           PERFORM ERRORE-ABI THRU EX-ERRORE-ABI.
001130  EX-SCRIVO-ABI.
001140          EXIT.
001150*
001160***
001170*
001180  AGGIORNO-ABI.
001190          MOVE "SI"       TO ESITO.
001200          REWRITE ABILITAZIONE
001210           INVALID KEY
001220           MOVE "NO"      TO ESITO.
001230
001240          IF STATUS-ABI(1:1) > "2"
001250           PERFORM ERRORE-ABI THRU EX-ERRORE-ABI.
001260
001270  EX-AGGIORNO-ABI.
001280          EXIT.
001290*
001300***
001310*
001320  CANCELLO-ABI.
001330          MOVE "SI"       TO ESITO.
001340          DELETE ARKABI
001350           INVALID KEY
001360           MOVE "NO"      TO ESITO.
001370
001380          IF STATUS-ABI(1:1) > "2"
001390           PERFORM ERRORE-ABI THRU EX-ERRORE-ABI.
001400
001410  EX-CANCELLO-ABI.
001420          EXIT.
001430
001440  CLOSE-ABI.
001450          CLOSE ARKABI.
001460  EX-CLOSE-ABI.
001470          EXIT.
001480
001630
001640  PREPARA-ABI.
001650
001660          MOVE "FILES\ARKABI"  TO FILE-ABI.
001670  EX-PREPARA-ABI.
001680          EXIT.

