000010*
000020  OPEN-I-CAUS.
000030
000040          PERFORM PREPARA-CAUS THRU EX-PREPARA-CAUS.
000050
000060          MOVE ZEROS      TO STATUS-CAUS.
000070
000080          OPEN INPUT ARKCAUS.
000090
000100          IF STATUS-CAUS = "35" OR "39"
000110           OPEN OUTPUT ARKCAUS
000120           PERFORM INIZIALIZZA-CAUS  THRU EX-INIZIALIZZA-CAUS
000130           CLOSE ARKCAUS
000140
000150            GO TO OPEN-I-CAUS.
000160
000170          IF STATUS-CAUS NOT = ZEROS
000180           PERFORM ERRORE-CAUS THRU EX-ERRORE-CAUS
000190           CLOSE ARKCAUS.
000200
000210          INITIALIZE CAUSALE.
000220
000230  EX-OPEN-I-CAUS.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-CAUS.
000290
000300          PERFORM PREPARA-CAUS THRU EX-PREPARA-CAUS.
000310
000320          MOVE ZEROS      TO STATUS-CAUS.
000330
000340          OPEN I-O ARKCAUS.
000350
000360          IF STATUS-CAUS = "35" OR "39"
000370           OPEN OUTPUT ARKCAUS
000380           PERFORM INIZIALIZZA-CAUS  THRU EX-INIZIALIZZA-CAUS
000390           CLOSE ARKCAUS
000400            GO TO OPEN-IO-CAUS.
000410
000420          IF STATUS-CAUS NOT = ZEROS
000430           PERFORM ERRORE-CAUS THRU EX-ERRORE-CAUS
000440           CLOSE ARKCAUS.
000450
000460           INITIALIZE CAUSALE.
000470
000480  EX-OPEN-IO-CAUS.
000490          EXIT.
000500*
000510  ERRORE-CAUS.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-CAUS DELIMITED BY "   "
000550          " STATO:" STATUS-CAUS
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-CAUS.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-CAUS.
000660          MOVE "SI"       TO ESITO.
000670          START ARKCAUS KEY IS NOT < CHIAVE-CAUS
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-CAUS.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-CAUS.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKCAUS NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-CAUS.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-CAUS.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKCAUS KEY IS CHIAVE-CAUS
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-CAUS = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-CAUS.
000980
000990  EX-LEGGO-CAUS.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-CAUS.
001050
001060          perform FISSE-CAUS THRU EX-FISSE-CAUS.
001070
001080          MOVE "SI"       TO ESITO.
001090          WRITE CAUSALE
001100           INVALID KEY
001110           MOVE "NO"      TO ESITO.
001120
001130          IF STATUS-CAUS(1:1) > "2"
001140           PERFORM ERRORE-CAUS THRU EX-ERRORE-CAUS.
001150  EX-SCRIVO-CAUS.
001160          EXIT.
001170*
001180***
001190*
001200  AGGIORNO-CAUS.
001210
001220          perform FISSE-CAUS THRU EX-FISSE-CAUS.
001230
001240          MOVE "SI"       TO ESITO.
001250          REWRITE CAUSALE
001260           INVALID KEY
001270           MOVE "NO"      TO ESITO.
001280
001290          IF STATUS-CAUS(1:1) > "2"
001300           PERFORM ERRORE-CAUS THRU EX-ERRORE-CAUS.
001310
001320  EX-AGGIORNO-CAUS.
001330          EXIT.
001340*
001350***
001360*
001370  CANCELLO-CAUS.
001380          MOVE "SI"       TO ESITO.
001390          DELETE ARKCAUS
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-CAUS(1:1) > "2"
001440           PERFORM ERRORE-CAUS THRU EX-ERRORE-CAUS.
001450
001460  EX-CANCELLO-CAUS.
001470          EXIT.
001480
001490  CLOSE-CAUS.
001500          CLOSE ARKCAUS.
001510  EX-CLOSE-CAUS.
001520          EXIT.
001530
001540  INIZIALIZZA-CAUS.
001550
001560           INITIALIZE CAUSALE.
001580
001590           MOVE "ORARIO NORMALE"  TO DESC-CAUS.
001600           MOVE "000"             TO CHIAVE-CAUS.
001610           MOVE 2                 TO TIPO-CAUS.
001620
001630           WRITE CAUSALE.
001640
001650  EX-INIZIALIZZA-CAUS.
001660          EXIT.
001670
001680  PREPARA-CAUS.
001690
001700          MOVE "FILES/ARKCAUS"  TO FILE-CAUS.
001710
001720  EX-PREPARA-CAUS.
001730          EXIT.
001740
001750  FISSE-CAUS.
001760
001770
001780  EX-FISSE-CAUS.
001790
001800          EXIT.
001810
