000010*
000020  OPEN-I-IND.
000030
000040          PERFORM PREPARA-IND THRU EX-PREPARA-IND.
000050
000060          MOVE ZEROS      TO STATUS-IND.
000070
000080          OPEN INPUT ARKIND.
000090
000100          IF STATUS-IND = "35" OR "39"
000110           OPEN OUTPUT ARKIND
000120           PERFORM INIZIALIZZA-IND  THRU EX-INIZIALIZZA-IND
000130           CLOSE ARKIND
000140
000150            GO TO OPEN-I-IND.
000160
000170          IF STATUS-IND NOT = ZEROS
000180           PERFORM ERRORE-IND THRU EX-ERRORE-IND
000190           CLOSE ARKIND.
000200
000210          INITIALIZE INDENNITA.
000220
000230  EX-OPEN-I-IND.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-IND.
000290
000300          PERFORM PREPARA-IND THRU EX-PREPARA-IND.
000310
000320          MOVE ZEROS      TO STATUS-IND.
000330
000340          OPEN I-O ARKIND.
000350
000360          IF STATUS-IND = "35" OR "39"
000370           OPEN OUTPUT ARKIND
000380           PERFORM INIZIALIZZA-IND  THRU EX-INIZIALIZZA-IND
000390           CLOSE ARKIND
000400            GO TO OPEN-IO-IND.
000410
000420          IF STATUS-IND NOT = ZEROS
000430           PERFORM ERRORE-IND THRU EX-ERRORE-IND
000440           CLOSE ARKIND.
000450
000460           INITIALIZE INDENNITA.
000470
000480  EX-OPEN-IO-IND.
000490          EXIT.
000500*
000510  ERRORE-IND.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-IND DELIMITED BY "   "
000550          " STATO:" STATUS-IND
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-IND.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-IND.
000660          MOVE "SI"       TO ESITO.
000670          START ARKIND KEY IS NOT < CHIAVE-IND
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-IND.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-IND.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKIND NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-IND.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-IND.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKIND KEY IS CHIAVE-IND
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-IND = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-IND.
000980
000990  EX-LEGGO-IND.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-IND.
001050
001060          perform FISSE-IND THRU EX-FISSE-IND.
001070
001080          MOVE "SI"       TO ESITO.
001090          WRITE INDENNITA
001100           INVALID KEY
001110           MOVE "NO"      TO ESITO.
001120
001130          IF STATUS-IND(1:1) > "2"
001140           PERFORM ERRORE-IND THRU EX-ERRORE-IND.
001150  EX-SCRIVO-IND.
001160          EXIT.
001170*
001180***
001190*
001200  AGGIORNO-IND.
001210
001220          perform FISSE-IND THRU EX-FISSE-IND.
001230
001240          MOVE "SI"       TO ESITO.
001250          REWRITE INDENNITA
001260           INVALID KEY
001270           MOVE "NO"      TO ESITO.
001280
001290          IF STATUS-IND(1:1) > "2"
001300           PERFORM ERRORE-IND THRU EX-ERRORE-IND.
001310
001320  EX-AGGIORNO-IND.
001330          EXIT.
001340*
001350***
001360*
001370  CANCELLO-IND.
001380          MOVE "SI"       TO ESITO.
001390          DELETE ARKIND
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-IND(1:1) > "2"
001440           PERFORM ERRORE-IND THRU EX-ERRORE-IND.
001450
001460  EX-CANCELLO-IND.
001470          EXIT.
001480
001490  CLOSE-IND.
001500          CLOSE ARKIND.
001510  EX-CLOSE-IND.
001520          EXIT.
001530
001540  INIZIALIZZA-IND.
001550

001580





001640
001650  EX-INIZIALIZZA-IND.
001660          EXIT.
001670
001680  PREPARA-IND.
001690
001700          MOVE "FILES/ARKIND"  TO FILE-IND.
001710
001720  EX-PREPARA-IND.
001730          EXIT.
001740
001750  FISSE-IND.
001760
001770
001780  EX-FISSE-IND.
001790
001800          EXIT.
001810
