000010  OPEN-O-JSON.
000020
000030          PERFORM PREPARA-JSON THRU EX-PREPARA-JSON.
000040
000050          MOVE ZEROS      TO STATUS-JSON.
000060
000070          OPEN OUTPUT ARKJSON
000080
000090          IF STATUS-JSON NOT = ZEROS
000100           PERFORM ERRORE-JSON THRU EX-ERRORE-JSON
000110           CLOSE ARKJSON.
000120
000130          INITIALIZE JSON.
000180
000190  EX-OPEN-O-JSON.
000200          EXIT.
000210
000220
000230*
000240  OPEN-I-JSON.
000250
000260          PERFORM PREPARA-JSON THRU EX-PREPARA-JSON.
000270
000280          MOVE ZEROS      TO STATUS-JSON.
000290
000300          OPEN INPUT ARKJSON.
000310
000320          IF STATUS-JSON = "35"
000330           OPEN OUTPUT ARKJSON
000340           CLOSE ARKJSON
000350            GO TO OPEN-I-JSON.
000360
000370          IF STATUS-JSON NOT = ZEROS
000380           PERFORM ERRORE-JSON THRU EX-ERRORE-JSON
000390           CLOSE ARKJSON.
000400
000410  EX-OPEN-I-JSON.
000420          EXIT.
000430*
000440***
000450*
000650*
000660  ERRORE-JSON.
000670
000680          STRING "ERRORE SU " DELIMITED BY SIZE
000690          FILE-JSON DELIMITED BY "   "
000700          " STATO:" STATUS-JSON
000710          DELIMITED BY  SIZE INTO MESSAGGIO
000720          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000730
000740  EX-ERRORE-JSON.
000750          EXIT.
000760
000770*
000780***
000910*
000920  LEGGO-NEXT-JSON.
000930          MOVE         "N"     TO FINE-FILE.
000940          READ ARKJSON NEXT RECORD  NO LOCK
000950           AT END MOVE "S"     TO FINE-FILE.
000960  EX-LEGGO-NEXT-JSON.
000970          EXIT.
000980*
000990***
001000*
001200
001210  SCRIVO-JSON.
001220
001230          MOVE "SI"       TO ESITO.
001240
001250          WRITE JSON.
001260
001270
001280          IF STATUS-JSON(1:1) > "2"
001290           PERFORM ERRORE-JSON THRU EX-ERRORE-JSON.
001300
001310
001320  EX-SCRIVO-JSON.
001330          EXIT.
001340*
001350***
001360
001370  CLOSE-JSON.
001380          CLOSE ARKJSON.
001390  EX-CLOSE-JSON.
001400          EXIT.
001410
001420  PREPARA-JSON.

                MOVE SPACES TO FILE-JSON.
001430
001440          STRING "TEMP/ARKJSON-" DELIMITED BY SIZE
                        NOME-JSON DELIMITED BY "  "
001450                  SECTION-WEB ".json" 
001460           DELIMITED BY SIZE INTO FILE-JSON.

                STRING "/Openpa/" FILE-JSON 
001130			 DELIMITED BY SIZE INTO STRINGA-VIEW.
001140
001160          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001170
001470
001480  EX-PREPARA-JSON.
001490          EXIT.
001500
001510  SCRITTURA-JSON.
001520
001550          INSPECT JSON REPLACING ALL x"00" BY X"20".
001560
001590          PERFORM SCRIVO-JSON THRU EX-SCRIVO-JSON.
001600
001610          INITIALIZE JSON.
001620
001630  EX-SCRITTURA-JSON.
001640          EXIT.
001650
001660
