000010*
000020  OPEN-I-MATR.
000030
000040          PERFORM PREPARA-MATR THRU EX-PREPARA-MATR.
000050
000060          MOVE ZEROS      TO STATUS-MATR.
000070
000080          OPEN INPUT ARKMATR.
000090
000100          IF STATUS-MATR = "35" OR "39"
000110           OPEN OUTPUT ARKMATR
000120           PERFORM INIZIALIZZA-MATR  THRU EX-INIZIALIZZA-MATR
000130           CLOSE ARKMATR
000140
000150            GO TO OPEN-I-MATR.
000160
000170          IF STATUS-MATR NOT = ZEROS
000180           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR
000190           CLOSE ARKMATR.
000200
000210          INITIALIZE MATRICOLA.
000220
000230  EX-OPEN-I-MATR.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-MATR.
000290
000300          PERFORM PREPARA-MATR THRU EX-PREPARA-MATR.
000310
000320          MOVE ZEROS      TO STATUS-MATR.
000330
000340          OPEN I-O ARKMATR.
000350
000360          IF STATUS-MATR = "35" OR "39"
000370           OPEN OUTPUT ARKMATR
000380           PERFORM INIZIALIZZA-MATR  THRU EX-INIZIALIZZA-MATR
000390           CLOSE ARKMATR
000400            GO TO OPEN-IO-MATR.
000410
000420          IF STATUS-MATR NOT = ZEROS
000430           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR
000440           CLOSE ARKMATR.
000450
000460           INITIALIZE MATRICOLA.
000470
000480  EX-OPEN-IO-MATR.
000490          EXIT.
000500*
000510  ERRORE-MATR.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-MATR DELIMITED BY "   "
000550          " STATO:" STATUS-MATR
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-MATR.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-MATR.
000660          MOVE "SI"       TO ESITO.
000670          START ARKMATR KEY IS NOT < CHIAVE-MATR
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-MATR.
000710          EXIT.
000720
000730  STARTO-NOME-MATR.
000740          MOVE "SI"       TO ESITO.
000750          START ARKMATR KEY IS NOT < GENERALITA-MATR
000760           INVALID KEY
000770           MOVE "NO"      TO ESITO.
000780  EX-STARTO-NOME-MATR.
000790          EXIT.
000800
000810*
000820***
000830*
000840***
000850*
000860  LEGGO-NEXT-MATR.
000870          MOVE         "N"     TO FINE-FILE.
000880          READ ARKMATR NEXT RECORD  NO LOCK
000890           AT END MOVE "S"     TO FINE-FILE.
000900  EX-LEGGO-NEXT-MATR.
000910          EXIT.
000920*
000930***
000940*
000950  LEGGO-MATR.
000960
000970          MOVE "SI"       TO ESITO.
000980          READ ARKMATR KEY IS CHIAVE-MATR
000990           INVALID KEY
001000           MOVE "NO"      TO ESITO.
001010
001020          IF STATUS-MATR = LOCK-STATUS
001030           MOVE "Record in uso presso altro terminale"
001040            TO MESSAGGIO
001050            PERFORM VIS-MESS     THRU EX-VIS-MESS
001060             GO TO LEGGO-MATR.
001070
001080  EX-LEGGO-MATR.
001090          EXIT.
001100
001110***
001120*
001130  SCRIVO-MATR.
001140
001150          perform FISSE-MATR THRU EX-FISSE-MATR.
001160
001170          MOVE "SI"       TO ESITO.
001180          WRITE MATRICOLA
001190           INVALID KEY
001200           MOVE "NO"      TO ESITO.
001210
001220          IF STATUS-MATR(1:1) > "2"
001230           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR.
001240  EX-SCRIVO-MATR.
001250          EXIT.
001260*
001270***
001280*
001290  AGGIORNO-MATR.
001300
001310          perform FISSE-MATR THRU EX-FISSE-MATR.
001320
001330          MOVE "SI"       TO ESITO.
001340          REWRITE MATRICOLA
001350           INVALID KEY
001360           MOVE "NO"      TO ESITO.
001370
001380          IF STATUS-MATR(1:1) > "2"
001390           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR.
001400
001410  EX-AGGIORNO-MATR.
001420          EXIT.
001430*
001440***
001450*
001460  CANCELLO-MATR.
001470          MOVE "SI"       TO ESITO.
001480          DELETE ARKMATR
001490           INVALID KEY
001500           MOVE "NO"      TO ESITO.
001510
001520          IF STATUS-MATR(1:1) > "2"
001530           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR.
001540
001550  EX-CANCELLO-MATR.
001560          EXIT.
001570
001580  CLOSE-MATR.
001590          CLOSE ARKMATR.
001600  EX-CLOSE-MATR.
001610          EXIT.
001620
001630  INIZIALIZZA-MATR.
001640
001650
001660  EX-INIZIALIZZA-MATR.
001670          EXIT.
001680
001690  PREPARA-MATR.
001700
001710
001720          IF PATH-WEB = SPACE
001730          MOVE "FILES/ARKMATR"  TO FILE-MATR
001740           ELSE
001750          MOVE SPACES           TO FILE-MATR                
001760          
001770          STRING PATH-WEB DELIMITED BY "  "
001780            "ARKMATR" DELIMITED BY SIZE INTO FILE-MATR.
001790
001800  EX-PREPARA-MATR.
001810          EXIT.
001820
001830  FISSE-MATR.
001840
001850
001860  EX-FISSE-MATR.
001870
001880          EXIT.
001890
