000010*
000020  OPEN-I-MENU.
000030
000040          PERFORM PREPARA-MENU THRU EX-PREPARA-MENU.
000050
000060          MOVE ZEROS      TO STATUS-MENU.
000070
000080          OPEN INPUT ARKMENU.
000090
000100          IF STATUS-MENU = "35"
000110           OPEN OUTPUT ARKMENU
000120           CLOSE ARKMENU
000130
000140            GO TO OPEN-I-MENU.
000150
000160          IF STATUS-MENU NOT = ZEROS
000170           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU
000180           CLOSE ARKMENU.
000190
000200          INITIALIZE MENU.
000210
000220  EX-OPEN-I-MENU.
000230          EXIT.
000240*
000250***
000260*
000270  OPEN-IO-MENU.
000280
000290          PERFORM PREPARA-MENU THRU EX-PREPARA-MENU.
000300
000310          MOVE ZEROS      TO STATUS-MENU.
000320
000330          OPEN I-O ARKMENU.
000340
000350          IF STATUS-MENU = "35"
000360           OPEN OUTPUT ARKMENU
000370           CLOSE ARKMENU
000380            GO TO OPEN-IO-MENU.
000390
000400          IF STATUS-MENU NOT = ZEROS
000410           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU
000420           CLOSE ARKMENU.
000430
000440           INITIALIZE MENU.
000450
000460  EX-OPEN-IO-MENU.
000470          EXIT.
000480*
000490  ERRORE-MENU.
000500
000510          STRING "ERRORE SU " DELIMITED BY SIZE
000520          FILE-MENU DELIMITED BY "   "
000530          " STATO:" STATUS-MENU
000540          DELIMITED BY  SIZE INTO MESSAGGIO
000550          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000560
000570  EX-ERRORE-MENU.
000580          EXIT.
000590
000600*
000610***
000620*
000630  STARTO-MENU.
000640          MOVE "SI"       TO ESITO.
000650          START ARKMENU KEY IS NOT < CHIAVE-MENU
000660           INVALID KEY
000670           MOVE "NO"      TO ESITO.
000680  EX-STARTO-MENU.
000690          EXIT.
000700*
000710***
000720*
000730***
000740*
000750  LEGGO-NEXT-MENU.
000760          MOVE         "N"     TO FINE-FILE.
000770          READ ARKMENU NEXT RECORD  NO LOCK
000780           AT END MOVE "S"     TO FINE-FILE.
000790  EX-LEGGO-NEXT-MENU.
000800          EXIT.
000810*
000820***
000830*
000840  LEGGO-MENU.
000850
000860          MOVE "SI"       TO ESITO.
000870          READ ARKMENU KEY IS CHIAVE-MENU
000880           INVALID KEY
000890           MOVE "NO"      TO ESITO.
000900
000910          IF STATUS-MENU = LOCK-STATUS
000920           MOVE "Record in uso presso altro terminale"
000930            TO MESSAGGIO
000940            PERFORM VIS-MESS     THRU EX-VIS-MESS
000950             GO TO LEGGO-MENU.
000960
000970  EX-LEGGO-MENU.
000980          EXIT.
000990
000840  LEGGO-SEC-MENU.
000850
000860          MOVE "SI"       TO ESITO.
000870          READ ARKMENU NO LOCK KEY IS CHIAVE-SEC-MENU
000880           INVALID KEY
000890           MOVE "NO"      TO ESITO.
000900
000910          IF STATUS-MENU = LOCK-STATUS
000920           MOVE "Record in uso presso altro terminale"
000930            TO MESSAGGIO
000940            PERFORM VIS-MESS     THRU EX-VIS-MESS
000950             GO TO LEGGO-SEC-MENU.
000960
000970  EX-LEGGO-SEC-MENU.
000980          EXIT.
990

001000***
001010*
001020  SCRIVO-MENU.
001030
001040          MOVE "SI"       TO ESITO.
001050          WRITE MENU
001060           INVALID KEY
001070           MOVE "NO"      TO ESITO.
001080
001090          IF STATUS-MENU(1:1) > "2"
001100           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU.
001110  EX-SCRIVO-MENU.
001120          EXIT.
001130*
001140***
001150*
001160  AGGIORNO-MENU.
001170          MOVE "SI"       TO ESITO.
001180          REWRITE MENU
001190           INVALID KEY
001200           MOVE "NO"      TO ESITO.
001210
001220          IF STATUS-MENU(1:1) > "2"
001230           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU.
001240
001250  EX-AGGIORNO-MENU.
001260          EXIT.
001270*
001280***
001290*
001300  CANCELLO-MENU.
001310          MOVE "SI"       TO ESITO.
001320          DELETE ARKMENU
001330           INVALID KEY
001340           MOVE "NO"      TO ESITO.
001350
001360          IF STATUS-MENU(1:1) > "2"
001370           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU.
001380
001390  EX-CANCELLO-MENU.
001400          EXIT.
001410
001420  CLOSE-MENU.
001430          CLOSE ARKMENU.
001440  EX-CLOSE-MENU.
001450          EXIT.
001460
001470
001480  PREPARA-MENU.
001490

                IF PATH-WEB = SPACE
                MOVE "FILES/ARKMENU"  TO FILE-MENU
                 ELSE
                MOVE SPACES           TO FILE-MENU                
                
                STRING PATH-WEB DELIMITED BY "  "
                  "ARKMENU" DELIMITED BY SIZE INTO FILE-MENU.
001710
001510  EX-PREPARA-MENU.
001520          EXIT.
001530
001540
001550  STARTO-DESC-MENU.
001560          MOVE "SI"       TO ESITO.
001570          START ARKMENU KEY IS NOT < DESC-MENU
001580           INVALID KEY
001590           MOVE "NO"      TO ESITO.
001600  EX-STARTO-DESC-MENU.
001610          EXIT.
001620
001630  STARTO-SEC-MENU.
001640          MOVE "SI"       TO ESITO.
001650          START ARKMENU KEY IS NOT < CHIAVE-SEC-MENU
001660           INVALID KEY
001670           MOVE "NO"      TO ESITO.
001680  EX-STARTO-SEC-MENU.
001690          EXIT.
001700
000840  LEGGO-TER-MENU.
000850
000860          MOVE "SI"       TO ESITO.
000870          READ ARKMENU NO LOCK KEY IS CHIAVE-TER-MENU
000880           INVALID KEY
000890           MOVE "NO"      TO ESITO.
000900
000910          IF STATUS-MENU = LOCK-STATUS
000920           MOVE "Record in uso presso altro terminale"
000930            TO MESSAGGIO
000940            PERFORM VIS-MESS     THRU EX-VIS-MESS
000950             GO TO LEGGO-TER-MENU.
000960
000970  EX-LEGGO-TER-MENU.
000980          EXIT.
990
