000010*
000020  OPEN-I-MATR.
000030
000040          PERFORM PREPARA-MATR THRU EX-PREPARA-MATR.
000050
000060          MOVE ZEROS      TO STATUS-MATR.
000070
000080          OPEN INPUT ARKMATR.
000090
000100          IF STATUS-MATR = "35" OR "39"
000110           OPEN OUTPUT ARKMATR
000120           PERFORM INIZIALIZZA-MATR  THRU EX-INIZIALIZZA-MATR
000130           CLOSE ARKMATR
000140
000150            GO TO OPEN-I-MATR.
000160
000170          IF STATUS-MATR NOT = ZEROS
000180           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR
000190           CLOSE ARKMATR.
000200
000210          INITIALIZE MATRICOLA.
000220
000230  EX-OPEN-I-MATR.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-MATR.
000290
000300          PERFORM PREPARA-MATR THRU EX-PREPARA-MATR.
000310
000320          MOVE ZEROS      TO STATUS-MATR.
000330
000340          OPEN I-O ARKMATR.
000350
000360          IF STATUS-MATR = "35" OR "39"
000370           OPEN OUTPUT ARKMATR
000380           PERFORM INIZIALIZZA-MATR  THRU EX-INIZIALIZZA-MATR
000390           CLOSE ARKMATR
000400            GO TO OPEN-IO-MATR.
000410
000420          IF STATUS-MATR NOT = ZEROS
000430           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR
000440           CLOSE ARKMATR.
000450
000460           INITIALIZE MATRICOLA.
000470
000480  EX-OPEN-IO-MATR.
000490          EXIT.
000500*
000510  ERRORE-MATR.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-MATR DELIMITED BY "   "
000550          " STATO:" STATUS-MATR
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-MATR.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-MATR.
000660          MOVE "SI"       TO ESITO.
000670          START ARKMATR KEY IS NOT < CHIAVE-MATR
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-MATR.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-MATR.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKMATR NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-MATR.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-MATR.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKMATR KEY IS CHIAVE-MATR
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-MATR = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-MATR.
000980
000990  EX-LEGGO-MATR.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-MATR.
001050
001060          perform FISSE-MATR THRU EX-FISSE-MATR.
001070
001080          MOVE "SI"       TO ESITO.
001090          WRITE MATRICOLA
001100           INVALID KEY
001110           MOVE "NO"      TO ESITO.
001120
001130          IF STATUS-MATR(1:1) > "2"
001140           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR.
001150  EX-SCRIVO-MATR.
001160          EXIT.
001170*
001180***
001190*
001200  AGGIORNO-MATR.
001210
001220          perform FISSE-MATR THRU EX-FISSE-MATR.
001230
001240          MOVE "SI"       TO ESITO.
001250          REWRITE MATRICOLA
001260           INVALID KEY
001270           MOVE "NO"      TO ESITO.
001280
001290          IF STATUS-MATR(1:1) > "2"
001300           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR.
001310
001320  EX-AGGIORNO-MATR.
001330          EXIT.
001340*
001350***
001360*
001370  CANCELLO-MATR.
001380          MOVE "SI"       TO ESITO.
001390          DELETE ARKMATR
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-MATR(1:1) > "2"
001440           PERFORM ERRORE-MATR THRU EX-ERRORE-MATR.
001450
001460  EX-CANCELLO-MATR.
001470          EXIT.
001480
001490  CLOSE-MATR.
001500          CLOSE ARKMATR.
001510  EX-CLOSE-MATR.
001520          EXIT.
001530
001540  INIZIALIZZA-MATR.
001550
001640
001650  EX-INIZIALIZZA-MATR.
001660          EXIT.
001670
001680  PREPARA-MATR.
001690
001700          MOVE "FILES/ARKMATR"  TO FILE-MATR.
001710
001720  EX-PREPARA-MATR.
001730          EXIT.
001740
001750  FISSE-MATR.
001760
001770
001780  EX-FISSE-MATR.
001790
001800          EXIT.
001810
