000010*
000020  OPEN-I-PROF.
000030
000040          PERFORM PREPARA-PROF THRU EX-PREPARA-PROF.
000050
000060          MOVE ZEROS      TO STATUS-PROF.
000070
000080          OPEN INPUT ARKPROF.
000090
000100          IF STATUS-PROF = "35" OR "39"
000110           OPEN OUTPUT ARKPROF
000120           PERFORM INIZIALIZZA-PROF  THRU EX-INIZIALIZZA-PROF
000130           CLOSE ARKPROF
000140
000150            GO TO OPEN-I-PROF.
000160
000170          IF STATUS-PROF NOT = ZEROS
000180           PERFORM ERRORE-PROF THRU EX-ERRORE-PROF
000190           CLOSE ARKPROF.
000200
000210          INITIALIZE PROFILO.
000220
000230  EX-OPEN-I-PROF.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-PROF.
000290
000300          PERFORM PREPARA-PROF THRU EX-PREPARA-PROF.
000310
000320          MOVE ZEROS      TO STATUS-PROF.
000330
000340          OPEN I-O ARKPROF.
000350
000360          IF STATUS-PROF = "35" OR "39"
000370           OPEN OUTPUT ARKPROF
000380           PERFORM INIZIALIZZA-PROF  THRU EX-INIZIALIZZA-PROF
000390           CLOSE ARKPROF
000400            GO TO OPEN-IO-PROF.
000410
000420          IF STATUS-PROF NOT = ZEROS
000430           PERFORM ERRORE-PROF THRU EX-ERRORE-PROF
000440           CLOSE ARKPROF.
000450
000460           INITIALIZE PROFILO.
000470
000480  EX-OPEN-IO-PROF.
000490          EXIT.
000500*
000510  ERRORE-PROF.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-PROF DELIMITED BY "   "
000550          " STATO:" STATUS-PROF
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-PROF.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-PROF.
000660          MOVE "SI"       TO ESITO.
000670          START ARKPROF KEY IS NOT < CHIAVE-PROF
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-PROF.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-PROF.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKPROF NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-PROF.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-PROF.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKPROF KEY IS CHIAVE-PROF
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-PROF = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-PROF.
000980
000990  EX-LEGGO-PROF.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-PROF.
001050
001060          perform FISSE-PROF THRU EX-FISSE-PROF.
001070
001080          MOVE "SI"       TO ESITO.
001090          WRITE PROFILO
001100           INVALID KEY
001110           MOVE "NO"      TO ESITO.
001120
001130          IF STATUS-PROF(1:1) > "2"
001140           PERFORM ERRORE-PROF THRU EX-ERRORE-PROF.
001150  EX-SCRIVO-PROF.
001160          EXIT.
001170*
001180***
001190*
001200  AGGIORNO-PROF.
001210
001220          perform FISSE-PROF THRU EX-FISSE-PROF.
001230
001240          MOVE "SI"       TO ESITO.
001250          REWRITE PROFILO
001260           INVALID KEY
001270           MOVE "NO"      TO ESITO.
001280
001290          IF STATUS-PROF(1:1) > "2"
001300           PERFORM ERRORE-PROF THRU EX-ERRORE-PROF.
001310
001320  EX-AGGIORNO-PROF.
001330          EXIT.
001340*
001350***
001360*
001370  CANCELLO-PROF.
001380          MOVE "SI"       TO ESITO.
001390          DELETE ARKPROF
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-PROF(1:1) > "2"
001440           PERFORM ERRORE-PROF THRU EX-ERRORE-PROF.
001450
001460  EX-CANCELLO-PROF.
001470          EXIT.
001480
001490  CLOSE-PROF.
001500          CLOSE ARKPROF.
001510  EX-CLOSE-PROF.
001520          EXIT.
001530
001540  INIZIALIZZA-PROF.
001550
001560
001570  EX-INIZIALIZZA-PROF.
001580          EXIT.
001590
001600  PREPARA-PROF.
001610
001620
001630          IF PATH-WEB = SPACE
001640          MOVE "FILES/ARKPROF"  TO FILE-PROF
001650           ELSE
001660          MOVE SPACES           TO FILE-PROF         
001670          
001680          STRING PATH-WEB DELIMITED BY "  "
001690            "ARKPROF" DELIMITED BY SIZE INTO FILE-PROF.
001700
001710  EX-PREPARA-PROF.
001720          EXIT.
001730
001740  FISSE-PROF.
001750
001760
001770  EX-FISSE-PROF.
001780
001790          EXIT.
001800
