000010*
000020  OPEN-I-TAB.
000030
000040          PERFORM PREPARA-TAB THRU EX-PREPARA-TAB.
000050
000060          MOVE ZEROS      TO STATUS-TAB.
000070
000080          OPEN INPUT ARKTAB.
000090
000100          IF STATUS-TAB = "35" OR "39"
000110           OPEN OUTPUT ARKTAB
000120           PERFORM INIZIALIZZA-TAB  THRU EX-INIZIALIZZA-TAB
000130           CLOSE ARKTAB
000140
000150            GO TO OPEN-I-TAB.
000160
000170          IF STATUS-TAB NOT = ZEROS
000180           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB
000190           CLOSE ARKTAB.
000200
000210          INITIALIZE TABELLA.
000220
000230  EX-OPEN-I-TAB.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-TAB.
000290
000300          PERFORM PREPARA-TAB THRU EX-PREPARA-TAB.
000310
000320          MOVE ZEROS      TO STATUS-TAB.
000330
000340          OPEN I-O ARKTAB.
000350
000360          IF STATUS-TAB = "35" OR "39"
000370           OPEN OUTPUT ARKTAB
000380           PERFORM INIZIALIZZA-TAB  THRU EX-INIZIALIZZA-TAB
000390           CLOSE ARKTAB
000400            GO TO OPEN-IO-TAB.
000410
000420          IF STATUS-TAB NOT = ZEROS
000430           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB
000440           CLOSE ARKTAB.
000450
000460           INITIALIZE TABELLA.
000470
000480  EX-OPEN-IO-TAB.
000490          EXIT.
000500*
000510  ERRORE-TAB.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-TAB DELIMITED BY "   "
000550          " STATO:" STATUS-TAB
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-TAB.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-TAB.
000660          MOVE "SI"       TO ESITO.
000670          START ARKTAB KEY IS NOT < CHIAVE-TAB
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-TAB.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-TAB.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKTAB NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-TAB.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-TAB.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKTAB KEY IS CHIAVE-TAB
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-TAB = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-TAB.
000980
000990  EX-LEGGO-TAB.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-TAB.
001050
001060          perform FISSE-TAB THRU EX-FISSE-TAB.
001070
001080          MOVE "SI"       TO ESITO.
001090          WRITE TABELLA
001100           INVALID KEY
001110           MOVE "NO"      TO ESITO.
001120
001130          IF STATUS-TAB(1:1) > "2"
001140           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB.
001150  EX-SCRIVO-TAB.
001160          EXIT.
001170*
001180***
001190*
001200  AGGIORNO-TAB.
001210
001220          perform FISSE-TAB THRU EX-FISSE-TAB.
001230
001240          MOVE "SI"       TO ESITO.
001250          REWRITE TABELLA
001260           INVALID KEY
001270           MOVE "NO"      TO ESITO.
001280
001290          IF STATUS-TAB(1:1) > "2"
001300           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB.
001310
001320  EX-AGGIORNO-TAB.
001330          EXIT.
001340*
001350***
001360*
001370  CANCELLO-TAB.
001380          MOVE "SI"       TO ESITO.
001390          DELETE ARKTAB
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-TAB(1:1) > "2"
001440           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB.
001450
001460  EX-CANCELLO-TAB.
001470          EXIT.
001480
001490  CLOSE-TAB.
001500          CLOSE ARKTAB.
001510  EX-CLOSE-TAB.
001520          EXIT.
001530
001540  INIZIALIZZA-TAB.
001550
001560           INITIALIZE TABELLA-001
001570
001580           MOVE 01    TO ENTE-TAB
001590           MOVE "01"  TO TIPO-TAB
001600           MOVE 1     TO PROG-TAB.
001610
001620           MOVE "ENTE DIMOSTRATIVO" TO DESC-ENTE-001.
001630
001640           WRITE TABELLA.
001650
001660  EX-INIZIALIZZA-TAB.
001670          EXIT.
001680
001690  PREPARA-TAB.
001700
001710          MOVE "FILES/ARKTAB"  TO FILE-TAB.
001720  EX-PREPARA-TAB.
001730          EXIT.
001740
001750  FISSE-TAB.
001760  
001770             EVALUATE TIPO-TAB  
001780
001790                  WHEN "01"   
001800								MOVE WEB-001       	TO DESCR-TAB(1)
001810                            	MOVE EMAIL-001     	TO DESCR-TAB(2)
001840
001850          
001860                  WHEN "07"   
001870								MOVE TIPO-QUAL-007 	TO DESCR-TAB(1)
001880                            	MOVE CONTO-007     	TO DESCR-TAB(2)
001910
001911                  WHEN "08"   
001914								MOVE SPACES        	TO DESCR-TAB(1)								
001920								MOVE SPACES        	TO DESCR-TAB(2)								
001921
001930                  WHEN "48"   
001940
001950								MOVE DESC-CONTO-048 TO DESCR-TAB(1)
001960                              MOVE NOCONTO-048   	TO DESCR-TAB(2)
001970                              MOVE VOCE-048   	TO DESCR-TAB(3)
001980                              MOVE MINIMO-048   	TO DESCR-TAB(4)
001990
002040
002050                            
002060             WHEN OTHER     	INITIALIZE DESCRIZIONI-TAB
002070             END-EVALUATE.
002080                  
002090  
002100  
002110  EX-FISSE-TAB.
002120  
002130          EXIT.
002140   
