000010*
000020  OPEN-I-UTEN.
000030
000040          PERFORM PREPARA-UTEN THRU EX-PREPARA-UTEN.
000050
000060          MOVE ZEROS      TO STATUS-UTEN.
000070
000080          OPEN INPUT ARKUTEN.
000090
000100          IF STATUS-UTEN = "35"
000110           OPEN OUTPUT ARKUTEN
000120           PERFORM INIZIALIZZA-UTEN  THRU EX-INIZIALIZZA-UTEN
000130           CLOSE ARKUTEN
000140
000150            GO TO OPEN-I-UTEN.
000160
000170          IF STATUS-UTEN NOT = ZEROS
000180           PERFORM ERRORE-UTEN THRU EX-ERRORE-UTEN
000190           CLOSE ARKUTEN.
000200
000210          INITIALIZE UTENTE.
000220
000230  EX-OPEN-I-UTEN.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-UTEN.
000290
000300          PERFORM PREPARA-UTEN THRU EX-PREPARA-UTEN.
000310
000320          MOVE ZEROS      TO STATUS-UTEN.
000330
000340          OPEN I-O ARKUTEN.
000350
000360          IF STATUS-UTEN = "35"
000370           OPEN OUTPUT ARKUTEN
000380           PERFORM INIZIALIZZA-UTEN  THRU EX-INIZIALIZZA-UTEN
000390           CLOSE ARKUTEN
000400            GO TO OPEN-IO-UTEN.
000410
000420          IF STATUS-UTEN NOT = ZEROS
000430           PERFORM ERRORE-UTEN THRU EX-ERRORE-UTEN
000440           CLOSE ARKUTEN.
000450
000460           INITIALIZE UTENTE.
000470
000480  EX-OPEN-IO-UTEN.
000490          EXIT.
000500*
000510  ERRORE-UTEN.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-UTEN DELIMITED BY "   "
000550          " STATO:" STATUS-UTEN
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-UTEN.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-UTEN.
000660          MOVE "SI"       TO ESITO.
000670          START ARKUTEN KEY IS NOT < CHIAVE-UTEN
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-UTEN.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-UTEN.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKUTEN NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-UTEN.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-UTEN.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKUTEN KEY IS CHIAVE-UTEN
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-UTEN = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-UTEN.
000980
000990  EX-LEGGO-UTEN.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-UTEN.
001050
001060          MOVE "SI"       TO ESITO.
001070          WRITE UTENTE
001080           INVALID KEY
001090           MOVE "NO"      TO ESITO.
001100
001110          IF STATUS-UTEN(1:1) > "2"
001120           PERFORM ERRORE-UTEN THRU EX-ERRORE-UTEN.
001130  EX-SCRIVO-UTEN.
001140          EXIT.
001150*
001160***
001170*
001180  AGGIORNO-UTEN.
001190          MOVE "SI"       TO ESITO.
001200          REWRITE UTENTE
001210           INVALID KEY
001220           MOVE "NO"      TO ESITO.
001230
001240          IF STATUS-UTEN(1:1) > "2"
001250           PERFORM ERRORE-UTEN THRU EX-ERRORE-UTEN.
001260
001270  EX-AGGIORNO-UTEN.
001280          EXIT.
001290*
001300***
001310*
001320  CANCELLO-UTEN.
001330          MOVE "SI"       TO ESITO.
001340          DELETE ARKUTEN
001350           INVALID KEY
001360           MOVE "NO"      TO ESITO.
001370
001380          IF STATUS-UTEN(1:1) > "2"
001390           PERFORM ERRORE-UTEN THRU EX-ERRORE-UTEN.
001400
001410  EX-CANCELLO-UTEN.
001420          EXIT.
001430
001440  CLOSE-UTEN.
001450          CLOSE ARKUTEN.
001460  EX-CLOSE-UTEN.
001470          EXIT.
001480
001490  INIZIALIZZA-UTEN.
001500           INITIALIZE UTENTE
001510           MOVE "ADMIN"  TO NOME-UTEN
001520           MOVE ZEROS    TO VOLTE-UTEN ACCESSI-UTEN
001530           MOVE 20401231 TO DATA-SCAD-UTEN
001540           MOVE "xAjw9uO0sVurA"  TO PASSWORD-UTEN
001600
001610           WRITE UTENTE.
001620
001630  EX-INIZIALIZZA-UTEN.
001640          EXIT.
001650
001660  PREPARA-UTEN.
001670
001680          MOVE "FILES/ARKUTEN"  TO FILE-UTEN.
001690
001700  EX-PREPARA-UTEN.
001710          EXIT.
001720
001730  LETTURA-UTEN.
001740
001750           PERFORM LEGGO-UTEN THRU EX-LEGGO-UTEN.
001760
001770           IF ESITO-NOK GO TO EX-LETTURA-UTEN.
001780
001790           PERFORM CONTROLLO-SESSIONE-UTEN
001800                  THRU EX-CONTROLLO-SESSIONE-UTEN.
001810
001820           IF SCADUTO-UTEN = 1
001830             MOVE "NO"  TO ESITO.
001840
001850  EX-LETTURA-UTEN.
001860          EXIT.
001870
001880  CALCOLO-SESSIONE-UTEN.
001890
001900          ACCEPT ORARIO-ACC-UTEN FROM TIME.
001910
001920* timeout dopo 10 minuti di inattivita' SE = 0 O > 30 ASSEGNA IL DEFAULT D'UFFICIO
001930
001940          IF TIMEOUT-UTEN = ZERO MOVE 180 TO TIMEOUT-UTEN.
001950
001960          COMPUTE MINUTI-SCA-UTEN = ( ORA-ACC-UTEN * 60  )
001970              +  MIN-ACC-UTEN + TIMEOUT-UTEN.
001980
001990          MOVE ZEROS      TO SCADUTO-UTEN.
002000
002010          DIVIDE MINUTI-SCA-UTEN BY 60 GIVING ORA-SCA-UTEN
002020            REMAINDER MIN-SCA-UTEN.
002030
002040          PERFORM AGGIORNO-UTEN THRU EX-AGGIORNO-UTEN.
002050
002060  EX-CALCOLO-SESSIONE-UTEN.
002070          EXIT.
002080
002090  CONTROLLO-SESSIONE-UTEN.
002100
002110          ACCEPT ORARIO-ACC-UTEN FROM TIME.
002120
002130          COMPUTE MINUTI-ACC-UTEN = ( ORA-ACC-UTEN * 60  ) +
002140              MIN-ACC-UTEN.
002150
002160          IF MINUTI-ACC-UTEN > MINUTI-SCA-UTEN
002170               MOVE 1        TO SCADUTO-UTEN
002180               ELSE
002190               MOVE ZEROS    TO SCADUTO-UTEN.
002200
002210
002220  EX-CONTROLLO-SESSIONE-UTEN.
002230          EXIT.
