000010  INIZIO-WEB.

			 MOVE LOW-VALUE			 TO COBW3.
			
000030       CALL  "COBW3_INIT"      USING  COBW3 .
000040
000050* SET the CONTENT-TYPE to HTML
000060        SET COBW3-CONTENT-TYPE-HTML TO TRUE .
000070
000080* COMMENTARE PER DISATTIVARE IL DEBUG NATIVO
000090*       MOVE "1"             TO COBW3-DMODE.
000100
000110  EX-INIZIO-WEB.
000120         EXIT.
000130
000140
000150  FINE-WEB.
000160
000170         CALL  "COBW3_FREE"       USING  COBW3 .
000180
000190  EX-FINE-WEB.
000200         EXIT.
000550
000560
000570  VIS-MESS.
000580
000590          MOVE MESSAGGIO      TO VALUE-WEB.
000600          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000610          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000620
000630          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000640          MOVE "MK-TITLE"     TO FIELD-WEB.
000650          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000660
000670          MOVE SECTION-WEB    TO VALUE-WEB.
000680          MOVE "MK-KEY"       TO FIELD-WEB.
000690          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000700
000710
000720			MOVE "GOBACK"		TO NOME-VIEW.
000730			PERFORM LEGGO-VIEW	THRU EX-LEGGO-VIEW.
000740			IF ESITO-NOK MOVE SPACES TO STRINGA-VIEW.
000750
000760          MOVE STRINGA-VIEW   TO VALUE-WEB.
000770          MOVE "MK-BACK"      TO FIELD-WEB.
000780          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000810
000820          MOVE "TEMPLATE/MESSAGE.HTM"  TO PAGE-WEB.
000830          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000840          MOVE SPACES         TO MESSAGGIO.

000850  EX-VIS-MESS.
000860          EXIT.
000870
000880  VIS-MENU.
000890
000900          MOVE MESSAGGIO      TO VALUE-WEB.
000910          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000920          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000930
000940          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000950          MOVE "MK-TITLE"     TO FIELD-WEB.
000960          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000970
000980          MOVE SECTION-WEB    TO VALUE-WEB.
000990          MOVE "MK-KEY"       TO FIELD-WEB.
001000          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001010
001020
001030          MOVE "TEMPLATE/GOMENU.HTM"  TO PAGE-WEB.
001040          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001050
001060  EX-VIS-MENU.
001070          EXIT.
001080
001090  VIS-LOGIN.
001100
001110          move spaces to messaggio
001120
001130          string "Utente non presente o sessione di lavoro"
001140           " scaduta  - e' necessario effettuare "
001150           " la login" DELIMITED BY SIZE INTO messaggio
001160          MOVE MESSAGGIO      TO VALUE-WEB.
001170          MOVE "MK-MESSAGE"   TO FIELD-WEB.
001180          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001190
001200          MOVE "SEGNALAZIONE" TO VALUE-WEB.
001210          MOVE "MK-TITLE"     TO FIELD-WEB.
001220          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001230
001240
001250
001260          MOVE "TEMPLATE/GOLOGIN.HTM"    TO PAGE-WEB.
001270          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001280
001290  EX-VIS-LOGIN.
001300          EXIT.
001310
001320
001330  METTI-WEB.
001340
001350          MOVE FIELD-WEB    TO COBW3-CNV-NAME.
001360          MOVE VALUE-WEB    TO COBW3-CNV-VALUE.
001370          MOVE ZEROS        TO COBW3-CNV-NAME-LENGTH.
001380          MOVE ZEROS        TO COBW3-CNV-VALUE-LENGTH.
001390          CALL "COBW3_CNV_SET" USING COBW3.
001400          MOVE SPACES       TO COBW3-CNV-VALUE.
001410
001420  EX-METTI-WEB.
001430          EXIT.
001440
001450
001460  SHOW-WEB.
001470
001480          MOVE PAGE-WEB     TO COBW3-HTML-FILENAME.
001490          CALL "COBW3_PUT_HTML" USING COBW3.
001500
001510  EX-SHOW-WEB.
001520          EXIT.
001530
001540  LINE-WEB.
001550
001560          IF DATI-WEB > SPACES
001570          MOVE DATI-WEB       TO     COBW3-PUT-STRING
001580          MOVE ZEROS          TO     COBW3-PUT-STRING-LENGTH
001590          CALL  "COBW3_PUT_TEXT"   USING  COBW3
001600
001610          MOVE SPACES             TO DATI-WEB.
001620
001630  EX-LINE-WEB.
001640          EXIT.
001650
001660
001670  READ-WEB.
001680
001690        IF INDEX-WEB NOT > 1
001700          MOVE 1          TO  COBW3-NUMBER
001710         ELSE
001720          MOVE INDEX-WEB TO  COBW3-NUMBER.
001730
001740        MOVE FIELD-WEB   TO  COBW3-SEARCH-DATA
001750        CALL "COBW3_NAME" USING COBW3
001760        MOVE COBW3-GET-DATA (1:COBW3-GET-LENGTH) TO VALUE-WEB.
001770
001780        IF  COBW3-SEARCH-FLAG-EXIST
001790         SET ON-WEB TO TRUE
001800         ELSE
001810         SET OFF-WEB TO TRUE.
001820
001830         IF VALUE-WEB(1:2) NUMERIC
001840          AND VALUE-WEB(3:1) = "/"
001850           AND VALUE-WEB(4:2) NUMERIC
001860            AND VALUE-WEB(6:1) = "/"
001870             AND VALUE-WEB(7:4) NUMERIC
001880
001890             MOVE VALUE-WEB(1:2) TO GG-WEB
001900             MOVE VALUE-WEB(4:2) TO MM-WEB
001910             MOVE VALUE-WEB(7:4) TO AA-WEB
001920              ELSE
001930              INITIALIZE DATA-WEB.
001940
001950
001960          PERFORM ALFA-TO-NUM-WEB THRU EX-ALFA-TO-NUM-WEB.
001970
001980
001990  EX-READ-WEB.
002000          EXIT.
002010
002020  MAKE-WEB.
002030
2030            CALL "MAKEFORM" USING COBW3
                CANCEL "MAKEFORM".
002090
002100  EX-MAKE-WEB.
002110          EXIT.
002120
002130
002140  ESEGUI-WEB.
002150*
002160**** mettere il comando in COBW3-SYSTEMINFO.
002170*
002180          CALL "COBW3_SYSTEM" USING COBW3.
002190          MOVE SPACES       TO COBW3-SYSTEMINFO.

				IF COBW3-STATUS = 1
				STRING "Errore esecuzione " COBW3-SYSTEMINFO
				 DELIMITED BY SIZE INTO MESSAGGIO
				  PERFORM VIS-MESS THRU EX-VIS-MESS.
002200
002210  EX-ESEGUI-WEB.
002220          EXIT.
002230
002240
002250  SHA-WEB.
002260
002270			MOVE SPACES TO COBW3-SYSTEMINFO.
002280
002290          STRING 'openSSL passwd -salt x ' DELIMITED BY SIZE
002300          FIELD-WEB DELIMITED BY "   "
002310          " > /temp/SHA" DELIMITED BY SIZE 
002320           SECTION-WEB ".log" 
002330            DELIMITED BY SIZE INTO COBW3-SYSTEMINFO.
002340			 
002350          PERFORM ESEGUI-WEB 	  THRU EX-ESEGUI-WEB.
002360
002370			CALL "SAVESHA3" USING SECTION-WEB
002380			 RETURNING VALUE-WEB.
002390
002400			CANCEL "SAVESHA3".
002410
002420
002430  EX-SHA-WEB.
002440			EXIT.
002450
002460  CALL-WEB.
002470
002480          CALL "POWEROPENSHEET" USING PROGRAMMA-WEB
002490                                      LIBRERIA-WEB
002500                          RETURNING RITORNO-WEB.
002510
002520
002530  EX-CALL-WEB.
002540          EXIT.
002550
006440
006450  ALFA-TO-NUM-WEB.
006460
006470
006480          MOVE ALL ZEROS          TO TAB-NUMERO-WEB.
006490
006500          MOVE 18                 TO IND3-WEB
006510          PERFORM VARYING IND2-WEB FROM 18 BY -1 UNTIL IND2-WEB = ZERO
006520
006530          IF VALUE-WEB(IND2-WEB:1) NUMERIC
006540          MOVE  VALUE-WEB(IND2-WEB:1)   TO TAB-NUMERO-WEB(IND3-WEB:1)
006550          SUBTRACT 1 FROM IND3-WEB
006560          END-IF
006570
006580          END-PERFORM.
006590
006600          MOVE TAB-NUMERO-WEB     TO NUMERO-WEB.
006610
006620
006630  EX-ALFA-TO-NUM-WEB.
006640          EXIT.
