000010  INIZIO-WEB.
000020
000021		 PERFORM START-WEB		THRU EX-START-WEB.
000022
000122		 COPY "INIZIALI.CBL".
000123
000130  EX-INIZIO-WEB.
000140         EXIT.
000150
000151  START-WEB.
000152
000153
000154		 MOVE LOW-VALUE			 TO COBW3.
000155		
000156       CALL  "COBW3_INIT"      USING  COBW3 .
000157
000158* SET the CONTENT-TYPE to HTML
000159        SET COBW3-CONTENT-TYPE-HTML TO TRUE .
000160
000161* COMMENTARE PER DISATTIVARE IL DEBUG NATIVO
000162*       MOVE "1"             TO COBW3-DMODE.
000163
000166
000167  EX-START-WEB.
000168		   EXIT.
000169
000170
000171  FINE-WEB.
000180
000190         CALL  "COBW3_FREE"       USING  COBW3 .
000200
000210  EX-FINE-WEB.
000220         EXIT.
000230
000240
000250  VIS-MESS.
000260
000270          MOVE MESSAGGIO      TO VALUE-WEB.
000280          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000290          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000300
000310          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000320          MOVE "MK-TITLE"     TO FIELD-WEB.
000330          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000340
000350          MOVE SECTION-WEB    TO VALUE-WEB.
000360          MOVE "MK-KEY"       TO FIELD-WEB.
000370          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000380
000390
000400			MOVE "GOBACK"		TO NOME-VIEW.
000410			PERFORM LEGGO-VIEW	THRU EX-LEGGO-VIEW.
000420			IF ESITO-NOK MOVE SPACES TO STRINGA-VIEW.
000430
000440          MOVE STRINGA-VIEW   TO VALUE-WEB.
000450          MOVE "MK-BACK"      TO FIELD-WEB.
000460          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000470
000480          MOVE "TEMPLATE/MESSAGE.HTM"  TO PAGE-WEB.
000490          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000500          MOVE SPACES         TO MESSAGGIO.
000510
000520  EX-VIS-MESS.
000530          EXIT.
000540
000550  VIS-MENU.
000560
000570          MOVE MESSAGGIO      TO VALUE-WEB.
000580          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000590          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000600
000610          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000620          MOVE "MK-TITLE"     TO FIELD-WEB.
000630          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000640
000650          MOVE SECTION-WEB    TO VALUE-WEB.
000660          MOVE "MK-KEY"       TO FIELD-WEB.
000670          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000680
000690
000700          MOVE "TEMPLATE/GOMENU.HTM"  TO PAGE-WEB.
000710          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000720
000730  EX-VIS-MENU.
000740          EXIT.
000750
000760  VIS-LOGIN.
000770
000780          move spaces to messaggio
000790
000800          string "Utente non presente o sessione di lavoro"
000810           " scaduta  - e' necessario effettuare "
000820           " la login" DELIMITED BY SIZE INTO messaggio
000830          MOVE MESSAGGIO      TO VALUE-WEB.
000840          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000850          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000860
000870          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000880          MOVE "MK-TITLE"     TO FIELD-WEB.
000890          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000900
000910
000920	
000930          MOVE "TEMPLATE/GOLOGIN.HTM"    TO PAGE-WEB.
000940          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000950
000960  EX-VIS-LOGIN.
000970          EXIT.
000980
000990
001000  METTI-WEB.
001010
001020          MOVE FIELD-WEB    TO COBW3-CNV-NAME.
001030          MOVE VALUE-WEB    TO COBW3-CNV-VALUE.
001040          MOVE ZEROS        TO COBW3-CNV-NAME-LENGTH.
001050          MOVE ZEROS        TO COBW3-CNV-VALUE-LENGTH.
001060          CALL "COBW3_CNV_SET" USING COBW3.
001070          MOVE SPACES       TO COBW3-CNV-VALUE.
001080
001090  EX-METTI-WEB.
001100          EXIT.
001110
001120
001130  SHOW-WEB.
001140
001150          MOVE PAGE-WEB     TO COBW3-HTML-FILENAME.
001160          CALL "COBW3_PUT_HTML" USING COBW3.
001170
001180  EX-SHOW-WEB.
001190          EXIT.
001200
001210  LINE-WEB.
001220
001230          IF DATI-WEB > SPACES
001240          MOVE DATI-WEB       TO     COBW3-PUT-STRING
001250          MOVE ZEROS          TO     COBW3-PUT-STRING-LENGTH
001260          CALL  "COBW3_PUT_TEXT"   USING  COBW3
001270
001280          MOVE SPACES             TO DATI-WEB.
001290
001300  EX-LINE-WEB.
001310          EXIT.
001320
001330
001340  READ-WEB.
001350
001360        IF INDEX-WEB NOT > 1
001370          MOVE 1          TO  COBW3-NUMBER
001380         ELSE
001390          MOVE INDEX-WEB TO  COBW3-NUMBER.
001400
001410        move SPACES      TO VALUE-WEB.
001420
001430        MOVE FIELD-WEB   TO  COBW3-SEARCH-DATA
001440        CALL "COBW3_NAME" USING COBW3
001450
001460        IF  COBW3-SEARCH-FLAG-EXIST
001470        MOVE COBW3-GET-DATA (1:COBW3-GET-LENGTH) TO VALUE-WEB.
001480
001490        IF  COBW3-SEARCH-FLAG-EXIST
001500         SET ON-WEB TO TRUE
001510         ELSE
001520         SET OFF-WEB TO TRUE.
001530
001540         IF VALUE-WEB(1:2) NUMERIC
001550          AND VALUE-WEB(3:1) = "/"
001560           AND VALUE-WEB(4:2) NUMERIC
001570            AND VALUE-WEB(6:1) = "/"
001580             AND VALUE-WEB(7:4) NUMERIC
001590
001600             MOVE VALUE-WEB(1:2) TO GG-WEB
001610             MOVE VALUE-WEB(4:2) TO MM-WEB
001620             MOVE VALUE-WEB(7:4) TO AA-WEB
001630              ELSE
001640              INITIALIZE DATA-WEB.
001650
001660
001670          PERFORM ALFA-TO-NUM-WEB THRU EX-ALFA-TO-NUM-WEB.
001680
001690
001700  EX-READ-WEB.
001710          EXIT.
001720
001730  MAKE-WEB.
001740
001750
001760          CALL "MAKEFORM" USING COBW3
001770          CANCEL "MAKEFORM".
001780
001790
001800			MOVE FILE-WEB			TO STRINGA-VIEW
001810			MOVE SPACES				TO NOME-VIEW
001820			STRING MODULO-WEB ENTITA-WEB FUNZIONE-WEB
001830				DELIMITED BY SIZE INTO NOME-VIEW
001840		 
001850			PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW .
001860
001870			MOVE PAGE-WEB			TO STRINGA-VIEW.
001880			MOVE "MODULO"			TO NOME-VIEW.
001890			PERFORM LEGGO-VIEW		THRU EX-LEGGO-VIEW
001900			
001910			IF ESITO-NOK
001920			MOVE  MODULO-WEB 		TO STRINGA-VIEW
001930			PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW .
001940
001950
001960
001970  EX-MAKE-WEB.
001980          EXIT.
001990
002000
002010  ESEGUI-WEB.
002020*
002030**** mettere il comando in COBW3-SYSTEMINFO.
002040*
002050          CALL "COBW3_SYSTEM" USING COBW3.
002060          MOVE SPACES       TO COBW3-SYSTEMINFO.
002070
002080			IF COBW3-STATUS = 1
002090			STRING "Errore esecuzione " COBW3-SYSTEMINFO
002100			 DELIMITED BY SIZE INTO MESSAGGIO
002110			  PERFORM VIS-MESS THRU EX-VIS-MESS.
002120
002130  EX-ESEGUI-WEB.
002140          EXIT.
002150
002160
002170  SHA-WEB.
002180
002190			MOVE SPACES TO COBW3-SYSTEMINFO.
002200
002210          STRING 'openSSL passwd -salt x ' DELIMITED BY SIZE
002220          FIELD-WEB DELIMITED BY "   "
002230          " > /temp/SHA" DELIMITED BY SIZE 
002240           SECTION-WEB ".log" 
002250            DELIMITED BY SIZE INTO COBW3-SYSTEMINFO.
002260			 
002270          PERFORM ESEGUI-WEB 	  THRU EX-ESEGUI-WEB.
002280
002290			CALL "SAVESHA3" USING SECTION-WEB
002300			 RETURNING VALUE-WEB.
002310
002320			CANCEL "SAVESHA3".
002330
002340
002350  EX-SHA-WEB.
002360			EXIT.
002370
002380  CALL-WEB.
002390
002400          CALL "POWEROPENSHEET" USING PROGRAMMA-WEB
002410                                      LIBRERIA-WEB
002420                          RETURNING RITORNO-WEB.
002430
002440
002450  EX-CALL-WEB.
002460          EXIT.
002470
002480
002490  ALFA-TO-NUM-WEB.
002500
002510          IF VALUE-WEB = SPACES 
002520            MOVE ZERO             TO NUMERO-WEB
002530             GO TO EX-ALFA-TO-NUM-WEB.
002540
002550          MOVE ALL ZEROS          TO TAB-NUMERO-WEB.
002560
002570          MOVE 18                 TO IND3-WEB
002580          PERFORM VARYING IND2-WEB FROM 18 BY -1 UNTIL IND2-WEB = ZERO
002590
002600          IF VALUE-WEB(IND2-WEB:1) NUMERIC
002610          MOVE  VALUE-WEB(IND2-WEB:1)   TO TAB-NUMERO-WEB(IND3-WEB:1)
002620          SUBTRACT 1 FROM IND3-WEB
002630          END-IF
002640
002650          END-PERFORM.
002660
002670          MOVE TAB-NUMERO-WEB     TO NUMERO-WEB.
002680
002690
002700  EX-ALFA-TO-NUM-WEB.
002710          EXIT.
