000010*
000020* CAMPI DI WORKING COMUNI ALLA MAGGIOR PARTE
000030* DEI PROGRAMMI
000040*
000050  01 MESSAGGIO         PIC X(256).
000060  01 TITOLO            PIC X(256).
000070  01 COMANDO-RUN       PIC X(200).
000080  01 FINESTRA-RUN      PIC S9(4) COMP-5.
000090  01 TIPO-RUN          PIC S9(4) COMP-5.
000100  01 RITORNO-RUN       PIC s9(9) COMP-5.
000110  01 SW-LAVORO             PIC X(20) VALUE SPACES.
000120  01 VIS-DATA          GLOBAL.
000130    02 GG-VIS          PIC 99.
000140    02 MM-VIS          PIC 99.
000150    02 AA-VIS          PIC 9999.
000160  01 CONTA                         PIC 9(9)  VALUE ZEROS.
000170  01 CONTA1                        PIC 9(9)  VALUE ZEROS.
000171  01 SW-DATA           PIC 9      VALUE ZEROS GLOBAL.
000180  01 ANNO-ESTESO       PIC 9(4)   VALUE ZEROS GLOBAL.
000190  01 MESE-RIFERIMENTO  PIC 99     GLOBAL.
000200      88 MESE-RIFERIMENTO-OK VALUE 1 THRU 12.
000210
000220*
000230  01 DATA-NORMALE GLOBAL.
000240     05 GG-NORMALE     PIC 99.
000250     05 MM-NORMALE     PIC 99.
000260     05 AA-NORMALE     PIC 9999.
000270
000280  01 GIORNO-NORMALE    PIC 9 GLOBAL.
000290       88 FERIALE      VALUE 1 THRU 6.
000300       88 SABATO       VALUE 6.
000310       88 DOMENICA     VALUE 7.
000320
000330  01 DATA-GIRATA GLOBAL.
000340     02 AA-GIRATA      PIC 9999.
000350     02 MM-GIRATA      PIC 99.
000360     02 GG-GIRATA      PIC 99.
000370
000380  01 TIME-SYS GLOBAL.
000390     05 ORA-SYS        PIC 99.
000400     05 MIN-SYS        PIC 99.
000410     05 SEC-SYS        PIC 99.
000420     05 MIC-SYS        PIC 99.
000430
000440  01 DATA-SYS GLOBAL.
000450     05 AA-SYS         PIC 99.
000460     05 MM-SYS         PIC 99.
000470     05 GG-SYS         PIC 99.
000480
000490  01 VIS-ORA GLOBAL.
000500     05 VIS-H          PIC Z9.
000510     05 FILLER         PIC X VALUE ":".
000520     05 VIS-M          PIC 99.
000530
000540
000550  01 CARICA-TABELLA-SETTIMANA IS GLOBAL.
000560          02 FILLER  PIC X(09) VALUE "LUNEDI".
000570          02 FILLER  PIC X(09) VALUE "MARTEDI".
000580          02 FILLER  PIC X(09) VALUE "MERCOLEDI".
000590          02 FILLER  PIC X(09) VALUE "GIOVEDI".
000600          02 FILLER  PIC X(09) VALUE "VENERDI".
000610          02 FILLER  PIC X(09) VALUE "SABATO".
000620          02 FILLER  PIC X(09) VALUE "DOMENICA".
000630
000640  01 TABELLA-SETTIMANA REDEFINES CARICA-TABELLA-SETTIMANA
000650                       IS GLOBAL.
000660          02 GIORNO-SETTIMANA PIC X(09) OCCURS 7 TIMES.
000670
000680  01 CARICA-TABELLA-MESI IS GLOBAL.
000690          02      FILLER  PIC X(11) VALUE "GENNAIO  31".
000700          02      FILLER  PIC X(11) VALUE "FEBBRAIO 28".
000710          02      FILLER  PIC X(11) VALUE "MARZO    31".
000720          02      FILLER  PIC X(11) VALUE "APRILE   30".
000730          02      FILLER  PIC X(11) VALUE "MAGGIO   31".
000740          02      FILLER  PIC X(11) VALUE "GIUGNO   30".
000750          02      FILLER  PIC X(11) VALUE "LUGLIO   31".
000760          02      FILLER  PIC X(11) VALUE "AGOSTO   31".
000770          02      FILLER  PIC X(11) VALUE "SETTEMBRE30".
000780          02      FILLER  PIC X(11) VALUE "OTTOBRE  31".
000790          02      FILLER  PIC X(11) VALUE "NOVEMBRE 30".
000800          02      FILLER  PIC X(11) VALUE "DICEMBRE 31".
000810
000820  01 TABELLA-MESI REDEFINES CARICA-TABELLA-MESI
000830                       IS GLOBAL.
000840          02      LIVELLO-MESI     OCCURS 12 TIMES.
000850           05     MESE-IN-CORSO    PIC X(09).
000860           05     NUM-GG-MESE      PIC 99.
000870  01 GIORNO-SETT                   PIC 9 IS GLOBAL.
000880
000890  01 TAB-STRINGA                   PIC X(20).
000900  01 SIZE-STRINGA					 PIC 9999.
000900
000910  01 DA                            PIC 999999.
000920  01 A                             PIC 999999.
000930  01 TEMPO                         PIC 99.
000940
000950  01 PARAMETRI-TRASCOD IS GLOBAL.
000960    02 NUMERO-TRASCOD              PIC 9(12).
000970    02 CIFRA-TRASCOD               PIC X(100).
000980
000990  01 W-TABELLA-ORARI IS GLOBAL.
001000     02 ORARIO-INI.
001010       09 ORA-INI                  PIC 99.
001020       09 MIN-INI                  PIC 99.
001030     02 ORE-INI REDEFINES ORARIO-INI PIC 9(4).
001040     02 ORARIO-FIN.
001050       09 ORA-FIN                  PIC 99.
001060       09 MIN-FIN                  PIC 99.
001070     02 ORE-FIN REDEFINES ORARIO-FIN PIC 9(4).
001080     02 ORARIO-DUR.
001090       09 ORA-DUR                  PIC 99.
001100       09 MIN-DUR                  PIC 99.
001110     02 ORE-DUR REDEFINES ORARIO-DUR PIC 9(4).
001120     02 ORARIO-TOT.
001130       09 ORA-TOT                  PIC 9999.
001140       09 MIN-TOT                  PIC 99.
001150     02 ORE-TOT REDEFINES ORARIO-TOT PIC 9(6).
001160
001170     02 W-INIZIO                   PIC S9(9) COMP-5.
001180     02 W-FINE                     PIC S9(9) COMP-5.
001190     02 W-DURATA                   PIC S9(9) COMP-5.
001200
001210*** GLOBAL EXTERNAL.
001220
001230 01 AREA-GLOBAL-EXTERNAL  IS GLOBAL EXTERNAL.

001250   07 PAGE-WEB            PIC X(256).
001260
001270   07 SECTION-WEB.
001280    09 DATA-SECTION-WEB.
001290     12 AA-SECTION-WEB    PIC 9999.
001300     12 MM-SECTION-WEB    PIC 99.
001310     12 GG-SECTION-WEB    PIC 99.
001320    09 TIME-SECTION-WEB.
001330     12 ORE-SECTION-WEB   PIC 99.
001340     12 MIN-SECTION-WEB   PIC 99.
001350     12 SEC-SECTION-WEB   PIC 9999.
001360
001370   07 PROCEDURA-WEB       PIC XX.
001380   07 MODULO-WEB          PIC XX.
001390   07 ENTITA-WEB          PIC XX.
001400   07 FUNZIONE-WEB        PIC XX.
001410   07 PATH-WEB            PIC X(256).
001420   07 I-WEB               PIC 9(7).
001430   07 UTENTE-WEB          PIC X(30).
		 07 PROG-DIP-WEB		PIC 9(7).
		 07 ADMIN-WEB			PIC X.
		 07 TIZIO-WEB			PIC X(50).
001440
001450*
001460* campo di appoggio chiamata liste file tabelle
001470*
001480 01 DATI-GLOBALI IS GLOBAL.
001490*
520       07 WMAXJSON           PIC 9(3)  VALUE ZEROS.
001510    07 LOCK-STATUS        PIC XX    VALUE "99".
001520
001530    07 ANNO-FILE.
001540      08 PRIMA-CIFRA      PIC 9.
001550      08 ANNO-EST         PIC 999.
001560
001570   07 FINE-FILE           PIC XX    VALUE ALL SPACES.
001580   07 ESITO               PIC XX    VALUE ALL SPACES.
001590    88 ESITO-OK           VALUE "SI".
001600    88 ESITO-NOK          VALUE "NO".
001610
001620
001630   07 FLAG-WEB            PIC X.
001640    88 OPENED-WEB         VALUE "O".
001650
001660   07 EOF-WEB             PIC X.
001670    88 EOF-FILE-WEB       VALUE "Y".
001680
001690   07 ON-OFF-WEB          PIC X.
001700    88 ON-WEB             VALUE "Y".
001710    88 OFF-WEB            VALUE "N".
001720
001730
001740
001750
001760   07 FILE-LIB            PIC X(256) VALUE SPACE.
001770   07 STATUS-LIB          PIC XX.
001780   07 FILE-HTM            PIC X(256) VALUE SPACE.
001790   07 STATUS-HTM          PIC XX.
001800   07 FILE-LOG            PIC X(256) VALUE SPACE.
001810   07 STATUS-LOG          PIC XX.
001820
001830
001840   07 FLAG-LIB            PIC X.
001850    88 OPENED-LIB         VALUE "O".
001860
001870   07 EOF-LIB             PIC X.
001880    88 EOF-FILE-LIB       VALUE "Y".
001890
001900   07 ON-OFF-LIB          PIC X.
001910    88 ON-LIB             VALUE "Y".
001920    88 OFF-LIB            VALUE "N".
001930
001940   07 BUFFER              PIC X(2048).
001950   07 BUFFER1             PIC X(2048).
001960   07 ARGUMENT            PIC X(2048).
001970   07 USE-ARGUMENT        PIC X.
001980   07 FILE-WEB            PIC X(256) VALUE SPACE.
001990   07 STATUS-WEB          PIC XX.
002000   07 FIELD-WEB           PIC X(30)  VALUE SPACE.
002010   07 INDEX-WEB           PIC 9(9)   VALUE ZEROS.
002020   07 VALUE-WEB           PIC X(1024) VALUE SPACE.
002030   07 LIBRERIA-WEB        PIC X(256)  VALUE SPACE.
002040   07 PROGRAMMA-WEB       PIC X(256)  VALUE SPACE.
002050   07 RITORNO-WEB         PIC S9(4)   COMP-5.
002060   07 SECTION-NOW.
002070    09 DATA-SECTION-NOW.
002080     12 AA-SECTION-NOW    PIC 9999.
002090     12 MM-SECTION-NOW    PIC 99.
002100     12 GG-SECTION-NOW    PIC 99.
002110    09 TIME-SECTION-NOW.
002120     12 ORE-SECTION-NOW   PIC 99.
002130     12 MIN-SECTION-NOW   PIC 99.
002140     12 SEC-SECTION-NOW   PIC 9999.
002150
002160
002170   07 ORARIO-WEB.
002180
002190    08 DATA-WEB.
002200     09 AA-WEB            PIC 9999.
002210     09 MM-WEB            PIC 99.
002220     09 GG-WEB            PIC 99.
002230    08 MINUTI-WEB         PIC 9(9).
002240
002250   07 NUMERO-WEB          PIC 9(18).
002260   07 IMPORTO-WEB         PIC S9(12)V99.
002270   07 TAB-NUMERO-WEB      PIC 9(18).
002280   07 AZZERA-WEB          PIC XX      VALUE SPACE.
002290   07 PASSWORD-WEB        PIC X(100)  VALUE SPACE.
002300   07 IND-WEB             PIC 9(9)    VALUE ZERO.
002310   07 IND1-WEB            PIC 9(9)    VALUE ZERO.
002320   07 IND2-WEB            PIC 9(9)    VALUE ZERO.
002330   07 IND3-WEB            PIC 9(9)    VALUE ZERO.
002340   07 IND4-WEB            PIC 9(9)    VALUE ZERO.
002350   07 IND5-WEB            PIC 9(9)    VALUE ZERO.
002351   07 SIZE-WEB            PIC 9(9)    VALUE ZERO.
002360   07 POS-WEB             PIC 9(9)    VALUE ZERO.
002370   07 SIGLA-WEB           PIC X(10)   VALUE SPACE.
002380   07 TIPO-WEB            PIC XX      VALUE SPACE.
002390
002400   07 IND-LIB             PIC 99999   VALUE ZERO.
002410   07 IND1-LIB            PIC 99999   VALUE ZERO.
002420   07 IND2-LIB            PIC 99999   VALUE ZEROS.
002430   07 FILE-UTEN           PIC X(256)  VALUE SPACE.
002440   07 STATUS-UTEN         PIC XX      VALUE "00".
002450   07 FILE-VIEW           PIC X(256)  VALUE SPACE.
002460   07 STATUS-VIEW         PIC XX      VALUE "00".
002470   07 FILE-TAB            PIC X(256)  VALUE SPACE.
002480   07 STATUS-TAB          PIC XX      VALUE "00".
002490   07 FILE-MENU           PIC X(256)  VALUE SPACE.
002500   07 STATUS-MENU         PIC XX      VALUE "00".
002510   07 FILE-ABI            PIC X(256)  VALUE SPACE.
002520   07 STATUS-ABI          PIC XX      VALUE "00".
002530   07 FILE-PROF           PIC X(256)  VALUE SPACE.
002540   07 STATUS-PROF         PIC XX      VALUE "00".
002550   07 FILE-PRES           PIC X(256)  VALUE SPACE.
002560   07 STATUS-PRES         PIC XX      VALUE "00".
002570   07 FILE-ORIG           PIC X(256)  VALUE SPACE.
002580   07 STATUS-ORIG         PIC XX      VALUE "00".
002590   07 FILE-CAUS           PIC X(256)  VALUE SPACE.
002600   07 STATUS-CAUS         PIC XX      VALUE "00".
002610   07 FILE-CART           PIC X(256)  VALUE SPACE.
002620   07 STATUS-CART         PIC XX      VALUE "00".
002630   07 FILE-CALC           PIC X(256)  VALUE SPACE.
002640   07 STATUS-CALC         PIC XX      VALUE "00".
002650   07 FILE-ELAB           PIC X(256)  VALUE SPACE.
002660   07 STATUS-ELAB         PIC XX      VALUE "00".
002670   07 FILE-MESE           PIC X(256)  VALUE SPACE.
002680   07 STATUS-MESE         PIC XX      VALUE "00".
002690   07 FILE-ANNO           PIC X(256)  VALUE SPACE.
002700   07 STATUS-ANNO         PIC XX      VALUE "00".
002710   07 FILE-JSON           PIC X(256)  VALUE SPACE.
002720   07 STATUS-JSON         PIC XX      VALUE "00".
002730   07 NOME-JSON           PIC X(256)  VALUE SPACES.
002740   07 FILE-DATO           PIC X(256)  VALUE SPACE.
002750   07 STATUS-DATO         PIC XX      VALUE "00".
002760   07 FILE-ORA            PIC X(256)  VALUE SPACE.
002770   07 STATUS-ORA          PIC XX      VALUE "00".
002780   07 FILE-MATR           PIC X(256)  VALUE SPACE.
002790   07 STATUS-MATR         PIC XX      VALUE "00".
002800   07 FILE-IND            PIC X(256)  VALUE SPACE.
002810   07 STATUS-IND          PIC XX      VALUE "00".
002800   07 FILE-FER            PIC X(256)  VALUE SPACE.
002810   07 STATUS-FER          PIC XX      VALUE "00".
002800   07 FILE-GIU            PIC X(256)  VALUE SPACE.
002810   07 STATUS-GIU          PIC XX      VALUE "00".
002800   07 FILE-RESO           PIC X(256)  VALUE SPACE.
002810   07 STATUS-RESO         PIC XX      VALUE "00".
002800   07 FILE-SALD           PIC X(256)  VALUE SPACE.
002810   07 STATUS-SALD         PIC XX      VALUE "00".
002800   07 FILE-CALC           PIC X(256)  VALUE SPACE.
002810   07 STATUS-CALC         PIC XX      VALUE "00".
002800   07 FILE-SCAD           PIC X(256)  VALUE SPACE.
002810   07 STATUS-SCAD         PIC XX      VALUE "00".
002800   07 FILE-AUT            PIC X(256)  VALUE SPACE.
002810   07 STATUS-AUT          PIC XX      VALUE "00".
002820
002830
002840***** CAMPI GENERICI
002850   77 IND                 PIC 9(9)    VALUE ZERO.
002860   77 DUMMY               PIC X       VALUE SPACE.
002870
002880
002890
002900
002910   77 REC-DAT             PIC X(512).
002920   77 SIZE-DAT            PIC 9999.
002930
002940   77 DEP-MOD             PIC XX.
002950   77 FLAG-TIME           PIC X.
002960      88 FIRST-TIME       VALUE "Y".
002970   77 FLAG-DISABLED       PIC X.
002980      88 DISABLED         VALUE "Y".
002990
003000   77 WDISABLE            PIC X(100).
003010   77 WIMAGES             PIC X(100).
003011   77 WTIPO				PIC XX.
003012   77 WELEMENTO			PIC X(6).
003013   77 WDESC				PIC X(35).
003014   77 WIND				PIC 999.
003015
003016   77 WNOME				PIC X(10).
003017	 77 WDOVE				PIC X(256).
003018	 77 WFILE				PIC X(256).
003020
0030     77 WMAXSIZE            PIC 9999.
003530   01 JSON.
			02 DATI-JSON		PIC X(512).

