000010*
000020  OPEN-I-MENU.
000030
000040          PERFORM PREPARA-MENU THRU EX-PREPARA-MENU.
000050
000060          MOVE ZEROS      TO STATUS-MENU.
000070
000080          OPEN INPUT ARKMENU.
000090
000100          IF STATUS-MENU = "35"
000110           OPEN OUTPUT ARKMENU
000120           CLOSE ARKMENU

000100          IF STATUS-MENU = "39"
000510          STRING "ERRORE APERTURA " DELIMITED BY SIZE
000520          FILE-MENU DELIMITED BY "   "
000530          " STATO:" STATUS-MENU
000540          DELIMITED BY  SIZE INTO MESSAGGIO
000550          PERFORM VIS-MESS        THRU EX-VIS-MESS
			    STOP RUN.
				
000150
000160          IF STATUS-MENU NOT = ZEROS
000170           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU
000180           CLOSE ARKMENU.
000190
000200          INITIALIZE MENU.
000210
000220  EX-OPEN-I-MENU.
000230          EXIT.
000240*
000250***
000260*
000270  OPEN-IO-MENU.
000280
000290          PERFORM PREPARA-MENU THRU EX-PREPARA-MENU.
000300
000310          MOVE ZEROS      TO STATUS-MENU.
000320
000330          OPEN I-O ARKMENU.
000340
000350          IF STATUS-MENU = "35"
000360           OPEN OUTPUT ARKMENU
000370           CLOSE ARKMENU
000380            GO TO OPEN-IO-MENU.

				IF STATUS-MENU = "39"
000510          STRING "ERRORE APERTURA " DELIMITED BY SIZE
000520          FILE-MENU DELIMITED BY "   "
000530          " STATO:" STATUS-MENU
000540          DELIMITED BY  SIZE INTO MESSAGGIO
000550          PERFORM VIS-MESS        THRU EX-VIS-MESS
			    STOP RUN.
				

000390
000400          IF STATUS-MENU NOT = ZEROS
000410           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU
000420           CLOSE ARKMENU.
000430
000440           INITIALIZE MENU.
000450
000460  EX-OPEN-IO-MENU.
000470          EXIT.
000480*
000490  ERRORE-MENU.
000500
000510          STRING "ERRORE SU " DELIMITED BY SIZE
000520          FILE-MENU DELIMITED BY "   "
000530          " STATO:" STATUS-MENU
000540          DELIMITED BY  SIZE INTO MESSAGGIO
000550          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000560
000570  EX-ERRORE-MENU.
000580          EXIT.
000590
000600*
000610***
000620*
000630  STARTO-MENU.
000640          MOVE "SI"       TO ESITO.
000650          START ARKMENU KEY IS NOT < CHIAVE-MENU
000660           INVALID KEY
000670           MOVE "NO"      TO ESITO.
000680  EX-STARTO-MENU.
000690          EXIT.
000700*
000710***
000720*
000730***
000740*
000750  LEGGO-NEXT-MENU.
000760          MOVE         "N"     TO FINE-FILE.
000770          READ ARKMENU NEXT RECORD  NO LOCK
000780           AT END MOVE "S"     TO FINE-FILE.
000790  EX-LEGGO-NEXT-MENU.
000800          EXIT.
000810*
000820***
000830*
000840  LEGGO-MENU.
000850
000860          MOVE "SI"       TO ESITO.
000870          READ ARKMENU KEY IS CHIAVE-MENU
000880           INVALID KEY
000890           MOVE "NO"      TO ESITO.
000900
000910          IF STATUS-MENU = LOCK-STATUS
000920           MOVE "Record in uso presso altro terminale"
000930            TO MESSAGGIO
000940            PERFORM VIS-MESS     THRU EX-VIS-MESS
000950             GO TO LEGGO-MENU.
000960
000970  EX-LEGGO-MENU.
000980          EXIT.
000990
001000  LEGGO-SEC-MENU.
001010
001020          MOVE "SI"       TO ESITO.
001030          READ ARKMENU NO LOCK KEY IS CHIAVE-SEC-MENU
001040           INVALID KEY
001050           MOVE "NO"      TO ESITO.
001060
001070          IF STATUS-MENU = LOCK-STATUS
001080           MOVE "Record in uso presso altro terminale"
001090            TO MESSAGGIO
001100            PERFORM VIS-MESS     THRU EX-VIS-MESS
001110             GO TO LEGGO-SEC-MENU.
001120
001130  EX-LEGGO-SEC-MENU.
001140          EXIT.
001150
001160
001170***
001180*
001190  SCRIVO-MENU.
001200
001210          MOVE "SI"       TO ESITO.
001220          WRITE MENU
001230           INVALID KEY
001240           MOVE "NO"      TO ESITO.
001250
001260          IF STATUS-MENU(1:1) > "2"
001270           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU.
001280  EX-SCRIVO-MENU.
001290          EXIT.
001300*
001310***
001320*
001330  AGGIORNO-MENU.
001340          MOVE "SI"       TO ESITO.
001350          REWRITE MENU
001360           INVALID KEY
001370           MOVE "NO"      TO ESITO.
001380
001390          IF STATUS-MENU(1:1) > "2"
001400           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU.
001410
001420  EX-AGGIORNO-MENU.
001430          EXIT.
001440*
001450***
001460*
001470  CANCELLO-MENU.
001480          MOVE "SI"       TO ESITO.
001490          DELETE ARKMENU
001500           INVALID KEY
001510           MOVE "NO"      TO ESITO.
001520
001530          IF STATUS-MENU(1:1) > "2"
001540           PERFORM ERRORE-MENU THRU EX-ERRORE-MENU.
001550
001560  EX-CANCELLO-MENU.
001570          EXIT.
001580
001590  CLOSE-MENU.
001600          CLOSE ARKMENU.
001610  EX-CLOSE-MENU.
001620          EXIT.
001630
001640
001650  PREPARA-MENU.
001660
001670
001751			MOVE "ARKMENU" 			TO WNOME
001752          PERFORM FAI-NOME        THRU EX-FAI-NOME.
001753  		MOVE WFILE				TO FILE-MENU.
001754
001755
001760  EX-PREPARA-MENU.
001770          EXIT.
001780
001790
001800  STARTO-DESC-MENU.
001810          MOVE "SI"       TO ESITO.
001820          START ARKMENU KEY IS NOT < DESC-MENU
001830           INVALID KEY
001840           MOVE "NO"      TO ESITO.
001850  EX-STARTO-DESC-MENU.
001860          EXIT.
001870
001880  STARTO-SEC-MENU.
001890          MOVE "SI"       TO ESITO.
001900          START ARKMENU KEY IS NOT < CHIAVE-SEC-MENU
001910           INVALID KEY
001920           MOVE "NO"      TO ESITO.
001930  EX-STARTO-SEC-MENU.
001940          EXIT.
001950
001960  LEGGO-TER-MENU.
001970
001980          MOVE "SI"       TO ESITO.
001990          READ ARKMENU NO LOCK KEY IS CHIAVE-TER-MENU
002000           INVALID KEY
002010           MOVE "NO"      TO ESITO.
002020
002030          IF STATUS-MENU = LOCK-STATUS
002040           MOVE "Record in uso presso altro terminale"
002050            TO MESSAGGIO
002060            PERFORM VIS-MESS     THRU EX-VIS-MESS
002070             GO TO LEGGO-TER-MENU.
002080
002090  EX-LEGGO-TER-MENU.
002100          EXIT.
002110
