000010
000020*
000030***********  INDENNITA'
000040*
000050          SELECT ARKIND ASSIGN TO FILE-IND
000060          ORGANIZATION IS INDEXED
000070          ACCESS MODE  IS DYNAMIC
000080          RECORD KEY   IS CHIAVE-IND OF INDENNITA
000090          LOCK MODE    IS AUTOMATIC WITH LOCK ON RECORD
000100          FILE STATUS  IS STATUS-IND.
000110*
000120***********
000130*
