000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200 IDENTIFICATION   DIVISION.
000210 PROGRAM-ID       COFIPA01.
000220 ENVIRONMENT      DIVISION.
000230 CONFIGURATION    SECTION.
000240
000250			COPY "SPECIAL.CBL".
000260
000270 INPUT-OUTPUT     SECTION.
000280 FILE-CONTROL.
000290
000300          COPY "SELWEB.CBL".
000310          COPY "SELVIEW.CBL".
000320          COPY "SELUTEN.CBL".
000330          COPY "S:\WINCOF\CBL\SELTAB.CBL".
000340
000350
000360
000370 DATA             DIVISION.
000380 FILE SECTION.
000390
000400          COPY "FDEWEB.CBL".
000410          COPY "FDEVIEW.CBL".
000420          COPY "FDEUTEN.CBL".
000430          COPY "S:\WINCOF\CBL\FDETAB.CBL".
000440
000450 WORKING-STORAGE  SECTION.
000460
000470          COPY "COBW3.CBL".
000480          COPY "GLOBALS.CBL".
000490          COPY "IMAGES.CBL".
000500*
000510
000520 PROCEDURE  DIVISION.
000530
000540 DECLARATIVES.
000550 ERROR-ARCHIVIO SECTION.
000560			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW ARKLOG.
000570 EX-ERRORE-ARCHIVIO.
000580			EXIT.
000590 END DECLARATIVES.
000600
000610
000620          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000630
000631          MOVE "PATH-FILE"    TO FIELD-WEB
000632          PERFORM READ-WEB    THRU EX-READ-WEB
000633
000634			IF VALUE-WEB = SPACES
000635			MOVE "FILES/"		TO PATH-WEB
000636			ELSE
000637			MOVE VALUE-WEB		TO PATH-WEB.
000638
000640
000641          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000650
000651			IF STATUS-UTEN NOT = "00"
000652			STRING "Errori accesso file utenti: " STATUS-UTEN
000653				DELIMITED BY SIZE INTO MESSAGGIO
000654				PERFORM VIS-MESS THRU EX-VIS-MESS
000655			  	GO TO FINE.
000656
000660          MOVE "MK-UTENTE"    TO FIELD-WEB
000670          PERFORM READ-WEB    THRU EX-READ-WEB
000680
000690          MOVE FUNCTION UPPER-CASE(VALUE-WEB)   TO NOME-UTEN
000700          MOVE VALUE-WEB	    TO NOME-UTEN
000710
000720          PERFORM LEGGO-UTEN  THRU EX-LEGGO-UTEN.
000730
000740          IF ESITO-NOK
000750		    INITIALIZE UTENTE
000760			ELSE
000770		 	PERFORM SESSIONE	THRU EX-SESSIONE.
000780 
000790          PERFORM OPEN-O-VIEW THRU EX-OPEN-O-VIEW.
000800
000810          PERFORM LOAD-VIEW   THRU EX-LOAD-VIEW.
000820          
000830
000840			MOVE "MK-PASSWORD"  TO FIELD-WEB
000850	        PERFORM READ-WEB    THRU EX-READ-WEB
000860
000870			MOVE VALUE-WEB      TO FIELD-WEB.
000880          PERFORM SHA-WEB     THRU EX-SHA-WEB.
000890          
000900
000910          MOVE VALUE-WEB      TO STRINGA-VIEW.
000920          MOVE "SHA3-WEB"     TO NOME-VIEW
000930          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
000940
000950          
000960          IF VALUE-WEB NOT = PASSWORD-UTEN
000970			OR PASSWORD-UTEN = SPACES
000980          MOVE "ERRORE LOGIN UTENTE" TO MESSAGGIO
000990          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
001000			GO TO FINE.
001010
001011**** SOLO openmenu e' dentro la cartella archivi dell'ente
001012
001013			MOVE SPACES		  TO PAGE-WEB.
001014              
001015			STRING PATH-WEB DELIMITED BY "  "
001016		
001020           "openmenu.htm"    DELIMITED BY SIZE INTO PAGE-WEB .
001030
001125
001126
001130          PERFORM MAKE-WEB    THRU EX-MAKE-WEB.
001140
001150
001160 FINE.
001170
001180          PERFORM CLOSE-VIEW  THRU EX-CLOSE-VIEW.
001190
001200          PERFORM CLOSE-UTEN  THRU EX-CLOSE-UTEN.
001210
001220
001230          PERFORM FINE-WEB    THRU EX-FINE-WEB.
001240
001250          GOBACK.
001260
001270          COPY "PIOWEB1.CBL".
001280          COPY "PIOUTEN.CBL".
001290          COPY "PIOVIEW.CBL".
001300          COPY "PIOTAB.CBL".
001310
001320 
001330 LOAD-VIEW.
001340
001341          MOVE PATH-WEB       TO STRINGA-VIEW.
001342          MOVE "PATH-FILE"    TO NOME-VIEW
001343          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001344
001345
001350          MOVE SPACES TO STRINGA-VIEW.
001360          DISPLAY "REMOTE_ADDR" UPON ENV-NAME
001370          ACCEPT STRINGA-VIEW   FROM ENV-VALUE
001380          ON EXCEPTION CONTINUE
001390          END-ACCEPT.
001400
001410          MOVE "REMOTE-IP"       TO NOME-VIEW
001420          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001430
001440          MOVE SPACES TO STRINGA-VIEW.
001450
001460          DISPLAY "REMOTE_PORT" UPON ENV-NAME
001470          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001480          ON EXCEPTION CONTINUE
001490          END-ACCEPT.
001500
001510          MOVE "REMOTE-PORT"     TO NOME-VIEW
001520          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001530
001540
001550
001560          DISPLAY "TEST_PORT" UPON ENV-NAME 
001570
001580          DISPLAY "FEDERICO" UPON ENV-VALUE
001590
001600          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001610          ON EXCEPTION CONTINUE
001620          END-ACCEPT.
001630
001640          MOVE "TEST-PORT"  TO NOME-VIEW
001650          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001660
001670
001680
001681
001682          MOVE FILE-LOG       TO STRINGA-VIEW.
001683          MOVE "FILE-LOG"     TO NOME-VIEW
001684          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001685
001690
001700          MOVE SECTION-WEB    TO STRINGA-VIEW.
001710          MOVE "SECTION-WEB"  TO NOME-VIEW
001720          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001730
001740
001750          PERFORM OPEN-I-TAB  THRU EX-OPEN-I-TAB.
001760          MOVE 1                  TO PROG-TAB.
001770          MOVE "01"           TO TIPO-TAB.
001780          MOVE 01             TO ENTE-TAB.
001790          PERFORM LEGGO-TAB   THRU EX-LEGGO-TAB.
001800
001810          IF ESITO-NOK MOVE "ENTE DI PROVA" TO DESC-ENTE-001.
001820
001830          CLOSE ARKTAB.
001840
001850          MOVE DESC-ENTE-001  TO STRINGA-VIEW.
001860          MOVE "DESC-ENTE"    TO NOME-VIEW
001870          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001880
001890
001900          MOVE NOME-UTEN      TO STRINGA-VIEW
001910          MOVE "UTENTE"       TO NOME-VIEW
001920          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001930
001940
001950
001960
001970          ACCEPT DATA-SYS FROM DATE.
001980          MOVE GG-SYS         TO GG-WEB.
001990          MOVE MM-SYS         TO MM-WEB.
002000          MOVE AA-SYS         TO AA-WEB.
002010          ADD 2000            TO AA-WEB.
002020
002030          MOVE DATA-WEB       TO STRINGA-VIEW
002040          MOVE "OGGI  "       TO NOME-VIEW
002050          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002060
002070
002080          MOVE AA-WEB         TO STRINGA-VIEW
002090          MOVE "ANNO"         TO NOME-VIEW
002100          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002110
002120          MOVE MM-WEB         TO STRINGA-VIEW
002130          MOVE "MESE"         TO NOME-VIEW
002140          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002150
002160
002170
002180
002190          MOVE "MK-DATA"      TO FIELD-WEB
002200          PERFORM READ-WEB    THRU EX-READ-WEB
002210
002220          MOVE DATA-WEB       TO DATA-VIEW
002230			MOVE "D"			TO TIPO-VIEW
002240          MOVE "ACCESSO"      TO NOME-VIEW
002250          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002260
002270          STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
002280           DELIMITED BY SIZE INTO STRINGA-VIEW.
002290
002300          MOVE "SCADENZA"       TO NOME-VIEW
002310          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002320
002330
002340          MOVE "VALIDITA"      TO NOME-VIEW
002350          MOVE SPACES          TO STRINGA-VIEW.
002360
002370          STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
002380          DELIMITED BY SIZE INTO STRINGA-VIEW.
002390
002400          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002410
002420
002430
002440          MOVE "TIMEOUT"       TO NOME-VIEW
002450          MOVE TIMEOUT-UTEN    TO STRINGA-VIEW.
002460
002470          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002480
002490
002500
002510 EX-LOAD-VIEW.
002520          EXIT.
002530
002540
002550
002560 SESSIONE.
002570
002580          ACCEPT TIME-SECTION-WEB FROM TIME.
002590
002600          ACCEPT DATA-SYS FROM DATE.
002610          MOVE GG-SYS         TO GG-SECTION-WEB.
002620          MOVE MM-SYS         TO MM-SECTION-WEB.
002630          MOVE AA-SYS         TO AA-SECTION-WEB.
002640          ADD 2000            TO AA-SECTION-WEB.
002650
002660          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN.
002670
002680 EX-SESSIONE.
002690			EXIT.
002700
