000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID       LEGGIENV.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000080
000082     COPY "SPECIAL.CBL".
000083
000084
000085 INPUT-OUTPUT     SECTION.
000090 DATA             DIVISION.
000100 WORKING-STORAGE  SECTION.
000110 LINKAGE SECTION.
000120 01 ENV-VARIABILE   PIC X(1024).
000130 01 ENV-VALORE      PIC X(2048).
000140 PROCEDURE DIVISION USING ENV-VARIABILE RETURNING ENV-VALORE.
000150     DISPLAY ENV-VARIABILE UPON ENV-NAME
000160     ACCEPT ENV-VALORE     FROM ENV-VALUE
000170        ON EXCEPTION MOVE LOW-VALUE 	TO ENV-VALORE.
000180
000190
