000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENDELE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000301			COPY "SELCAUS.CBL".
000302			COPY "SELORA.CBL".
000310			COPY "SELUTEN.CBL".
000311			COPY "SELABI.CBL".
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000361			COPY "FDEUTEN.CBL".
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDETAB.CBL".
000400			COPY "FDECAUS.CBL".
000401			COPY "FDEORA.CBL".
000402			COPY "FDEABI.CBL".
000403
000410 WORKING-STORAGE  SECTION.
000420
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000510                                             
000520
000521          MOVE "FILE-DELETE" 	 TO NOME-VIEW.
000522          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000523
000524			EVALUATE STRINGA-VIEW
000525
000526			WHEN "TA"
000527
000528			PERFORM TABELLE		THRU EX-TABELLE
000529
000530			WHEN "CA"
000540
000550			PERFORM CAUSALI 	THRU EX-CAUSALI
000560
000760			WHEN "OR"
000761
000762			PERFORM ORARI   	THRU EX-ORARI   
000763	
000764			WHEN "UT"
000765
000766			PERFORM UTENTI  	THRU EX-UTENTI  
000767
000768			WHEN "AB"
000769
000770			PERFORM ABILITA 	THRU EX-ABILITA
000771
000772
000773			WHEN OTHER
000774
000775			STRING "CANCELLAZIONE NON IMPLEMENTATA PER "
000776			 STRINGA-VIEW
000777			 DELIMITED BY SIZE INTO MESSAGGIO
000778
000779          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000780		
000781
000782 FINE.
000783
000790
000800          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000810
000820          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000830
000840          GOBACK.
000850
000851			COPY "PIOABI.CBL".
000860          COPY "PIOWEB1.CBL".
000870          COPY "PIOVIEW.CBL".
000880          COPY "PIOTAB.CBL".
000890          COPY "PIOCAUS.CBL".
000891			COPY "PIOORA.CBL".
000980			COPY "PIOUTEN.CBL".
000990 TABELLE.
001000
001010          PERFORM OPEN-IO-TAB  THRU EX-OPEN-IO-TAB.
001020
001030          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001040          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001050          MOVE STRINGA-VIEW    TO CHIAVE-TAB.
001060
001070          PERFORM CANCELLO-TAB THRU EX-CANCELLO-TAB.
001080
001090          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
001100
001110          IF ESITO-NOK
001120            STRING "ERRORE CANCELLAZIONE:" CHIAVE-TAB
001130             " STATUS:" STATUS-TAB
001140               DELIMITED BY SIZE INTO MESSAGGIO
001150               ELSE
001160                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-TAB
001170                   " STATUS:" STATUS-TAB
001180                  DELIMITED BY SIZE INTO MESSAGGIO.
001190
001200          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001201
001210 EX-TABELLE.
001220			EXIT.
001230
001240 CAUSALI.
001250
001260          PERFORM OPEN-IO-CAUS  THRU EX-OPEN-IO-CAUS.
001270
001280          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001290          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001300          MOVE STRINGA-VIEW    TO CHIAVE-CAUS.
001310
001320          PERFORM CANCELLO-CAUS THRU EX-CANCELLO-CAUS.
001330
001340          PERFORM CLOSE-CAUS    THRU EX-CLOSE-CAUS.
001350
001360          IF ESITO-NOK
001370            STRING "ERRORE CANCELLAZIONE:" CHIAVE-CAUS
001380             " STATUS:" STATUS-CAUS
001390               DELIMITED BY SIZE INTO MESSAGGIO
001400               ELSE
001410                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-CAUS
001420                   " STATUS:" STATUS-CAUS
001430                  DELIMITED BY SIZE INTO MESSAGGIO.
001440
001450          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001460
001470 EX-CAUSALI.
001480			EXIT.
001490
001491 ORARI.
001492
001493          PERFORM OPEN-IO-ORA   THRU EX-OPEN-IO-ORA.
001494
001495          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001496          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001497          MOVE STRINGA-VIEW    TO CHIAVE-ORA.
001498
001499          PERFORM CANCELLO-ORA  THRU EX-CANCELLO-ORA.
001500
001501          PERFORM CLOSE-ORA     THRU EX-CLOSE-ORA.
001502
001503          IF ESITO-NOK
001504            STRING "ERRORE CANCELLAZIONE:" CHIAVE-ORA 
001505             " STATUS:" STATUS-ORA
001506               DELIMITED BY SIZE INTO MESSAGGIO
001507               ELSE
001508                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-ORA
001509                   " STATUS:" STATUS-ORA
001510                  DELIMITED BY SIZE INTO MESSAGGIO.
001511
001512          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001513
001514 EX-ORARI.
001515			EXIT.
001516
001517 UTENTI.
001527
001537          PERFORM OPEN-IO-UTEN  THRU EX-OPEN-IO-UTEN.
001547
001557          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001567          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001577          MOVE STRINGA-VIEW    TO CHIAVE-UTEN.
001587
001597          PERFORM CANCELLO-UTEN THRU EX-CANCELLO-UTEN.
001607
001617          PERFORM CLOSE-UTEN    THRU EX-CLOSE-UTEN.
001627
001637          IF ESITO-NOK
001647            STRING "ERRORE CANCELLAZIONE:" CHIAVE-UTEN
001657             " STATUS:" STATUS-UTEN
001667               DELIMITED BY SIZE INTO MESSAGGIO
001677               ELSE
001687                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-UTEN
001697                   " STATUS:" STATUS-UTEN
001707                  DELIMITED BY SIZE INTO MESSAGGIO.
001717
001727          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001737
001747 EX-UTENTI.
001757			EXIT.
001767
001777
001787
001797 ABILITA.
001807
001817          PERFORM OPEN-IO-ABI   THRU EX-OPEN-IO-ABI.
001827
001837          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001847          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001857          MOVE STRINGA-VIEW    TO CHIAVE-ABI.
001867
001877          PERFORM CANCELLO-ABI  THRU EX-CANCELLO-ABI.
001887
001897          PERFORM CLOSE-ABI     THRU EX-CLOSE-ABI.
001907
001917          IF ESITO-NOK
001927            STRING "ERRORE CANCELLAZIONE:" CHIAVE-ABI 
001937             " STATUS:" STATUS-ABI
001947               DELIMITED BY SIZE INTO MESSAGGIO
001957               ELSE
001967                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-ABI 
001977                   " STATUS:" STATUS-ABI
001987                  DELIMITED BY SIZE INTO MESSAGGIO.
001997
002007          PERFORM VIS-MESS        THRU EX-VIS-MESS.
002017
002027 EX-ABILITA.
002037			EXIT.
002047
002057
