000010
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENREPR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300          COPY "SELPROF.CBL".
000310		                                   
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEPROF.CBL".
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410		                                   
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000560
000570                                             
000520
000530          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000540          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000550          PERFORM OPEN-IO-PROF  THRU EX-OPEN-IO-PROF.
000580
000590          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000600
000610          IF ESITO-NOK
000620          MOVE "ERRORE MEMORIZZAZIONE DATI PROFILIO" TO MESSAGGIO
000630           ELSE
000640          MOVE "MEMORIZZAZIONE PROFILIO  EFFETTUATA"  TO MESSAGGIO.
000650
000660          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000670
000680 FINE.
000690          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000700          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000710			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000720          PERFORM CLOSE-PROF    THRU EX-CLOSE-PROF.
000730
000740          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000750
000760          GOBACK.
000770
000780          COPY "PIOWEB1.CBL".
000790          COPY "PIOVIEW.CBL".
000800          COPY "PIOTAB.CBL".
000810			COPY "PIODATO.CBL".
000820          COPY "PIOPROF.CBL".
000811			COPY "PCARIWEB.CBL".
000830
000840 LOAD-VIEW.
000850
000860          MOVE "LAVORO"   	     TO NOME-VIEW
000870          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000880
000890			MOVE STRINGA-VIEW		TO SW-LAVORO.
000900
000910			IF SW-LAVORO = "INSERIMENTO"
000920           INITIALIZE PROFILO
000930
000940		
000950
000960*****  TIPO RECORD DA INSERIRE
000970
000980
000990			ELSE
001000
001010          MOVE "CHIAVE-PROF" 	    TO NOME-VIEW
001020          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
001030
001040			IF ESITO-NOK
001050			 MOVE "ERRORE NON GESTITO CHIAVE-PROF  SU OPENREOR"
001060			 TO MESSAGGIO
001070			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001080			 GO TO EX-LOAD-VIEW
001090			END-IF
001100
001110*****  RECORD DA VARIARE
001120
001130			MOVE STRINGA-VIEW		TO CHIAVE-PROF 
001140
001150***** LOCK DEL RECORD
001160
001170			PERFORM LEGGO-PROF   	THRU EX-LEGGO-PROF.
001180
001190***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001200
001210
001220			MOVE "PR"				TO CHIAVE-DATO.
001230			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001240			IF ESITO-NOK GO TO FINE-VIEW.
001250
001260******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001270
001280 CICLO-VIEW.
001290
001300			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001310
001320          IF CHIAVE-DATO(1:2) NOT = "PR" MOVE "S" TO FINE-FILE.
001330
001340      	IF FINE-FILE = "S" GO TO FINE-VIEW.
001350		
001360*** IL PRIMO CAMPO  E' PROFILIO   LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001370*
001380 CICLO-DATI-VIEW.
001390
001400			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001410
001420			IF CHIAVE-DATO(1:2) NOT = "PR" MOVE "S" TO FINE-FILE.
001430
001440			IF FINE-FILE = "S" GO TO FINE-VIEW.

                PERFORM CARICA-DATO-WEB	THRU EX-CARICA-DATO-WEB.
                
                IF USE-ARGUMENT = "S"
001643			MOVE ARGUMENT			TO PROFILO(POS-DATO:SIZE-DATO).
001530
001540			GO TO CICLO-DATI-VIEW.
001550			 
001560
001570 FINE-VIEW.
001580
001590			IF SW-LAVORO = "INSERIMENTO"
001600			 CONTINUE
001610			ELSE
001620			PERFORM AGGIORNO-PROF    THRU EX-AGGIORNO-PROF 
001630			 GO TO EX-LOAD-VIEW.
001640
001650 LOOP-VIEW.
001660
001670          perform SCRIVO-PROF      THRU EX-SCRIVO-PROF.
001680
001690          IF ESITO-NOK ADD 1 TO PROG-PROF 
001700             GO TO LOOP-VIEW.
001710
001720 EX-LOAD-VIEW.
001730          EXIT.
001740
