000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENTA07.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230 SPECIAL-NAMES.
000240          DECIMAL-POINT IS COMMA.
000250 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000301			COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDETAB.CBL".
000400			COPY "FDEJSON.CBL".
000401
000410 WORKING-STORAGE  SECTION.
000420
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000510          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000520
000530          COPY "INIZIALI.CBL".
000540
000550
000560          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000570
000580          MOVE "TEMPLATE/TABELL07.HTM"    TO PAGE-WEB
000590          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000600
000610
000620 FINE.
000630          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000640          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000650
000660
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB.CBL".
000720          COPY "PIOVIEW.CBL".
000730          COPY "PIOTAB.CBL".
000731			COPY "PIOJSON.CBL".
000740
000750
000760 LOAD-VIEW.
000770
000780          MOVE SECTION-WEB        TO STRINGA-VIEW.
000790          MOVE "SECTION-WEB"      TO NOME-VIEW
000800          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000801
000802
000803
000804          MOVE SPACES              TO STRINGA-VIEW.
000805
000806
000807			STRING 
000808
000809			'<a href="openta07.exe?MK-KEY='
000810			 SECTION-WEB DELIMITED BY SIZE
000811			'" class="easyui-linkbutton" data-options="iconCls:'
000812			"'icon-undo'"
000813			'" style="padding:5px 0px;width:45%; margin-left:20px">'
000814			' <span style="font-size:14px;">Indietro</span></a>'  
000815			DELIMITED BY SIZE INTO STRINGA-VIEW.
000816            
000818
000819          MOVE "GOBACK"           TO NOME-VIEW
000820          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000821
000822
000847          MOVE "TABELL07"		 	TO NOME-JSON.
000848			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
000849
000850			STRING "/OpenPA/" FILE-JSON 
000851			 DELIMITED BY SIZE INTO STRINGA-VIEW.
000852
000853          MOVE "FILE-JSON"        TO NOME-VIEW
000854          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000882
000883			MOVE ZEROS				TO CONTA.
000884
000902			PERFORM CONTA-007		THRU EX-CONTA-007.
000903
000904			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
000905			 OR CONTA(IND:1) > "0"
000906			 CONTINUE
000907			END-PERFORM.
000908
000909			STRING '{"total":' CONTA(IND:) ',"rows":['		
000910			DELIMITED BY SIZE INTO DATI-JSON.
000911			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
000912
000913			MOVE SPACES				 TO DATI-JSON.
000914
000915          MOVE LOW-VALUE          TO CHIAVE-TAB.
000916          MOVE "07"                     TO TIPO-TAB.
000917          MOVE 1                          TO ENTE-TAB.
000918          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
000919
000920          if ESITO-NOK GO TO FINE-TABELLA.
000921
000922
001080 CICLO-TABELLA.
001081
001082			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
001083
001084			IF TIPO-TAB NOT = "07" MOVE "S" TO FINE-FILE.
001085
001087			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001088
001089			IF DATI-JSON > SPACES
001090			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001091
001092			INSPECT TABELLA REPLACING ALL "\" BY " ".			
001093
001094				
001098**** ITEM
001099		
001100			STRING 
001101
001102			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001103			ELEMENTO-TAB    DELIMITED BY "   "
001104			'",'			DELIMITED BY SIZE
001105**** ITEM
001106		 
001107			'"DESCRIZ":"'	DELIMITED BY SIZE
001108			DESC-TAB        DELIMITED BY "     "
001109			'",'			DELIMITED BY SIZE
001110
001111**** ITEM
001112		 
001113			'"CONTO":"'	DELIMITED BY SIZE
001114			CONTO-007       DELIMITED BY "     "
001115			'",'			DELIMITED BY SIZE
001116**** ITEM
001117		 
001118			'"TIPO":"'	DELIMITED BY SIZE
001119			TIPO-QUAL-007   DELIMITED BY "     "
001120			'","'			DELIMITED BY SIZE
001121
001122**** ITEM
001123
001124			'CANCELLA":"'	DELIMITED BY SIZE
001125			'<a href=opendeta.exe?MK-KEY='
001126			 SECTION-WEB DELIMITED BY SIZE
001127			"&MK-ITEM=" DELIMITED BY SIZE
001128			CHIAVE-TAB
001129			'>' delimited by size 
001130			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001131				delimited by size 
001132			'","'			DELIMITED BY SIZE
001133**** ITEM
001134
001135			'MODIFICA":"'	DELIMITED BY SIZE
001136
001137			'<a href=openmota.exe?MK-KEY='
001138			 SECTION-WEB DELIMITED BY SIZE
001139			"&MK-ITEM=" DELIMITED BY SIZE
001140			CHIAVE-TAB
001141			'>' delimited by size 
001142			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001143				delimited by size 
001144
001145
001146          '"},' DELIMITED BY SIZE 
001147			into dati-JSON.
001148
001149
001150
001151			GO TO CICLO-TABELLA.
001152
001153
001154 FINE-TABELLA.
001155
001156			INSPECT DATI-JSON REPLACING all "}, " BY
001157										    "}  ".
001158
001159			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001160
001161
001162			MOVE "]}"					TO DATI-JSON.
001163			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
001164
001165			CLOSE ARKJSON.
001166
001167
001168 EX-LOAD-VIEW.
001169          EXIT.
001170
001196 CONTA-007.
001197
001198          MOVE LOW-VALUE          TO CHIAVE-TAB.
001199          MOVE "07"               TO TIPO-TAB.
001200          MOVE 1                  TO ENTE-TAB.
001201          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
001202			
001203			IF ESITO-NOK GO TO EX-CONTA-007.
001204
001205 CICLO-CONTA-007.
001206
001207			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
001208
001209			IF TIPO-TAB NOT = "07" MOVE "S" TO FINE-FILE.
001210
001211			IF FINE-FILE = "S" GO TO EX-CONTA-007.
001212
001213			ADD 1					TO CONTA.
001214
001215			GO TO CICLO-CONTA-007.
001216
001217 EX-CONTA-007.
001218			EXIT.
001219
001220 REPLACE-WEB.
001221
001250
001260          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001270
001280
001290 EX-REPLACE-WEB.
001300          EXIT.
001310
