000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENMOAB.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300			COPY "SELABI.CBL".
000310		                                   
000320			COPY "SELMENU.CBL".
000330
000340
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410		                                   
000420			COPY "FDEABI.CBL".
000430			COPY "FDEMENU.CBL".
000440
000450 WORKING-STORAGE  SECTION.
000460
000470          COPY "COBW3.CBL".
000480          COPY "GLOBALS.CBL".
000490          COPY "IMAGES.CBL".
000500*
000510 PROCEDURE  DIVISION.
000520*
000530          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000540
000550                                             
000560
000570
000580			PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000590			PERFORM OPEN-I-ABI   THRU EX-OPEN-I-ABI.
000600			PERFORM OPEN-I-MENU	 THRU EX-OPEN-I-MENU.
000610			PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000620
000630
000640		    MOVE "MK-ITEM"       TO FIELD-WEB
000650          PERFORM READ-WEB     THRU EX-READ-WEB
000660          MOVE VALUE-WEB       TO ELEMENTO-TAB
000670
000680			MOVE "03"			 TO TIPO-TAB.
000690			MOVE 01				 TO ENTE-TAB.
000700
000710*
000720**** SI LEGGE IL RECORD DA MODIFICARE: N.B NON VIENE ANCORA POSTO IN LOCK
000730*
000740			PERFORM LEGGO-TAB	 THRU EX-LEGGO-TAB.
000750
000760			IF ESITO-NOK
000770			 STRING "ERRORE NON GESTITO LETTURA TABELLA"
000780			 DELIMITED BY SIZE INTO MESSAGGIO
000790			 PERFORM VIS-MESS	THRU EX-VIS-MESS
000800			 GO TO FINE.
000810
000820			PERFORM AZZERA-VIEW THRU EX-AZZERA-VIEW.
000830
000840          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000850
000860			MOVE SPACES			 TO PAGE-WEB
000870
000880			MOVE "INSEABIL.HTM" TO PAGE-WEB.
000890
000900          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000910
000920
000930 FINE.
000940          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000950		 	PERFORM CLOSE-TAB	 THRU EX-CLOSE-TAB.
000960			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000970			PERFORM CLOSE-MENU   THRU EX-CLOSE-MENU.
000980		 	PERFORM CLOSE-ABI	 THRU EX-CLOSE-ABI.
000990
001000          PERFORM FINE-WEB     THRU EX-FINE-WEB.
001010
001020          GOBACK.
001030
001040          COPY "PIOWEB1.CBL".
001050          COPY "PIOVIEW.CBL".
001060			COPY "PIOTAB.CBL".
001070			COPY "PIODATO.CBL".
001080			COPY "PIOABI.CBL".	
001090			COPY "PIOMENU.CBL".
001100
001110  LOAD-VIEW.
001120
001130          MOVE "VARIAZIONE"               TO STRINGA-VIEW
001140          MOVE "LAVORO"           		TO NOME-VIEW
001150          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001160
001170          MOVE CHIAVE-TAB 	            TO STRINGA-VIEW
001180          MOVE "CHIAVE-TAB"       		TO NOME-VIEW
001190          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001200
001210          MOVE ELEMENTO-TAB 		        TO STRINGA-VIEW
001220          MOVE "ELEMENTO-TAB"     		TO NOME-VIEW
001230          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001240
001250
001260          MOVE TIPO-TAB     		        TO STRINGA-VIEW
001270          MOVE "TIPO-TAB"     			TO NOME-VIEW
001280          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001290
001300
001310
001320
001330          MOVE SPACES              TO STRINGA-VIEW.
001340
001350			STRING 
001360
001370			'<a href="openabil.exe?MK-KEY='
001380			 SECTION-WEB DELIMITED BY SIZE
001390			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
001400			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
001410			'" class="easyui-linkbutton" data-options="iconCls:'
001420			"'icon-undo'"
001430			'" style="padding:5px 0px;width:15%; margin-left:20px">'
001440			' <span style="font-size:14px;">Indietro</span></a>'  
001450			DELIMITED BY SIZE INTO STRINGA-VIEW.
001460            
001470
001480          MOVE "GOBACK"           TO NOME-VIEW
001490          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001500
001510
001520			INITIALIZE MENU ABILITAZIONE.
001530
001540			MOVE LOW-VALUE					TO CHIAVE-SEC-MENU.
001550			
001560			PERFORM STARTO-SEC-MENU			THRU EX-STARTO-SEC-MENU.
001570
001580			IF ESITO-NOK GO TO EX-LOAD-VIEW.
001590
001600			MOVE ZERO						TO CONTA.			
001610
001620 CICLO-MENU.
001630
001640			PERFORM LEGGO-NEXT-MENU	THRU EX-LEGGO-NEXT-MENU.
001650
001660			IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001670
001680
001690			INITIALIZE ABILITAZIONE VIEW DATO.
001700
001710			MOVE 01						TO ENTE-ABI.
001720			MOVE CHIAVE-SEC-MENU		TO CHIAMATA-ABI.
001730			MOVE PROG-TAB				TO GRUPPO-ABI.
001740			
001750			PERFORM LEGGO-ABI			THRU EX-LEGGO-ABI.
001760
001770			IF ESITO-OK
001780			 MOVE "S"					TO STRINGA-VIEW
001790			  ELSE
001800		 	 MOVE "N"					TO STRINGA-VIEW.
001810
001820			ADD 1						TO CONTA.			
001830
001840          STRING "CAMPO" CONTA DELIMITED BY SIZE INTO NOME-COBOL-DATO.
001850			
001860
001870			MOVE NOME-COBOL-DATO		TO NOME-VIEW.
001880
001890			MOVE SPACES					TO DESC-VIEW.
001900
001901
001902			if prog-menu > spaces
001903			STRING DESC-MENU  DELIMITED BY SIZE
001904			 "(" PROG-MENU ")" DELIMITED BY SIZE INTO DESC-VIEW
001905			else
001906			MOVE DESC-MENU				TO DESC-VIEW.
001907
001910
001920
001930			MOVE CHIAVE-ABI				TO KEY-VIEW.
001940
001950			PERFORM SCRITTURA-VIEW		THRU EX-SCRITTURA-VIEW.
001960
001970
001980			INITIALIZE ABILITAZIONE VIEW DATO.
001990
002000          STRING "CAMPO" CONTA DELIMITED BY SIZE INTO NOME-COBOL-DATO.
002010
002020			MOVE 01						TO ENTE-ABI.
002030			MOVE CHIAVE-SEC-MENU		TO CHIAMATA-ABI.
002040			MOVE PROG-TAB				TO GRUPPO-ABI.
002050			
002060			PERFORM LEGGO-ABI			THRU EX-LEGGO-ABI.
002070
002080			IF ESITO-OK
002090			 MOVE "S"					TO STRINGA-VIEW
002100			  ELSE
002110		 	 MOVE "N"					TO STRINGA-VIEW.
002120
002130
002140			MOVE NOME-COBOL-DATO		TO NOME-VIEW.
002150*          MOVE DESC-MENU				TO DESC-VIEW.
002160
002170			MOVE SPACES					TO KEY-VIEW.
002180
002190			move spaces					TO NOME-VIEW
002200			STRING NOME-COBOL-DATO		DELIMITED BY "  "
002210			 STRINGA-VIEW				DELIMITED BY SIZE
002220			 INTO NOME-VIEW
002230
002240			IF STRINGA-VIEW = "S"
002250			MOVE 'checked="true"'		TO STRINGA-VIEW
002260			ELSE
002270			MOVE SPACES            		TO STRINGA-VIEW.
002280
002290          MOVE DESC-MENU				TO DESC-VIEW.
002300
002310		    MOVE SPACES					TO CHIAVE-DATO-VIEW
002320          PERFORM SCRITTURA-VIEW  	THRU EX-SCRITTURA-VIEW.
002330
002340
002350			GO TO CICLO-MENU.
002360		
002370 EX-LOAD-VIEW.
002380			EXIT.
002390
002400
002410 AZZERA-VIEW.
002420
002430			MOVE "CAMPO"				TO CHIAVE-VIEW.
002440			PERFORM STARTO-VIEW			THRU EX-STARTO-VIEW.
002450			IF ESITO-NOK GO TO EX-AZZERA-VIEW.
002460
002470 CICLO-AZZERA-VIEW.
002480
002490			PERFORM LEGGO-NEXT-VIEW THRU EX-LEGGO-NEXT-VIEW.
002500
002510
002520			IF CHIAVE-VIEW(1:9) NOT = "CAMPO0000" MOVE "S" TO FINE-FILE.
002530
002540			IF FINE-FILE = "S" GO TO EX-AZZERA-VIEW.
002550
002560			PERFORM CANCELLO-VIEW	THRU EX-CANCELLO-VIEW.
002570
002580			GO TO CICLO-AZZERA-VIEW.
002590
002600 EX-AZZERA-VIEW.
002610			EXIT.
002620
002630
