000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200 IDENTIFICATION   DIVISION.
000210 PROGRAM-ID       OPENPA01.
000220 ENVIRONMENT      DIVISION.
000230 CONFIGURATION    SECTION.
000240
000250			COPY "SPECIAL.CBL".
000260
000270 INPUT-OUTPUT     SECTION.
000280 FILE-CONTROL.
000290
000300          COPY "SELWEB.CBL".
000310          COPY "SELVIEW.CBL".
000320          COPY "SELUTEN.CBL".
000330          COPY "SELTAB.CBL".
000340     
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDEUTEN.CBL".
000410          COPY "FDETAB.CBL".
000420    
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490
000500 PROCEDURE  DIVISION.
000510
000520 DECLARATIVES.
000530 ERROR-ARCHIVIO SECTION.
000540			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW ARKLOG.
000550 EX-ERRORE-ARCHIVIO.
000560			EXIT.
000570 END DECLARATIVES.
000580
000590
000600          PERFORM START-WEB  THRU EX-START-WEB.
000610
000620          MOVE "PATH-FILE"    TO FIELD-WEB
000630          PERFORM READ-WEB    THRU EX-READ-WEB
000640
000650			IF VALUE-WEB = SPACES
000660			MOVE "FILES/"		TO PATH-WEB
000670			ELSE
000680			MOVE VALUE-WEB		TO PATH-WEB.
000690
000700
000710          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000720
000730			IF STATUS-UTEN NOT = "00"
000740			STRING "Errori accesso file utenti: " STATUS-UTEN
000750				DELIMITED BY SIZE INTO MESSAGGIO
000760				PERFORM VIS-MESS THRU EX-VIS-MESS
000770			  	GO TO FINE.
000780
000790          MOVE "MK-UTENTE"    TO FIELD-WEB
000800          PERFORM READ-WEB    THRU EX-READ-WEB
000810
000820          MOVE FUNCTION UPPER-CASE(VALUE-WEB)   TO NOME-UTEN
000830          MOVE VALUE-WEB	    TO NOME-UTEN
000840
000850          PERFORM LEGGO-UTEN  THRU EX-LEGGO-UTEN.
000860
000870          IF ESITO-NOK
000880		    INITIALIZE UTENTE
000890			ELSE
000900		 	PERFORM SESSIONE	THRU EX-SESSIONE.
000910 
000920          PERFORM OPEN-O-VIEW THRU EX-OPEN-O-VIEW.
000930
000940          PERFORM LOAD-VIEW   THRU EX-LOAD-VIEW.
000950          
000960
000970			MOVE "MK-PASSWORD"  TO FIELD-WEB
000980	        PERFORM READ-WEB    THRU EX-READ-WEB
001000			MOVE VALUE-WEB      TO FIELD-WEB.
001010          PERFORM SHA-WEB     THRU EX-SHA-WEB.
001020          
001030
001040          MOVE VALUE-WEB      TO STRINGA-VIEW.
001050          MOVE "SHA3-WEB"     TO NOME-VIEW
001060          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001070
001071
001072          MOVE PROG-DIP-UTEN  TO NUMERO-VIEW.
001073			MOVE "N"			TO TIPO-VIEW.
001074          MOVE "MATRICOLA"    TO NOME-VIEW
001075          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001076
001080          
001090          IF VALUE-WEB NOT = PASSWORD-UTEN
001100			OR PASSWORD-UTEN = SPACES
001110          MOVE "ERRORE LOGIN UTENTE" TO MESSAGGIO
001120          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
001130			GO TO FINE.
001140
001150**** SOLO openmenu e' dentro la cartella archivi dell'ente
001160
001170			MOVE SPACES		    TO PAGE-WEB.
001231
001232			MOVE "MK-LDAP" 		TO FIELD-WEB
001233	        PERFORM READ-WEB    THRU EX-READ-WEB
001234
001244			
001260			STRING PATH-WEB DELIMITED BY "  "
001270		       "openmenu.htm" DELIMITED BY SIZE
001280             INTO PAGE-WEB.
001301	
001302			IF VALUE-WEB = SPACES
001303		     AND DATA-SECTION-WEB > DATA-SCAD-UTEN 
001304			 move "openpassd.htm" TO PAGE-web.
001308
001312
001320          PERFORM MAKE-WEB    THRU EX-MAKE-WEB.
001330
001340
001350 FINE.
001360
001370          PERFORM CLOSE-VIEW  THRU EX-CLOSE-VIEW.
001380
001390          PERFORM CLOSE-UTEN  THRU EX-CLOSE-UTEN.
001400
001410
001420          PERFORM FINE-WEB    THRU EX-FINE-WEB.
001430
001440          GOBACK.
001450
001460          COPY "PIOWEB1.CBL".
001470          COPY "PIOUTEN.CBL".
001480          COPY "PIOVIEW.CBL".
001490          COPY "PIOTAB.CBL".
001500
001510 
001520 LOAD-VIEW.
001530
001540          MOVE PATH-WEB       TO STRINGA-VIEW.
001550          MOVE "PATH-FILE"    TO NOME-VIEW
001560          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001570
001580
001590          MOVE SPACES TO STRINGA-VIEW.
001600          DISPLAY "REMOTE_ADDR" UPON ENV-NAME
001610          ACCEPT STRINGA-VIEW   FROM ENV-VALUE
001620          ON EXCEPTION CONTINUE
001630          END-ACCEPT.
001640
001650          MOVE "REMOTE-IP"       TO NOME-VIEW
001660          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001670
001680          MOVE SPACES TO STRINGA-VIEW.
001690
001700          DISPLAY "REMOTE_PORT" UPON ENV-NAME
001710          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001720          ON EXCEPTION CONTINUE
001730          END-ACCEPT.
001740
001750          MOVE "REMOTE-PORT"     TO NOME-VIEW
001760          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001770
001780
001790
001800          DISPLAY "TEST_PORT" UPON ENV-NAME 
001810
001820          DISPLAY "FEDERICO" UPON ENV-VALUE
001830
001840          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001850          ON EXCEPTION CONTINUE
001860          END-ACCEPT.
001870
001880          MOVE "TEST-PORT"  TO NOME-VIEW
001890          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001900
001910
001920
001930
001940          MOVE FILE-LOG       TO STRINGA-VIEW.
001950          MOVE "FILE-LOG"     TO NOME-VIEW
001960          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001970
001980
001990          MOVE SECTION-WEB    TO STRINGA-VIEW.
002000          MOVE "SECTION-WEB"  TO NOME-VIEW
002010          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002020
002030
002040          PERFORM OPEN-I-TAB  THRU EX-OPEN-I-TAB.
002050          MOVE 1                  TO PROG-TAB.
002060          MOVE "01"           TO TIPO-TAB.
002070          MOVE 01             TO ENTE-TAB.
002080          PERFORM LEGGO-TAB   THRU EX-LEGGO-TAB.
002090
002100          IF ESITO-NOK MOVE "ENTE DI PROVA" TO DESC-ENTE-001.
002110
002120          CLOSE ARKTAB.
002130
002140          MOVE DESC-ENTE-001  TO STRINGA-VIEW.
002150          MOVE "DESC-ENTE"    TO NOME-VIEW
002160          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002170
002180
002190          MOVE NOME-UTEN      TO STRINGA-VIEW
002200          MOVE "UTENTE"       TO NOME-VIEW
002210          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002220
002230
002240
002250
002260          ACCEPT DATA-SYS FROM DATE.
002270          MOVE GG-SYS         TO GG-WEB.
002280          MOVE MM-SYS         TO MM-WEB.
002290          MOVE AA-SYS         TO AA-WEB.
002300          ADD 2000            TO AA-WEB.
002310
002320          MOVE DATA-WEB       TO STRINGA-VIEW
002330          MOVE "OGGI  "       TO NOME-VIEW
002340          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002350
002360
002370          MOVE AA-WEB         TO STRINGA-VIEW
002380          MOVE "ANNO"         TO NOME-VIEW
002390          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002400
002410          MOVE MM-WEB         TO STRINGA-VIEW
002420          MOVE "MESE"         TO NOME-VIEW
002430          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002440
002450
002460
002470
002480          MOVE "MK-DATA"      TO FIELD-WEB
002490          PERFORM READ-WEB    THRU EX-READ-WEB
002500
002510          MOVE DATA-WEB       TO DATA-VIEW
002520			MOVE "D"			TO TIPO-VIEW
002530          MOVE "ACCESSO"      TO NOME-VIEW
002540          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002541
002542			MOVE SPACES			TO STRINGA-VIEW.
002550
002560          STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
002570           DELIMITED BY SIZE INTO STRINGA-VIEW.
002580
002590          MOVE "SCADENZA"       TO NOME-VIEW
002600          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002610
002620
002630          MOVE "VALIDITA"      TO NOME-VIEW
002640          MOVE SPACES          TO STRINGA-VIEW.
002650
002660          STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
002670          DELIMITED BY SIZE INTO STRINGA-VIEW.
002680
002690          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002700
002710
002720
002730          MOVE "TIMEOUT"       TO NOME-VIEW
002740          MOVE TIMEOUT-UTEN    TO STRINGA-VIEW.
002750
002760          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002770
002780
002781
002782			MOVE SPACES			TO STRINGA-VIEW.
002783
002784          STRING GG-SCAD-UTEN "/" MM-SCAD-UTEN "/" AA-SCAD-UTEN
002785           DELIMITED BY SIZE INTO STRINGA-VIEW.
002786
002787          MOVE "DATA-SCAD-UTEN"  TO NOME-VIEW
002788          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002789
002790
002791
002792
002800 EX-LOAD-VIEW.
002810          EXIT.
002820
002830
002840
002850 SESSIONE.
002860
002870          ACCEPT TIME-SECTION-WEB FROM TIME.
002880
002890          ACCEPT DATA-SYS FROM DATE.
002900          MOVE GG-SYS         TO GG-SECTION-WEB.
002910          MOVE MM-SYS         TO MM-SECTION-WEB.
002920          MOVE AA-SYS         TO AA-SECTION-WEB.
002930          ADD 2000            TO AA-SECTION-WEB.
002940
002950          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN.
002960
002970 EX-SESSIONE.
002980			EXIT.
002990
