000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENDATO.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000290			COPY "SELJSON.CBL".
000291		    COPY "SELVIEW.CBL".
000300
000310
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360          COPY "FDEWEB.CBL".
000380			COPY "FDEJSON.CBL".
000381		    COPY "FDEVIEW.CBL".
000390
000400 WORKING-STORAGE  SECTION.
000410
000420          COPY "COBW3.CBL".
000430          COPY "GLOBALS.CBL".
000440          COPY "IMAGES.CBL".
000450*
000460 PROCEDURE  DIVISION.
000470*
000480          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000490
000500
000510                                             
000520
000530			PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000531
000532
000540          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000560
000570			MOVE  "DATO.HTM" TO PAGE-WEB.
000590
000600          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000610
000620
000630 FINE.
000640          PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000660			PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB1.CBL".
000720          COPY "PIODATO.CBL".
000730			COPY "PIOJSON.CBL".
000731		    COPY "PIOVIEW.CBL".
000740
000750
000760 LOAD-VIEW.
000770
000780          MOVE SPACES              TO STRINGA-VIEW.
000790
000800			STRING 
000810
000820			'<a href="opendato.exe?MK-KEY='
000830			 SECTION-WEB DELIMITED BY SIZE
000840			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000850			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000860			'" class="easyui-linkbutton" data-options="iconCls:'
000870			"'icon-undo'"
000880			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000890			' <span style="font-size:14px;">Indietro</span></a>'  
000900			DELIMITED BY SIZE INTO STRINGA-VIEW.
000910            
000920
000930          MOVE "GOBACK"           TO NOME-VIEW
000940          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000950
000960
000970			MOVE "DATODATI"         TO NOME-JSON.
000990          MOVE "FILE-JSON"        TO NOME-VIEW
000991
001000			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001070
001080			MOVE ZEROS				TO CONTA.
001090
001100			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001110
001120			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001130			 OR CONTA(IND:1) > "0"
001140			 CONTINUE
001150			END-PERFORM.
001160
001170			STRING '{"total":' CONTA(IND:) ',"rows":['		
001180			DELIMITED BY SIZE INTO DATI-JSON.
001190			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001200
001210			MOVE SPACES				TO DATI-JSON.
001220
001230          MOVE LOW-VALUE          TO CHIAVE-DATO.
001240          PERFORM STARTO-DATO     THRU EX-STARTO-DATO.
001250
001260          if ESITO-NOK GO TO FINE-TABELLA.
001270
001280
001290 CICLO-TABELLA.
001300
001310			PERFORM LEGGO-NEXT-DATO	THRU EX-LEGGO-NEXT-DATO.
001320
001330			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001340
001350			IF DATI-JSON > SPACES
001360			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001370
001380***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001390
001400			INSPECT DATO REPLACING ALL "\" BY " ".			
001410
001420			INSPECT DATO REPLACING ALL '"' BY "~".			
001430				
001440**** ITEM
001450		
001460			STRING 
001470
001480			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001490			NOME-COBOL-DATO      DELIMITED BY "   "
001500			'",'			DELIMITED BY SIZE
001510			INTO DATI-JSON  
001520          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001530
001538
001539
001540**** ITEM
001550			STRING "        "
001560			'"DESC":"'	DELIMITED BY SIZE
001561			NOME-DATO DELIMITED BY  SIZE 
001562			" PICTURE " DELIMITED BY SIZE
001570			TIPO-DATO       DELIMITED BY "     "
001580			'",'			DELIMITED BY SIZE
001590			INTO DATI-JSON  
001600          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001610**** ITEM
001620			STRING "        "
001630			'"DESC1":"'	DELIMITED BY SIZE
001640			ARCHIVIO-DATO    DELIMITED BY "     "
001650			'",'			DELIMITED BY SIZE
001660			INTO DATI-JSON  
001670          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001680**** ITEM
001690			STRING "        "
001700			'"DESC2":"'	DELIMITED BY SIZE
001710			SIZE-DATO       DELIMITED BY "     "
001720			'",'			DELIMITED BY SIZE
001730			INTO DATI-JSON  
001740          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001750**** ITEM
001760
001770			STRING "        "
001780			'"DESC3":"'	DELIMITED BY SIZE
001790			POS-DATO        DELIMITED BY "     "
001810          '"},' DELIMITED BY SIZE 
001811			INTO DATI-JSON .
001856
001857
001860	 		GO TO CICLO-TABELLA.
001870
001880
001890 FINE-TABELLA.
001900
001910			INSPECT DATI-JSON REPLACING all "}, " BY
001920										    "}  ".
001930
001940			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001950
001960
001970			MOVE "]}"					TO DATI-JSON.
001980			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
001990
002000			CLOSE ARKJSON.
002010
002020
002030 EX-LOAD-VIEW.
002040          EXIT.
002050
002060 CONTA-RECORD.
002070
002080          MOVE LOW-VALUE          TO CHIAVE-DATO.
002090          PERFORM STARTO-DATO     THRU EX-STARTO-DATO.
002100			
002110			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002120
002130 CICLO-CONTA-RECORD.
002140
002150			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
002160
002170			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002180
002190			ADD 1					TO CONTA.
002200
002210			GO TO CICLO-CONTA-RECORD.
002220
002230 EX-CONTA-RECORD.
002240			EXIT.
002250
