000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENRECA.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300          COPY "SELCAUS.CBL".
000310		                                   
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDECAUS.CBL".
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410		                                   
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000560
000570                                             
000520
000530          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000540          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000550          PERFORM OPEN-IO-CAUS THRU EX-OPEN-IO-CAUS.
000580
000590          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000600
000610          IF ESITO-NOK
000620          MOVE "ERRORE MEMORIZZAZIONE DATI CAUSALI" TO MESSAGGIO
000630           ELSE
000640          MOVE "MEMORIZZAZIONE CAUSALI EFFETTUATA"  TO MESSAGGIO.
000650
000660          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000670
000680 FINE.
000690          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000700          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000710			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000720          PERFORM CLOSE-CAUS   THRU EX-CLOSE-CAUS.
000730
000740          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000750
000760          GOBACK.
000770
000780          COPY "PIOWEB1.CBL".
000790          COPY "PIOVIEW.CBL".
000800          COPY "PIOTAB.CBL".
000810			COPY "PIODATO.CBL".
000820          COPY "PIOCAUS.CBL".
000830			COPY "PCARIWEB.CBL".
000840
000850 LOAD-VIEW.
000860
000870          MOVE "LAVORO"   	     TO NOME-VIEW
000880          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000890
000900			MOVE STRINGA-VIEW		TO SW-LAVORO.
000910
000920			IF SW-LAVORO = "INSERIMENTO"
000930           INITIALIZE CAUSALE
000940
000950		
000960
000970*****  TIPO RECORD DA INSERIRE
000980
000990
001000			ELSE
001010
001020          MOVE "CHIAVE-CAUS"	    TO NOME-VIEW
001030          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
001040
001050			IF ESITO-NOK
001060			 MOVE "ERRORE NON GESTITO CHIAVE-CAUS SU OPENRECA"
001070			 TO MESSAGGIO
001080			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001090			 GO TO EX-LOAD-VIEW
001100			END-IF
001110
001120*****  RECORD DA VARIARE
001130
001140			MOVE STRINGA-VIEW		TO CHIAVE-CAUS
001150
001160***** LOCK DEL RECORD
001170
001180			PERFORM LEGGO-CAUS  	THRU EX-LEGGO-CAUS.
001190
001200***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001210
001220
001230			MOVE "CA"				TO CHIAVE-DATO.
001240			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001250			IF ESITO-NOK GO TO FINE-VIEW.
001260
001270******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001280
001290 CICLO-VIEW.
001300
001310			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001320
001330          IF CHIAVE-DATO(1:2) NOT = "CA" MOVE "S" TO FINE-FILE.
001340
001350      	IF FINE-FILE = "S" GO TO FINE-VIEW.
001360		
001370*** IL PRIMO CAMPO  E' CAUSALE  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001380*
001390 CICLO-DATI-VIEW.
001400
001410			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001420
001430			IF CHIAVE-DATO(1:2) NOT = "CA" MOVE "S" TO FINE-FILE.
001440
001450			IF FINE-FILE = "S" GO TO FINE-VIEW.
001460
001470
001480
001490			PERFORM CARICA-DATO-WEB	THRU EX-CARICA-DATO-WEB.
001500
001501			IF USE-ARGUMENT = "S"
001510				MOVE ARGUMENT		TO CAUSALE(POS-DATO:SIZE-DATO).
001520
001540
001550
001560			GO TO CICLO-DATI-VIEW.
001570			 
001580
001590 FINE-VIEW.
001600
001610			IF SW-LAVORO = "INSERIMENTO"
001620			 CONTINUE
001630			ELSE
001640			PERFORM AGGIORNO-CAUS   THRU EX-AGGIORNO-CAUS
001650			 GO TO EX-LOAD-VIEW.
001660
001670 LOOP-VIEW.
001680
001690          perform SCRIVO-CAUS     THRU EX-SCRIVO-CAUS.
001700
001710          IF ESITO-NOK ADD 1 TO PROG-CAUS
001720             GO TO LOOP-VIEW.
001730
001740 EX-LOAD-VIEW.
001750          EXIT.
001760
