000010*
000020* Copyright (C) 2010-2022 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENTABE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300			COPY "SELJSON.CBL".
000310			COPY "SELMENU.CBL".
000320
000330
000340
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410			COPY "FDEJSON.CBL".
000420			COPY "FDEMENU.CBL".
000430
000440 WORKING-STORAGE  SECTION.
000450
000460          COPY "COBW3.CBL".
000470          COPY "GLOBALS.CBL".
000480          COPY "IMAGES.CBL".
000490*
000500 PROCEDURE  DIVISION.
000510*
000520          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000530
000540
000550                                             
000560
000570          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000580
000590          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000600
000610
000620			STRING "TABELLE" ".HTM"
000630			DELIMITED BY SIZE  INTO PAGE-WEB.
000640
000650          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000660
000670
000680 FINE.
000690          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000700          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000710
000720
000730          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000740
000750          GOBACK.
000760
000770          COPY "PIOWEB1.CBL".
000780          COPY "PIOVIEW.CBL".
000790          COPY "PIOTAB.CBL".
000800			COPY "PIOJSON.CBL".
000810			COPY "PIOMENU.CBL".
000820
000830 LOAD-VIEW.
000840
000850
000860		    INITIALIZE VIEW.
000870
000880          PERFORM OPEN-I-MENU  THRU EX-OPEN-I-MENU.
000890
000900			MOVE "TA"				TO MOD-MENU.
000910			MOVE ENTITA-WEB			TO ENT-MENU
000920			MOVE FUNZIONE-WEB		TO FUNZ-MENU
000930		    PERFORM LEGGO-SEC-MENU	THRU EX-LEGGO-SEC-MENU.
000940
000950			IF ESITO-NOK MOVE SPACES TO DESC-MENU.
000960
000970			CLOSE ARKMENU.
000980
000990          MOVE "MENU"             TO NOME-VIEW
001000		    MOVE DESC-MENU			TO STRINGA-VIEW.
001010          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001020
001030
001040          MOVE SPACES              TO STRINGA-VIEW.
001050
001060			STRING 
001070
001080			'<a href="opentabe.exe?MK-KEY='
001090			 SECTION-WEB DELIMITED BY SIZE
001100			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
001110			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
001120			'" class="easyui-linkbutton" data-options="iconCls:'
001130			"'icon-back'"
001140			'" style="padding:5px 0px;width:25%; margin-left:20px">'
001150			' <span style="font-size:14px;">Indietro</span></a>'  
001160			DELIMITED BY SIZE INTO STRINGA-VIEW.
001170            
001180
001190          MOVE "GOBACK"           TO NOME-VIEW
001200          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001210
001220
001230			STRING "TABELL" FUNZIONE-WEB 				
001240			DELIMITED BY SIZE INTO  NOME-JSON.
001250
001260          MOVE "FILE-JSON"        TO NOME-VIEW
001261
001262			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001270
001330
001340			MOVE ZEROS				TO CONTA.
001350
001360			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001370
001380			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001390			 OR CONTA(IND:1) > "0"
001400			 CONTINUE
001410			END-PERFORM.
001420
001430			STRING '{"total":' CONTA(IND:) ',"rows":['		
001440			DELIMITED BY SIZE INTO DATI-JSON.
001450			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001460
001470			MOVE SPACES				TO DATI-JSON.
001480
001490          MOVE LOW-VALUE          TO CHIAVE-TAB.
001500          MOVE FUNZIONE-WEB       TO TIPO-TAB.
001510          MOVE 1                  TO ENTE-TAB.
001520          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
001530
001540          if ESITO-NOK GO TO FINE-TABELLA.
001550
001560
001570 CICLO-TABELLA.
001580
001590			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
001600
001610			IF TIPO-TAB NOT = FUNZIONE-WEB MOVE "S" TO FINE-FILE.
001620
001630			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001640
001650			IF DATI-JSON > SPACES
001660			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001670
001680***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001690
001700			INSPECT TABELLA REPLACING ALL "\" BY " ".			
001710
001720				
001730**** ITEM
001740		
001750			STRING 
001760
001770			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001780			ELEMENTO-TAB    DELIMITED BY "   "
001790			'",'			DELIMITED BY SIZE
001800			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001810
001820**** ITEM
001830			STRING "        "
001840			'"DESC":"'	DELIMITED BY SIZE
001850			DESC-TAB        DELIMITED BY "     "
001860			'",'			DELIMITED BY SIZE
001870			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001880**** ITEM
001890			STRING "        "
001900			'"DESC1":"'	DELIMITED BY SIZE
001910			DESCR-TAB(1)    DELIMITED BY "     "
001920			'",'			DELIMITED BY SIZE
001930			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001940**** ITEM
001950			STRING "        "
001960			'"DESC2":"'	DELIMITED BY SIZE
001970			DESCR-TAB(2)    DELIMITED BY "     "
001980			'",'			DELIMITED BY SIZE
001990			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002000
002010**** ITEM
002020			STRING "        "
002030			'"' 		
002040			'CANCELLA":"'	DELIMITED BY SIZE
002050			'<a href=opencanc.exe?MK-KEY='
002060			 SECTION-WEB DELIMITED BY SIZE
002070			"&MK-ITEM=" DELIMITED BY SIZE
002080			CHIAVE-TAB  DELIMITED BY SIZE
002090			"&MK-FILE=TA" DELIMITED BY SIZE
002100			'>' delimited by size 
002110			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
002120				delimited by size 
002130			'",'			DELIMITED BY SIZE
002140			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002150**** ITEM
002160			STRING "        "
002170			'"' 		
002180			'MODIFICA":"'	DELIMITED BY SIZE
002190			'<a href=openmota.exe?MK-KEY='
002200			 SECTION-WEB DELIMITED BY SIZE
002210			"&MK-ITEM=" DELIMITED BY SIZE
002220			CHIAVE-TAB
002230			'>' delimited by size 
002240			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
002250				delimited by size 
002260          '"},' DELIMITED BY SIZE 
002270			into dati-JSON.
002280
002290
002300			GO TO CICLO-TABELLA.
002310
002320
002330 FINE-TABELLA.
002340
002350			INSPECT DATI-JSON REPLACING all "}, " BY
002360										    "}  ".
002370
002380			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002390
002400
002410			MOVE "]}"					TO DATI-JSON.
002420			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002430
002440			CLOSE ARKJSON.
002450
002460
002470 EX-LOAD-VIEW.
002480          EXIT.
002490
002500 CONTA-RECORD.
002510
002520          MOVE LOW-VALUE          TO CHIAVE-TAB.
002530          MOVE FUNZIONE-WEB		TO TIPO-TAB.
002540          MOVE 1                  TO ENTE-TAB.
002550          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
002560			
002570			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002580
002590 CICLO-CONTA-RECORD.
002600
002610			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
002620
002630			IF TIPO-TAB NOT = FUNZIONE-WEB  MOVE "S" TO FINE-FILE.
002640
002650			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002660
002670			ADD 1					TO CONTA.
002680
002690			GO TO CICLO-CONTA-RECORD.
002700
002710 EX-CONTA-RECORD.
002720			EXIT.
002730
