000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENRETA.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300			COPY "SELDATO.CBL".
000310
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360          COPY "FDEWEB.CBL".
000370          COPY "FDEVIEW.CBL".
000380          COPY "FDETAB.CBL".
000390			COPY "FDEDATO.CBL".
000400
000410 WORKING-STORAGE  SECTION.
000420
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000510          PERFORM OPEN-IO-TAB  THRU EX-OPEN-IO-TAB.
000520          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000530
000540          COPY "INIZIALI.CBL".
000550
000560
000570          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000580
000590          IF ESITO-NOK
000600          MOVE "ERRORE MEMORIZZAZIONE DATI TABELLE" TO MESSAGGIO
000610           ELSE
000620
000630			STRING "MEMORIZZATA TABELLA ENTE:" ENTE-TAB " TIPO: " TIPO-TAB
000640			" CODICE:" PROG-TAB "<P> " FILE-VIEW DELIMITED BY "  "
000641			"</p>"
000650              DELIMITED BY SIZE INTO MESSAGGIO
000660
000670          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000680
000690 FINE.
000700          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000710          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000720			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000730
000740          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000750
000760          GOBACK.
000770
000780          COPY "PIOWEB.CBL".
000790          COPY "PIOVIEW.CBL".
000800          COPY "PIOTAB.CBL".
000810			COPY "PIODATO.CBL".
000820
000830 LOAD-VIEW.
000840
000850          MOVE "LAVORO"   	     TO NOME-VIEW
000860          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000870
000880			MOVE STRINGA-VIEW		TO SW-LAVORO.
000890
000900			IF SW-LAVORO = "INSERIMENTO"
000910           INITIALIZE TABELLA
000920
000930          MOVE "TIPO-TAB" 	     TO NOME-VIEW
000940          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW
000950		
000960			IF ESITO-NOK
000970			 MOVE "ERRORE NON GESTITO TIPO-TAB SU OPENRETA"
000980			 TO MESSAGGIO
000990			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001000			 GO TO EX-LOAD-VIEW
001010			END-IF
001020
001030*****  TIPO RECORD DA INSERIRE
001040
001050			MOVE STRINGA-VIEW		TO TIPO-TAB
001060
001070          MOVE 1                  TO PROG-TAB
001080          MOVE 01                 TO ENTE-TAB
001090
001100			ELSE
001110
001120          MOVE "CHIAVE-TAB"	    TO NOME-VIEW
001130          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
001140
001150			IF ESITO-NOK
001160			 MOVE "ERRORE NON GESTITO CHIAVE-TAB SU OPENRETA"
001170			 TO MESSAGGIO
001180			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001190			 GO TO EX-LOAD-VIEW
001200			END-IF
001210
001220*****  RECORD DA VARIARE
001230
001240			MOVE STRINGA-VIEW		TO CHIAVE-TAB
001250
001260***** LOCK DEL RECORD
001270
001280			PERFORM LEGGO-TAB		THRU EX-LEGGO-TAB.
001290
001300***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001310
001320
001330			MOVE "TA"				TO CHIAVE-DATO.
001340			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001350			IF ESITO-NOK GO TO FINE-VIEW.
001360
001370******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001380
001390 CICLO-VIEW.
001400
001410			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001420
001430      	IF FINE-FILE = "S" GO TO FINE-VIEW.
001440		
001450			IF NOME-COBOL-DATO(1:9) NOT = "TABELLA-0" GO TO CICLO-VIEW.
001460			 
001470			IF NOME-COBOL-DATO(10:2) NOT = TIPO-TAB GO TO CICLO-VIEW.
001480*
001490*** IL PRIMO CAMPO  E' TABELLA-0XX  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001500*
001510 CICLO-DATI-VIEW.
001520
001530			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001540
001550			IF NOME-COBOL-DATO(1:9) = "TABELLA-0" MOVE "S" TO FINE-FILE.
001560
001570			IF FINE-FILE = "S" GO TO FINE-VIEW.
001580
001590          MOVE NOME-COBOL-DATO    TO FIELD-WEB.
001600
001610          PERFORM READ-WEB        THRU EX-READ-WEB.
001620
001630          IF COBW3-SEARCH-FLAG-EXIST
001640           MOVE VALUE-WEB         TO TABELLA(POS-DATO:SIZE-DATO).
001650
001660			GO TO CICLO-DATI-VIEW.
001670			 
001680
001690 FINE-VIEW.
001700
001710			IF SW-LAVORO = "INSERIMENTO"
001720			 CONTINUE
001730			ELSE
001740			PERFORM AGGIORNO-TAB	THRU EX-AGGIORNO-TAB
001750			 GO TO EX-LOAD-VIEW.
001760
001770 LOOP-VIEW.
001780
001790          perform SCRIVO-TAB      THRU EX-SCRIVO-TAB.
001800
001810          IF ESITO-NOK ADD 1 TO PROG-TAB
001820             GO TO LOOP-VIEW.
001830
001840 EX-LOAD-VIEW.
001850          EXIT.
001860
001870
001880 REPLACE-WEB.
001890*
001900** DICHIARATO IN COPY ANCHE SE NON SERVE VA SEMPRE ESPLICITATO
001910*
001920 EX-REPLACE-WEB.
001930          EXIT.
001940
