000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENPA88.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000260			COPY "SPECIAL.CBL".
000270
000280 INPUT-OUTPUT     SECTION.
000290 FILE-CONTROL.
000300
000310			COPY "SELWEB.CBL".
000311			COPY "SELVIEW.CBL".
000320		
000341 DATA             DIVISION.
000351 FILE SECTION.
000352
000360			COPY "FDEWEB.CBL".
000361			COPY "FDEVIEW.CBL".
000362
000370
000380 WORKING-STORAGE  SECTION.
000390
000400          COPY "COBW3.CBL".
000410          COPY "GLOBALS.CBL".
000420*
000430 PROCEDURE  DIVISION.
000440
000450*
000510			PERFORM INIZIO-WEB     THRU EX-INIZIO-WEB.
000511
000624
000625			MOVE "MK-PAGINA"    TO FIELD-WEB
000626	        PERFORM READ-WEB    THRU EX-READ-WEB
000627			MOVE VALUE-WEB      TO FILE-WEB
000628
000629
000630			OPEN INPUT ARKWEB.
000631
000632			IF STATUS-WEB NOT = "00" GO TO FINE.
000633
000634
000635			PERFORM LOAD-VIEW	THRU EX-LOAD-VIEW.
000636
000637
000638          MOVE "TEMPLATE/OPENEDIT.HTM" 	  TO PAGE-WEB.
000639
000640          PERFORM MAKE-WEB    			  THRU EX-MAKE-WEB.
000641
000642
000643 FINE.
000644
000645
000646			PERFORM FINE-WEB	THRU EX-FINE-WEB.
000647
000648          GOBACK.
000649
000650          COPY "PIOWEB1.CBL".
000651			COPY "PIOVIEW.CBL".
000652
000653
000654 LOAD-VIEW.
000656
000657
000658			PERFORM VARYING CONTA FROM 1 BY 1 UNTIL CONTA > 200
000659
000660
000661			MOVE CONTA 				TO NOME-VIEW
000662			PERFORM CANCELLO-VIEW 	THRU EX-CANCELLO-VIEW
000663
000664			END-PERFORM.
000665
000666			MOVE ZEROS				TO CONTA.
000668
000669 CICLO.
000670
000671			READ ARKWEB NEXT RECORD AT END GO TO MOSTRA.
000672
000673
000674			IF DATI-WEB = SPACES GO TO CICLO.
000675
000676			ADD 1				TO CONTA.
000677
000678			INITIALIZE VIEW.
000679
000680			MOVE CONTA 			TO NOME-VIEW.
000681
000682			MOVE DATI-WEB		TO STRINGA-VIEW.
000683
000684			PERFORM SCRITTURA-VIEW	THRU EX-SCRITTURA-VIEW.
000685
000686			GO TO CICLO.
000687
000688 MOSTRA.			
000689
000690			CLOSE ARKWEB.
000691
000692 EX-LOAD-VIEW.
000693
000694			EXIT.
000695
000696
