000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENCART.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELMATR.CBL".
000300			COPY "SELJSON.CBL".
000310			COPY "SELTAB.CBL".
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360			COPY "FDETAB.CBL".
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDEMATR.CBL".
000400			COPY "FDEJSON.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430 77 CAPO      PIC X(6).
000440 77 ELEMENTO  PIC X(6).
000450 77 IO        PIC 9(7).
000460
000470          COPY "COBW3.CBL".
000480          COPY "GLOBALS.CBL".
000490          COPY "IMAGES.CBL".
000500*
000510 PROCEDURE  DIVISION.
000520*
000530          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000540
000550
000560                                             
000570
000580          PERFORM OPEN-I-MATR  THRU EX-OPEN-I-MATR.
000590          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000600
000627
000628			PERFORM LEGGO-MATR		THRU EX-LEGGO-MATR.
000629
000630
000640			MOVE "MATRICOLA"		TO NOME-VIEW
000650			PERFORM LEGGO-VIEW   	THRU EX-LEGGO-VIEW.
000660		    MOVE NUMERO-VIEW      	TO PROG-MATR.
000670			MOVE 01					TO ENTE-MATR.
000680		
000690			PERFORM LEGGO-MATR		THRU EX-LEGGO-MATR.
000700
000710			IF ESITO-NOK INITIALIZE MATRICOLA.
000720
000730          MOVE PROG-MATR          TO IO.
000740
000750		    initialize view.
000760
000770			MOVE COGNOME-MATR		TO STRINGA-VIEW.
000780          MOVE "COGNOME" 	        TO NOME-VIEW
000790			MOVE "X"				TO TIPO-VIEW
000800          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
000810
000820			MOVE NOME-MATR			TO STRINGA-VIEW.
000830          MOVE "NOME" 	        TO NOME-VIEW
000840          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
000850
000860
000870			MOVE CAPO-MATR     		TO STRINGA-VIEW.
000880          MOVE "SUPERIORE" 	    TO NOME-VIEW
000890          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
000900			
000910          MOVE SPACES             TO CAPO.
000920          MOVE "43"               TO TIPO-TAB.
000930          MOVE SPACES             TO ELEMENTO-TAB.
000940          MOVE 01                 TO ENTE-TAB.
000950          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
000960          IF ESITO-NOK GO TO FINE-LETTURA-TAB.
000970          
000980 CICLO-LETTURA-TAB.
000990
001000          PERFORM LEGGO-NEXT-TAB  THRU EX-LEGGO-NEXT-TAB.
001010          
001020          IF TIPO-TAB NOT = "43" MOVE "S" TO FINE-FILE.
001030          
001040          IF FINE-FILE = "S" GO TO FINE-LETTURA-TAB.
001050          
001060          IF MATR-043 = PROG-MATR   
001070            MOVE ELEMENTO-TAB     TO CAPO
001080            GO TO FINE-LETTURA-TAB.
001090            
001100          GO TO CICLO-LETTURA-TAB.
001110          
001120 FINE-LETTURA-TAB.
001130
001131			IF UTENTE-WEB = "ADMIN"
001132			MOVE "S" 				TO ADMIN-MATR.
001133 
001140          IF ADMIN-MATR = "S" MOVE "ZZZZZZ" TO CAPO.
001150
001160
001170          move capo-matr		    TO ELEMENTO-TAB.
001180			MOVE "43"				TO TIPO-TAB.
001190          MOVE 01                 TO ENTE-TAB.
001200          PERFORM LEGGO-TAB       THRU EX-LEGGO-TAB.
001210          
001220          IF ESITO-NOK MOVE SPACES TO TABELLA.
001230
001240			MOVE DESC-TAB    		TO STRINGA-VIEW.
001250			MOVE CAPO-MATR     		TO STRINGA-VIEW.
001260          MOVE "CAPO"      	    TO NOME-VIEW
001270          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001280
001290
001300
001310          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
001320
001330			MOVE "SELEZION.HTM" TO PAGE-WEB.
001340
001350          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
001360
001370
001380 FINE.
001390          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
001400          PERFORM CLOSE-MATR   THRU EX-CLOSE-MATR.
001410          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
001420
001430          PERFORM FINE-WEB     THRU EX-FINE-WEB.
001440
001450          GOBACK.
001460
001470          COPY "PIOWEB1.CBL".
001480          COPY "PIOVIEW.CBL".
001490			COPY "PIOJSON.CBL".
001500          COPY "PIOMATR.CBL".
001510			COPY "PIOTAB.CBL".
001520
001530 LOAD-VIEW.
001540
001550
001560 			STRING "SELEZIONA" FUNZIONE-WEB 				
001570			DELIMITED BY SIZE INTO  NOME-JSON.
001580
001590          MOVE "FILE-JSON-MATR"   TO NOME-VIEW
001600
001610
001620			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001630
001640
001650			MOVE "[{"			TO DATI-JSON.
001660
001670
001680			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001690
001700			MOVE SPACES				TO DATI-JSON.
001710
001720          MOVE LOW-VALUE          	TO 	MATRICOLA.
001730          PERFORM STARTO-NOME-MATR    THRU EX-STARTO-NOME-MATR.
001740
001750          if ESITO-NOK GO TO FINE-TABELLA.
001760
001770
001780
001790
001800 CICLO-TABELLA.
001810
001820			PERFORM LEGGO-NEXT-MATR THRU EX-LEGGO-NEXT-MATR.
001830
001840			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001850
001860
001870			IF ELIMINATO-MATR = "S" GO TO CICLO-TABELLA.
001880
001890          IF PROG-MATR = IO GO TO AHEAD.
001900          
001910          IF CAPO = "ZZZZZZ" GO TO AHEAD.
001920
001930          IF CAPO-MATR NOT = CAPO 
001940           AND PROG-MATR NOT = IO
001950           GO TO CICLO-TABELLA.
001960
001970 AHEAD.
001980
001990			IF DATI-JSON > SPACES
002000			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002010
002020***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
002030
002040			INSPECT MATRICOLA REPLACING ALL "\" BY " ".			
002050
002060				
002070**** ITEM
002080		
002090			STRING 
002100
002110			' "ID":"'	DELIMITED BY SIZE
002120			PROG-MATR     DELIMITED BY "   "
002130			'",'			DELIMITED BY SIZE
002140			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002150
002160**** ITEM
002170			STRING "        "
002180			'"NOME":"'	DELIMITED BY SIZE
002190          COGNOME-MATR DELIMITED BY "   "
002200			" " NOME-MATR DELIMITED BY  "   "
002220			'",'			DELIMITED BY SIZE
002230			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002240**** ITEM
002250			STRING "        "
002260			'"BADGE":"'	DELIMITED BY SIZE
002270			BADGE-MATR      DELIMITED BY "     "
002280			'",'			DELIMITED BY SIZE
002290			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002300**** ITEM
002310			STRING "        "
002320			'"CF":"'	DELIMITED BY SIZE
002330			CF-MATR         DELIMITED BY "     "
002340			'"'				DELIMITED BY SIZE
002350			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002360
002370
002380			MOVE "},{"		TO DATI-JSON.
002390
002400
002410			GO TO CICLO-TABELLA.
002420
002430
002440 FINE-TABELLA.
002450
002460
002470
002480			MOVE "}]"					TO DATI-JSON.
002490			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002500
002510			CLOSE ARKJSON.
002520
002530
002540 EX-LOAD-VIEW.
002550          EXIT.
002560
002570 CONTA-RECORD.
002580
002590          MOVE LOW-VALUE          TO CHIAVE-MATR.
002600          PERFORM STARTO-MATR     THRU EX-STARTO-MATR.
002610			
002620			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002630
002640 CICLO-CONTA-RECORD.
002650
002660			PERFORM LEGGO-NEXT-MATR THRU EX-LEGGO-NEXT-MATR.
002670
002680			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002690
002700			ADD 1					TO CONTA.
002710
002720			GO TO CICLO-CONTA-RECORD.
002730
002740 EX-CONTA-RECORD.
002750			EXIT.
002760
