000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENRECA.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300          COPY "SELUTEN.CBL".
000310		                                   
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEUTEN.CBL".
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410		                                   
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000570                                             
000520
000530          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000540          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000550          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000560
000580
000590          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000600
000610          IF ESITO-NOK
000620          MOVE "ERRORE MEMORIZZAZIONE DATI UTENTE" TO MESSAGGIO
000630           ELSE
000640          MOVE "MEMORIZZAZIONE UTENTE EFFETTUATA"  TO MESSAGGIO.
000650
000660          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000670
000680 FINE.
000690          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000700          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000710			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000720          PERFORM CLOSE-UTEN   THRU EX-CLOSE-UTEN.
000730
000740          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000750
000760          GOBACK.
000770
000780          COPY "PIOWEB1.CBL".
000790          COPY "PIOVIEW.CBL".
000800          COPY "PIOTAB.CBL".
000810			COPY "PIODATO.CBL".
000820          COPY "PIOUTEN.CBL".
000830			COPY "PCARIWEB.CBL".
000840
000850 LOAD-VIEW.
000860
000870          MOVE "LAVORO"   	     TO NOME-VIEW
000880          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000890
000900			MOVE STRINGA-VIEW		TO SW-LAVORO.
000910
000920			IF SW-LAVORO = "INSERIMENTO"
000930           INITIALIZE UTENTE
000940		
000950
000960*****  TIPO RECORD DA INSERIRE
000970
000980
000990			ELSE
001000
001010          MOVE "CHIAVE-UTEN"	    TO NOME-VIEW
001020          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
001030
001040			IF ESITO-NOK
001050			 MOVE "ERRORE NON GESTITO CHIAVE-CAUS SU OPENRECA"
001060			 TO MESSAGGIO
001070			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001080			 GO TO EX-LOAD-VIEW
001090			END-IF
001100
001110*****  RECORD DA VARIARE
001120
001130			MOVE STRINGA-VIEW		TO CHIAVE-UTEN
001140
001150***** LOCK DEL RECORD
001160
001170			PERFORM LEGGO-PROG-UTEN THRU EX-LEGGO-PROG-UTEN.
001180
001190***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001200
001210
001220			MOVE "UT"				TO CHIAVE-DATO.
001230			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001240			IF ESITO-NOK GO TO FINE-VIEW.
001250
001260******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001270
001280 CICLO-VIEW.
001290
001300			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001310
001320          IF CHIAVE-DATO(1:2) NOT = "UT" MOVE "S" TO FINE-FILE.
001330
001340      	IF FINE-FILE = "S" GO TO FINE-VIEW.
001350		
001360*** IL PRIMO CAMPO  E' CAUSALE  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001370*
001380 CICLO-DATI-VIEW.
001390
001400			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001410
001420			IF CHIAVE-DATO(1:2) NOT = "UT" MOVE "S" TO FINE-FILE.
001430
001440			IF FINE-FILE = "S" GO TO FINE-VIEW.
001450
001460          PERFORM CARICA-DATO-WEB	THRU EX-CARICA-DATO-WEB.
                
                IF USE-ARGUMENT = "S"
001480			MOVE ARGUMENT			TO UTENTE(POS-DATO:SIZE-DATO).
001490
001500			GO TO CICLO-DATI-VIEW.
001510			 
001520
001530 FINE-VIEW.
001540
001550			IF PASSWORD-UTEN = SPACES
001560			MOVE "xAjw9uO0sVurA"	TO PASSWORD-UTEN
001570			MOVE 1                  TO VOLTE-UTEN.
001580
001590
001600			IF SW-LAVORO = "INSERIMENTO"
001610			 CONTINUE
001620			ELSE
001630			PERFORM AGGIORNO-UTEN   THRU EX-AGGIORNO-UTEN
001640			 GO TO EX-LOAD-VIEW.
001650
001660			
001670
001680			MOVE 1000				TO PROG-UTEN.
001690
001700
001710
001720 LOOP-VIEW.
001730
001740          perform SCRIVO-UTEN     THRU EX-SCRIVO-UTEN.
001750
001760          IF ESITO-NOK ADD 1 TO PROG-UTEN
001770             GO TO LOOP-VIEW.
001780
001790 EX-LOAD-VIEW.
001800          EXIT.
001810
