000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENMENU.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000260			COPY "SPECIAL.CBL".
000270
000280 INPUT-OUTPUT     SECTION.
000290 FILE-CONTROL.
000300
000310			COPY "SELWEB.CBL".
000311			COPY "SELVIEW.CBL".
000320		
000341 DATA             DIVISION.
000351 FILE SECTION.
000352
000360			COPY "FDEWEB.CBL".
000361			COPY "FDEVIEW.CBL".
000362
000370
000380 WORKING-STORAGE  SECTION.
000390
000400          COPY "COBW3.CBL".
000410          COPY "GLOBALS.CBL".
000420*
000430 PROCEDURE  DIVISION.
000440
000450*
000510			PERFORM START-WEB		THRU EX-START-WEB.
000511
000512
000520          MOVE "PATH-FILE"    	TO FIELD-WEB
000530          PERFORM READ-WEB    	THRU EX-READ-WEB
000540
000550			IF VALUE-WEB = SPACES
000560			MOVE "FILES/"			TO PATH-WEB
000570			ELSE
000580			MOVE VALUE-WEB			TO PATH-WEB.
000590
000600
000601			MOVE FIELD-WEB	       	TO COBW3-CNV-NAME.
000602			MOVE PATH-WEB 		   	TO COBW3-CNV-VALUE.
000603			MOVE 0            		TO COBW3-CNV-NAME-LENGTH.
000604			MOVE 0            		TO COBW3-CNV-VALUE-LENGTH.
000605			CALL "COBW3_CNV_SET" USING COBW3.
000606			MOVE SPACES       		TO COBW3-CNV-VALUE.
000610
000620                               
000630          MOVE "TEMPLATE/OPENINIZ.HTM" 	  TO COBW3-HTML-FILENAME.
000631
000650			CALL "COBW3_PUT_HTML" USING COBW3.
000660
000661 FINE.
000670	        CALL  "COBW3_FREE"    USING  COBW3 .
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB1.CBL".
000720			COPY "PIOVIEW.CBL".
