000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENINSE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000310
000320 DATA             DIVISION.
000330 FILE SECTION.
000340
000350          COPY "FDEWEB.CBL".
000360          COPY "FDEVIEW.CBL".
000370
000380 WORKING-STORAGE  SECTION.
000390
000400          COPY "COBW3.CBL".
000410          COPY "GLOBALS.CBL".
000420          COPY "IMAGES.CBL".
000430*
000440 PROCEDURE  DIVISION.
000450*
000460          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000470
000480
000481                                             
000490
000494
000495
000496			MOVE "MK-FILE"        	TO FIELD-WEB
000497			PERFORM READ-WEB     	THRU EX-READ-WEB
000498		    MOVE VALUE-WEB       	TO AZZERA-WEB.
000499
000500			IF AZZERA-WEB = SPACES
000501			MOVE "TA"		        TO AZZERA-WEB.
000502
000503		    PERFORM AZZERA-VIEW     THRU EX-AZZERA-VIEW.
000506
000510          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000520
000530			MOVE SPACES			 TO PAGE-WEB
000550
000551
000552			STRING "INSE" ENTITA-WEB FUNZIONE-WEB ".HTM"
000553		      DELIMITED BY SIZE INTO PAGE-WEB
000980
000990          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
001000
001010
001020 FINE.
001030          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
001040
001050          PERFORM FINE-WEB     THRU EX-FINE-WEB.
001060
001070          GOBACK.
001080
001090          COPY "PIOWEB1.CBL".
001100          COPY "PIOVIEW.CBL".
001120
001200
001210 LOAD-VIEW.
001220
001230          MOVE "INSERIMENTO"              TO STRINGA-VIEW
001240          MOVE "LAVORO"           		TO NOME-VIEW
001250          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW.
001260   
001261          MOVE FUNZIONE-WEB       		TO STRINGA-VIEW
001262          MOVE "TIPO-TAB"         		TO NOME-VIEW
001263          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW .
001264
001265
001270
001280 EX-LOAD-VIEW.
001281			EXIT.
001290
001300
001310 AZZERA-VIEW.
001320
001330			MOVE AZZERA-WEB				TO CHIAVE-DATO-VIEW.
001340			PERFORM STARTO-DATO-VIEW	THRU EX-STARTO-DATO-VIEW.
001350			IF ESITO-NOK GO TO EX-AZZERA-VIEW.
001360
001370 CICLO-AZZERA-VIEW.
001380
001390			PERFORM LEGGO-NEXT-VIEW THRU EX-LEGGO-NEXT-VIEW.
001400
001410			IF CHIAVE-DATO-VIEW(1:2) NOT = AZZERA-WEB MOVE "S" TO FINE-FILE.
001420
001430			IF FINE-FILE = "S" GO TO EX-AZZERA-VIEW.
001440
001450			IF CHIAVE-DATO-VIEW(1:2) = AZZERA-WEB
001460			 PERFORM CANCELLO-VIEW	THRU EX-CANCELLO-VIEW.
001470
001480			GO TO CICLO-AZZERA-VIEW.
001490
001500 EX-AZZERA-VIEW.
001510			EXIT.
