000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENIND.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELIND.CBL".
000300			COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDEIND.CBL".
000400			COPY "FDEJSON.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520
000530                                             
000540
000550          PERFORM OPEN-I-IND  THRU EX-OPEN-I-IND.
000560
000570
000580          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000590
000600			MOVE "INDENNITA.HTM" TO PAGE-WEB.
000610
000620          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000630
000640
000650 FINE.
000660          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000670          PERFORM CLOSE-IND   THRU EX-CLOSE-IND.
000680
000690          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000700
000710          GOBACK.
000720
000730          COPY "PIOWEB1.CBL".
000740          COPY "PIOVIEW.CBL".
000750			COPY "PIOJSON.CBL".
000760          COPY "PIOIND.CBL".
000770
000780 LOAD-VIEW.
000790
000800
000810
000820          MOVE SPACES              TO STRINGA-VIEW.
000830
000840
000850			STRING 
000860
000870			'<a href="openind.exe?MK-KEY='
000880			 SECTION-WEB DELIMITED BY SIZE
000890			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000900			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000910			'" class="easyui-linkbutton" data-options="iconCls:'
000920			"'icon-undo'"
000930			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000940			' <span style="font-size:14px;">Indietro</span></a>'  
000950			DELIMITED BY SIZE INTO STRINGA-VIEW.
000960            
000970
000980          MOVE "GOBACK"           TO NOME-VIEW
000990          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001000
001010
001020			STRING "INDENNITA" FUNZIONE-WEB 				
001030			DELIMITED BY SIZE INTO  NOME-JSON.
001040
001041          MOVE "FILE-JSON"        TO NOME-VIEW
001042
001050			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001060
001090
001120
001130			MOVE ZEROS				TO CONTA.
001140
001150			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001160
001170			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001180			 OR CONTA(IND:1) > "0"
001190			 CONTINUE
001200			END-PERFORM.
001210
001220			STRING '{"total":' CONTA(IND:) ',"rows":['		
001230			DELIMITED BY SIZE INTO DATI-JSON.
001240			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001250
001260			MOVE SPACES				TO DATI-JSON.
001270
001280          MOVE LOW-VALUE          TO CHIAVE-IND.
001290          PERFORM STARTO-IND     THRU EX-STARTO-IND.
001300
001310          if ESITO-NOK GO TO FINE-TABELLA.
001320
001330
001340 CICLO-TABELLA.
001350
001360			PERFORM LEGGO-NEXT-IND THRU EX-LEGGO-NEXT-IND.
001370
001380			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001390
001400			IF DATI-JSON > SPACES
001410			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001420
001430***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001440
001450			INSPECT INDENNITA REPLACING ALL "\" BY " ".			
001460
001470				
001480**** ITEM
001490		
001500			STRING 
001510
001520			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001530			PROG-IND     DELIMITED BY "   "
001540			'",'			DELIMITED BY SIZE
001550			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001560
001570**** ITEM
001580			STRING "        "
001590			'"DESC":"'	DELIMITED BY SIZE
001600			DESC-IND       DELIMITED BY "     "
001610			'",'			DELIMITED BY SIZE
001620			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001630**** ITEM
001640			STRING "        "
001650			'"DESC1":"'	DELIMITED BY SIZE
001660			LIV-IND       DELIMITED BY "     "
001670			'",'			DELIMITED BY SIZE
001680			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001690**** ITEM
001700			STRING "        "
001710			'"DESC2":"'	DELIMITED BY SIZE
001720			CAUS-IND      DELIMITED BY "     "
001730			'",'			DELIMITED BY SIZE
001740			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001750**** ITEM
001760			STRING "        "
001770			'"' 		
001780			'CANCELLA":"'	DELIMITED BY SIZE
001790			'<a href=opencanc.exe?MK-KEY='
001800			 SECTION-WEB DELIMITED BY SIZE
001810			"&MK-ITEM=" DELIMITED BY SIZE
001820			CHIAVE-IND
001830			"&MK-FILE=CA" DELIMITED BY SIZE
001840			'>' delimited by size 
001850			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001860				delimited by size 
001870			'",'			DELIMITED BY SIZE
001880			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001890**** ITEM
001900			STRING "        "
001910			'"' 		
001920			'MODIFICA":"'	DELIMITED BY SIZE
001930			'<a href=openmoca.exe?MK-KEY='
001940			 SECTION-WEB DELIMITED BY SIZE
001950			"&MK-ITEM=" DELIMITED BY SIZE
001960			CHIAVE-IND  DELIMITED BY SIZE
001970			'>' delimited by size 
001980			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001990				delimited by size 
002000          '"},' DELIMITED BY SIZE 
002010			into dati-JSON.
002020
002030
002040			GO TO CICLO-TABELLA.
002050
002060
002070 FINE-TABELLA.
002080
002090			INSPECT DATI-JSON REPLACING all "}, " BY
002100										    "}  ".
002110
002120			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002130
002140
002150			MOVE "]}"					TO DATI-JSON.
002160			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002170
002180			CLOSE ARKJSON.
002190
002200
002210 EX-LOAD-VIEW.
002220          EXIT.
002230
002240 CONTA-RECORD.
002250
002260          MOVE LOW-VALUE          TO CHIAVE-IND.
002270          PERFORM STARTO-IND     THRU EX-STARTO-IND.
002280			
002290			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002300
002310 CICLO-CONTA-RECORD.
002320
002330			PERFORM LEGGO-NEXT-IND THRU EX-LEGGO-NEXT-IND.
002340
002350			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002360
002370			ADD 1					TO CONTA.
002380
002390			GO TO CICLO-CONTA-RECORD.
002400
002410 EX-CONTA-RECORD.
002420			EXIT.
002430
002440
