000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENORAR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELORA.CBL".
000300		    COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDEORA.CBL".
000400		    COPY "FDEJSON.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520                                             
000530
000540
000550          PERFORM OPEN-I-ORA  THRU EX-OPEN-I-ORA.
000560
000570          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000580
000590		    MOVE "ORARI.HTM" TO PAGE-WEB.
000600
000610          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000620
000630
000640 FINE.
000650          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000660          PERFORM CLOSE-ORA   THRU EX-CLOSE-ORA.
000670
000680          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000690
000700          GOBACK.
000710
000720          COPY "PIOWEB1.CBL".
000730          COPY "PIOVIEW.CBL".
000740  	    COPY "PIOJSON.CBL".
000750          COPY "PIOORA.CBL".
000760
000770 LOAD-VIEW.
000780
000790          MOVE SPACES             TO STRINGA-VIEW.
000800
000810
000820			STRING
000830
000840			'<a href="openorar.exe?MK-KEY='
000850			 SECTION-WEB DELIMITED BY SIZE
000860			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000870			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000880			'" class="easyui-linkbutton" data-options="iconCls:'
000890			"'icon-undo'"
000900			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000910			' <span style="font-size:14px;">Indietro</span></a>'
000920			DELIMITED BY SIZE INTO STRINGA-VIEW.
000930
000940
000950           MOVE "GOBACK"           TO NOME-VIEW
000960           PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000970
000980
000990			STRING "ORARI" FUNZIONE-WEB 				
001000			DELIMITED BY SIZE INTO  NOME-JSON.
001010
001011          MOVE "FILE-JSON"        TO NOME-VIEW
001012
001020			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001030
001060
001090
001100			MOVE ZEROS				TO CONTA.
001110
001120			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001130
001140			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001150			 OR CONTA(IND:1) > "0"
001160			 CONTINUE
001170			END-PERFORM.
001180
001190			STRING '{"total":' CONTA(IND:) ',"rows":['		
001200			DELIMITED BY SIZE INTO DATI-JSON.
001210			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001220
001230			MOVE SPACES				TO DATI-JSON.
001240
001250           MOVE LOW-VALUE          TO CHIAVE-ORA.
001260           PERFORM STARTO-ORA     THRU EX-STARTO-ORA.
001270
001280           if ESITO-NOK GO TO FINE-TABELLA.
001290
001300
001310 CICLO-TABELLA.
001320
001330			PERFORM LEGGO-NEXT-ORA THRU EX-LEGGO-NEXT-ORA.
001340
001350			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001360
001370			IF DATI-JSON > SPACES
001380			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001390
001400***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001410
001420			INSPECT ORARIO REPLACING ALL "\" BY " ".			
001430
001440				
001450**** ITEM
001460		
001470			STRING
001480
001490			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001500			CODICE-ORA   DELIMITED BY "   "
001510			'",'			DELIMITED BY SIZE
001520			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001530
001540**** ITEM
001550			STRING "        "
001560			'"DESC":"'	DELIMITED BY SIZE
001570			DESC-ORA       DELIMITED BY "     "
001580			'",'			DELIMITED BY SIZE
001590			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001600**** ITEM
001610			STRING "        "
001620			'"TIPO":"'	DELIMITED BY SIZE
001630			TIPO-ORA       DELIMITED BY "     "
001640			'",'			DELIMITED BY SIZE
001650			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001660**** ITEM
001670			STRING "        "
001680			'"DESC1":"'	DELIMITED BY SIZE
001690			TESTO-ORA      DELIMITED BY "     "
001700			'",'			DELIMITED BY SIZE
001710			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001720**** ITEM
001730			STRING "        "
001740			'"' 		
001750			'CANCELLA":"'	DELIMITED BY SIZE
001760			'<a href=opencanc.exe?MK-KEY='
001770			 SECTION-WEB DELIMITED BY SIZE
001780			"&MK-ITEM=" DELIMITED BY SIZE
001790			CHIAVE-ORA
001800			"&MK-FILE=OR" DELIMITED BY SIZE
001810			'>' delimited by size
001820			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001830				delimited by size
001840			'",'			DELIMITED BY SIZE
001850			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001860**** ITEM
001870			STRING "        "
001880			'"' 		
001890			'MODIFICA":"'	DELIMITED BY SIZE
001900			'<a href=openmoor.exe?MK-KEY='
001910			 SECTION-WEB DELIMITED BY SIZE
001920			"&MK-ITEM=" DELIMITED BY SIZE
001930			CHIAVE-ORA
001940			'>' delimited by size
001950			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001960				delimited by size
001970          '"},' DELIMITED BY SIZE
001980			into dati-JSON.
001990
002000
002010			GO TO CICLO-TABELLA.
002020
002030
002040 FINE-TABELLA.
002050
002060			INSPECT DATI-JSON REPLACING all "}, " BY
002070										    "}  ".
002080
002090			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002100
002110
002120			MOVE "]}"					TO DATI-JSON.
002130			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002140
002150			CLOSE ARKJSON.
002160
002170
002180 EX-LOAD-VIEW.
002190          EXIT.
002200
002210 CONTA-RECORD.
002220
002230          MOVE LOW-VALUE          TO CHIAVE-ORA.
002240          PERFORM STARTO-ORA     THRU EX-STARTO-ORA.
002250			
002260			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002270
002280 CICLO-CONTA-RECORD.
002290
002300			PERFORM LEGGO-NEXT-ORA THRU EX-LEGGO-NEXT-ORA.
002310
002320			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002330
002340			ADD 1					TO CONTA.
002350
002360			GO TO CICLO-CONTA-RECORD.
002370
002380 EX-CONTA-RECORD.
002390			EXIT.
002400
