000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENPA10.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000260			COPY "SPECIAL.CBL".
000270
000280 INPUT-OUTPUT     SECTION.
000290 FILE-CONTROL.
000300
000310          COPY "SELWEB.CBL".
000320	     	COPY "SELVIEW.CBL".
000330			COPY "SELUTEN.CBL".
000340		
000350
000360 DATA             DIVISION.
000370 FILE SECTION.
000380
000390          COPY "FDEWEB.CBL".
000400			COPY "FDEUTEN.CBL".
000410	        COPY "FDEVIEW.CBL".
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470			COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500
000510 DECLARATIVES.
000520 ERROR-ARCHIVIO SECTION.
000530			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW.
000540 EX-ERRORE-ARCHIVIO.
000550			EXIT.
000560 END DECLARATIVES.
000570
000580*
000590          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000600
000710
000711			                                   
000712
000720          PERFORM OPEN-IO-UTEN  THRU EX-OPEN-IO-UTEN.
000730
000800          MOVE "UTENTE"         TO	NOME-VIEW
000810          PERFORM LEGGO-VIEW    THRU EX-LEGGO-VIEW.
000820
000830          MOVE STRINGA-VIEW     TO NOME-UTEN.
000840          PERFORM LEGGO-UTEN    THRU EX-LEGGO-UTEN.
000850          
000860           IF ESITO-NOK
000870            STRING "SESSIONE SCADUTA O UTENTE NON LOGGATO:" CHIAVE-UTEN
000880			  DELIMITED BY SIZE INTO MESSAGGIO
000890            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
000900           GO TO FINE.
000910
000920			MOVE "PASSWORD"  	TO FIELD-WEB
000930	        PERFORM READ-WEB    THRU EX-READ-WEB
000940			MOVE VALUE-WEB      TO FIELD-WEB.
000950          PERFORM SHA-WEB     THRU EX-SHA-WEB.
000960          
000970
000980          
000990          IF VALUE-WEB NOT = PASSWORD-UTEN
001000			OR PASSWORD-UTEN = SPACES
001010          MOVE "ERRORE LOGIN UTENTE" TO MESSAGGIO
001020          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
001030			GO TO FINE.
001040              
001050
001060			MOVE "PASSWORD1" 	TO FIELD-WEB
001070	        PERFORM READ-WEB    THRU EX-READ-WEB
001080          MOVE VALUE-WEB      TO ARGUMENT.
001090
001100          
001110			MOVE "PASSWORD2" 	TO FIELD-WEB
001120	        PERFORM READ-WEB    THRU EX-READ-WEB
001130
001140          IF VALUE-WEB NOT = ARGUMENT
001150          MOVE "LE nuove password devono essere UGUALI" TO MESSAGGIO
001160          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
001170			GO TO FINE.
001180
001190			MOVE VALUE-WEB      TO FIELD-WEB.
001200          PERFORM SHA-WEB     THRU EX-SHA-WEB.
001201
001202			IF VALUE-WEB = PASSWORD-UTEN
001210          MOVE "La password deve essere DIVERSA DALL'ATTUALE" TO MESSAGGIO
001211          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
001212			GO TO FINE.
001213
001220          move VALUE-WEB      TO PASSWORD-UTEN
001221
001222
001223
001224          MOVE "OGGI"         TO	NOME-VIEW
001225          PERFORM LEGGO-VIEW  THRU EX-LEGGO-VIEW.
001226
001227          MOVE STRINGA-VIEW	TO DATA-SCAD-UTEN.
001228
001230
001231			IF NO-SCADE-UTEN = "S"
001232			MOVE 20501231		TO DATA-SCAD-UTEN
001233			ELSE
001234			MOVE "N"			TO NO-SCADE-UTEN 
001235			ADD 6				TO MM-SCAD-UTEN
001236
001237			IF MM-SCAD-UTEN > 12
001238			ADD 1				TO AA-SCAD-UTEN
001239			COMPUTE MM-SCAD-UTEN =  MM-SCAD-UTEN  - 12.
001240
001241
001242			PERFORM AGGIORNO-UTEN THRU EX-AGGIORNO-UTEN.
001250
001251			MOVE "AGGIORNATA PASSWORD UTENTE RI-ESEGUI LOGIN" TO MESSAGGIO.
001252
001260			MOVE MESSAGGIO      TO VALUE-WEB.
001270			MOVE "MK-MESSAGE"   TO FIELD-WEB.
001280			PERFORM METTI-WEB   THRU EX-METTI-WEB.
001290
001350			MOVE "TEMPLATE/LOGOUT.HTM"  TO PAGE-WEB.
001360			PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001370
001380 FINE.
001390		
001400			PERFORM CLOSE-UTEN	THRU EX-CLOSE-UTEN.
001410          
001420
001430 USCITA.
001440			PERFORM CLOSE-VIEW	THRU EX-CLOSE-VIEW.
001450
001460	        PERFORM FINE-WEB     THRU EX-FINE-WEB.
001470
001480          GOBACK.
001490
001500			COPY "PIOUTEN.CBL".
001510	    	COPY "PIOWEB1.CBL".
001520         	COPY "PIOVIEW.CBL".
001530
001540 
001550
