000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENLOGS.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290			COPY "SELJSON.CBL".
000300
000310
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360          COPY "FDEWEB.CBL".
000370          COPY "FDEVIEW.CBL".
000380			COPY "FDEJSON.CBL".
000390
000400 WORKING-STORAGE  SECTION.
000410
000420          COPY "COBW3.CBL".
000430          COPY "GLOBALS.CBL".
000440          COPY "IMAGES.CBL".
000450*
000460 PROCEDURE  DIVISION.
000470*
000480          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000490
000500
000510                                             
000520
000530**** VA CHIUSO VIENE SEMPRE GIA' APERTO IN EXPAND DA INIZIALI....
000540
000550          CLOSE ARKLOG.
000560          OPEN INPUT ARKLOG.
000570
000580          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000590
000600
000610			STRING "DIZIONAR"  ".HTM"
000620			DELIMITED BY SIZE  INTO PAGE-WEB.
000630
000640          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000650
000660
000670 FINE.
000680          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000690
000700
000710          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000720
000730          GOBACK.
000740
000750          COPY "PIOWEB1.CBL".
000760          COPY "PIOVIEW.CBL".
000770			COPY "PIOJSON.CBL".
000780
000790
000800 LOAD-VIEW.
000810
000820          MOVE SPACES              TO STRINGA-VIEW.
000830
000840			STRING 
000850
000860			'<a href="openlogs.exe?MK-KEY='
000870			 SECTION-WEB DELIMITED BY SIZE
000880			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000890			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000900			'" class="easyui-linkbutton" data-options="iconCls:'
000910			"'icon-undo'"
000920			'" style="padding:5px 0px;width:15%; margin-left:20px">'
000930			' <span style="font-size:14px;">Indietro</span></a>'  
000940			DELIMITED BY SIZE INTO STRINGA-VIEW.
000950            
000960
000970          MOVE "GOBACK"           TO NOME-VIEW
000980          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000990
001000
001010			MOVE "DIZIONAR"         TO NOME-JSON.
001020          MOVE "FILE-JSON"        TO NOME-VIEW
001021
001030			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001070
001100
001101
001110			MOVE zeros				TO CONTA.
001111
001112          CLOSE ARKLOG.
001113          OPEN INPUT ARKLOG.
001114
001115			perform conta-record	thru ex-conta-record.
001116
001117          CLOSE ARKLOG.
001118          OPEN INPUT ARKLOG.
001120
001121			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001122			 OR CONTA(IND:1) > "0"
001123			 CONTINUE
001124			END-PERFORM.
001125
001126
001130			STRING '{"total":' CONTA(IND:) ',"rows":['		
001140			DELIMITED BY SIZE INTO DATI-JSON.
001150			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001160
001170			MOVE SPACES				TO DATI-JSON.
001180
001190			PERFORM 3 TIMES
001200
001210			READ ARKLOG NEXT RECORD AT END GO TO FINE-TABELLA
001211 			 END-READ
001220
001230          END-PERFORM.
001240
001250
001260 CICLO-TABELLA.
001270
001280			READ ARKLOG NEXT RECORD AT END GO TO FINE-TABELLA.
001290
001300
001310			IF DATI-JSON > SPACES
001320			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001330
001340***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001350
001360			INSPECT LOGGATO  REPLACING ALL "\" BY " ".			
001370
001380			INSPECT LOGGATO  REPLACING ALL "?" BY " ".			
001390			INSPECT LOGGATO  REPLACING ALL "&" BY " ".			
001400			INSPECT LOGGATO  REPLACING ALL "'" BY " ".			
001410			INSPECT LOGGATO  REPLACING ALL '"' BY " ".			
001420			INSPECT LOGGATO  REPLACING ALL '%' BY " ".			
001430			INSPECT LOGGATO  REPLACING ALL '@' BY " ".			
001431				
001440**** ITEM
001450		
001460			STRING 
001470
001480			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001490			NOME-COBOL-LOG      DELIMITED BY "   "
001500			'",'			DELIMITED BY SIZE
001510			INTO DATI-JSON  
001520          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001530
001540**** ITEM
001550			STRING "        "
001560			'"DESC":"'		DELIMITED BY SIZE
001570			TIPO-LOG          DELIMITED BY "     "
001580			'",'			DELIMITED BY SIZE
001590			INTO DATI-JSON  
001600          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001610**** ITEM
001620			STRING "        "
001630			'"DESC1":"'	DELIMITED BY SIZE
001640			NUMERO-LOG      DELIMITED BY "     "
001650			'",'			DELIMITED BY SIZE
001660			INTO DATI-JSON  
001670          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001680**** ITEM
001690			STRING "        "
001700			'"DESC2":"'	DELIMITED BY SIZE
001710			VALORE-LOG      DELIMITED BY "     "
001720			'",'			DELIMITED BY SIZE
001730			INTO DATI-JSON  
001740          PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001750**** ITEM
001760
001770
001780**** ITEM
001790			STRING "        "
001800			'"' 		
001810			'CANCELLA":"'	DELIMITED BY SIZE
001820			"non disponibile" DELIMITED BY SIZE
001830			'",'			DELIMITED BY SIZE
001840			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001850**** ITEM
001860			STRING "        "
001870			'"' 		
001880			'MODIFICA":"'	DELIMITED BY SIZE
001890			"non disponibile" DELIMITED BY SIZE
001900          '"},' DELIMITED BY SIZE 
001910			into dati-JSON.
001920
001930	 		GO TO CICLO-TABELLA.
001940
001950
001960 FINE-TABELLA.
001970
001980			INSPECT DATI-JSON REPLACING all "}, " BY
001990										    "}  ".
002000
002010			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002020
002030
002040			MOVE "]}"					TO DATI-JSON.
002050			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002060
002070			CLOSE ARKJSON.
002080
002090
002100 EX-LOAD-VIEW.
002110          EXIT.
002120
002130 CONTA-RECORD.
002140
002150          PERFORM 3 TIMES
002160
002170			READ ARKLOG NEXT RECORD AT END GO TO EX-CONTA-RECORD
002180 			 END-READ
002190          END-PERFORM.
002200
002210			
002220
002230 CICLO-CONTA-RECORD.
002240
002260			READ ARKLOG NEXT RECORD AT END GO TO EX-CONTA-RECORD.
002261
002290			ADD 1					TO CONTA.
002300
002310			GO TO CICLO-CONTA-RECORD.
002320
002330 EX-CONTA-RECORD.
002340			EXIT.
002350
