000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID       OPENRE01.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000050 SPECIAL-NAMES.
000060          DECIMAL-POINT IS COMMA.
000070 INPUT-OUTPUT     SECTION.
000080 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110          COPY "SELVIEW.CBL".
000120          COPY "SELTAB.CBL".
000130
000140
000150
000160 DATA             DIVISION.
000170 FILE SECTION.
000180
000190          COPY "FDEWEB.CBL".
000200          COPY "FDEVIEW.CBL".
000210          COPY "FDETAB.CBL".
000220
000230 WORKING-STORAGE  SECTION.
000320
000330          COPY "COBW3.CBL".
000340          COPY "GLOBALS.CBL".
000350			COPY "IMAGES.CBL".
000360*
000370 PROCEDURE  DIVISION.
000380*
000390          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000391
000400          PERFORM OPEN-IO-TAB      THRU EX-OPEN-IO-TAB.
000478
000479		    COPY "INIZIALI.CBL".
000480
000481
000490          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000500
000510          IF ESITO-NOK
000520          MOVE "ERRORE MEMORIZZAZIONE DATI TABELLE" TO MESSAGGIO
000530           ELSE
000540          MOVE "MEMORIZZAZIONE TABELLE EFFETTUATA"  TO MESSAGGIO.
000550
000560          PERFORM VIS-MENU     THRU EX-VIS-MENU.
000570
000580 FINE.
000590          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000600          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000620
000630          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000640
000650          GOBACK.
000660
000670          COPY "PIOWEB.CBL".
000680          COPY "PIOVIEW.CBL".
000690          COPY "PIOTAB.CBL".
000700
000710
000720 LOAD-VIEW.
000730
000740          MOVE "01"            	TO TIPO-TAB.
000750          MOVE 1                  TO PROG-TAB.
000760          MOVE 01                 TO ENTE-TAB.
000770          PERFORM LEGGO-TAB       THRU EX-LEGGO-TAB.
000780
000790			if esito-NOK INITIALIZE TABELLA-001
000791
000792          perform SCRIVO-TAB      THRU EX-SCRIVO-TAB.
000793
000800
000810          MOVE "DESC-ENTE-001"    TO FIELD-WEB
000820          PERFORM READ-WEB        THRU EX-READ-WEB
000830          MOVE VALUE-WEB          TO DESC-ENTE-001.
000840
000850
000860          MOVE "CITTA-001"        TO FIELD-WEB
000870          PERFORM READ-WEB        THRU EX-READ-WEB
000880          MOVE VALUE-WEB          TO CITTA-001.
000890
000900          MOVE "PROV-001"         TO FIELD-WEB
000910          PERFORM READ-WEB        THRU EX-READ-WEB
000920          MOVE VALUE-WEB          TO PROV-001.
000930
000940
000950          MOVE "VIA-001"          TO FIELD-WEB
000960          PERFORM READ-WEB        THRU EX-READ-WEB
000970          MOVE VALUE-WEB          TO VIA-001.
000980
000990          MOVE "TEL-001"          TO FIELD-WEB
001000          PERFORM READ-WEB        THRU EX-READ-WEB
001010          MOVE VALUE-WEB          TO TEL-001.
001020
001030          MOVE "EMAIL-001"        TO FIELD-WEB
001040          PERFORM READ-WEB        THRU EX-READ-WEB
001050          MOVE VALUE-WEB          TO EMAIL-001.
001060
001070          MOVE "PASSWORD-EMAIL-001"      TO FIELD-WEB
001080          PERFORM READ-WEB        THRU EX-READ-WEB
001090          MOVE VALUE-WEB          TO PASSWORD-EMAIL-001.
001100
001110
001120          PERFORM AGGIORNO-TAB  THRU EX-AGGIORNO-TAB.
001252
001260
001270 EX-LOAD-VIEW.
001280          EXIT.
001290
001300
001310 REPLACE-WEB.
001320
001330
001340 EX-REPLACE-WEB.
001350          EXIT.
001360
