000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENREAB.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300          COPY "SELABI.CBL".
000310		                                   
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEABI.CBL".
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410		                                   
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.

000570                                             
000520
000530          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000540          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000550          PERFORM OPEN-IO-ABI  THRU EX-OPEN-IO-ABI.
000560

000580
000590          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000600        
000640          MOVE "MEMORIZZAZIONE ACCESSI UTENTE EFFETTUATA"  TO MESSAGGIO.
000650
000660          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000670
000680 FINE.
000690          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000700          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000710			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000720          PERFORM CLOSE-ABI    THRU EX-CLOSE-ABI.
000730          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000740
000750          GOBACK.
000760
000770          COPY "PIOWEB1.CBL".
000780          COPY "PIOVIEW.CBL".
000790          COPY "PIOTAB.CBL".
000800			COPY "PIODATO.CBL".
000810          COPY "PIOABI.CBL".
000820
000830 LOAD-VIEW.
000840
000850          MOVE "LAVORO"   	     TO NOME-VIEW
000860          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000870
000880			MOVE STRINGA-VIEW		TO SW-LAVORO.
000890
000900
000910***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
000920
000930
000940          MOVE "CAMPO"            TO NOME-VIEW.
000950          PERFORM STARTO-VIEW     THRU EX-STARTO-VIEW.
000960          IF ESITO-NOK GO TO FINE-VIEW.
000970          
000980 CICLO-VIEW.
000990
001000          PERFORM LEGGO-NEXT-VIEW THRU EX-LEGGO-NEXT-VIEW.
001010          
001020          IF NOME-VIEW(1:10) NOT = "CAMPO00000" MOVE "S" TO FINE-FILE.
001030          
001040          IF FINE-FILE = "S" GO TO FINE-VIEW.
001050
001051			IF KEY-VIEW = SPACES GO TO CICLO-VIEW.
001060          
001070          MOVE NOME-VIEW          TO FIELD-WEB.
001080
001090          PERFORM READ-WEB        THRU EX-READ-WEB.
001091
001092          MOVE KEY-VIEW           TO CHIAVE-ABI.
001100
001101			PERFORM CANCELLO-ABI	THRU EX-CANCELLO-ABI.
001102
001110          IF COBW3-SEARCH-FLAG-EXIST
001120          MOVE KEY-VIEW           TO CHIAVE-ABI
001121			PERFORM SCRIVO-ABI		THRU EX-SCRIVO-ABI.
001150
001160			GO TO CICLO-VIEW.
001170			 
001180
001190 FINE-VIEW.
001200
001210 EX-LOAD-VIEW.
001220          EXIT.
001230
