000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENCAUS.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELCAUS.CBL".
000300			COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDECAUS.CBL".
000400			COPY "FDEJSON.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520                                             
000530
000540          PERFORM OPEN-I-CAUS  THRU EX-OPEN-I-CAUS.
000550
000560          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000570
000580			MOVE "CAUSALI.HTM" TO PAGE-WEB.
000590
000600          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000610
000620
000630 FINE.
000640          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000650          PERFORM CLOSE-CAUS   THRU EX-CLOSE-CAUS.
000660
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB1.CBL".
000720          COPY "PIOVIEW.CBL".
000730			COPY "PIOJSON.CBL".
000740          COPY "PIOCAUS.CBL".
000750
000760 LOAD-VIEW.
000770
000780
000790
000800          MOVE SPACES              TO STRINGA-VIEW.
000810
000820
000830			STRING 
000840
000850			'<a href="opencaus.exe?MK-KEY='
000860			 SECTION-WEB DELIMITED BY SIZE
000870			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000880			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000890			'" class="easyui-linkbutton" data-options="iconCls:'
000900			"'icon-undo'"
000910			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000920			' <span style="font-size:14px;">Indietro</span></a>'  
000930			DELIMITED BY SIZE INTO STRINGA-VIEW.
000940            
000950
000960          MOVE "GOBACK"           TO NOME-VIEW
000970          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000980
000990
001000			STRING "CAUSALI" FUNZIONE-WEB 				
001010			DELIMITED BY SIZE INTO  NOME-JSON.
001011
001020          MOVE "FILE-JSON"        TO NOME-VIEW
001021
001030			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001040
001100
001110			MOVE ZEROS				TO CONTA.
001120
001130			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001140
001150			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001160			 OR CONTA(IND:1) > "0"
001170			 CONTINUE
001180			END-PERFORM.
001190
001200			STRING '{"total":' CONTA(IND:) ',"rows":['		
001210			DELIMITED BY SIZE INTO DATI-JSON.
001220			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001230
001240			MOVE SPACES				TO DATI-JSON.
001250
001260          MOVE LOW-VALUE          TO CHIAVE-CAUS.
001270          PERFORM STARTO-CAUS     THRU EX-STARTO-CAUS.
001280
001290          if ESITO-NOK GO TO FINE-TABELLA.
001300
001310
001320 CICLO-TABELLA.
001330
001340			PERFORM LEGGO-NEXT-CAUS THRU EX-LEGGO-NEXT-CAUS.
001350
001360			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001370
001380			IF DATI-JSON > SPACES
001390			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001400
001410***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001420
001430			INSPECT CAUSALE REPLACING ALL "\" BY " ".			
001440
001450				
001460**** ITEM
001470		
001480			STRING 
001490
001500			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001510			PROG-CAUS     DELIMITED BY "   "
001520			'",'			DELIMITED BY SIZE
001530			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001540
001550**** ITEM
001560			STRING "        "
001570			'"DESC":"'	DELIMITED BY SIZE
001580			DESC-CAUS       DELIMITED BY "     "
001590			'",'			DELIMITED BY SIZE
001600			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001610**** ITEM
001620			STRING "        "
001630			'"TIPO":"'	DELIMITED BY SIZE
001640			TIPO-CAUS       DELIMITED BY "     "
001650			'",'			DELIMITED BY SIZE
001660			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001670**** ITEM
001680			STRING "        "
001690			'"DESC1":"'	DELIMITED BY SIZE
001700			SIGLA-CAUS      DELIMITED BY "     "
001710			'",'			DELIMITED BY SIZE
001720			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001730**** ITEM
001740			STRING "        "
001750			'"' 		
001760			'CANCELLA":"'	DELIMITED BY SIZE
001770			'<a href=opencanc.exe?MK-KEY='
001780			 SECTION-WEB DELIMITED BY SIZE
001790			"&MK-ITEM=" DELIMITED BY SIZE
001800			CHIAVE-CAUS
001810			"&MK-FILE=CA" DELIMITED BY SIZE
001820			'>' delimited by size 
001830			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001840				delimited by size 
001850			'",'			DELIMITED BY SIZE
001860			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001870**** ITEM
001880			STRING "        "
001890			'"' 		
001900			'MODIFICA":"'	DELIMITED BY SIZE
001910			'<a href=openmoca.exe?MK-KEY='
001920			 SECTION-WEB DELIMITED BY SIZE
001930			"&MK-ITEM=" DELIMITED BY SIZE
001940			CHIAVE-CAUS  DELIMITED BY SIZE
001950			'>' delimited by size 
001960			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001970				delimited by size 
001980          '"},' DELIMITED BY SIZE 
001990			into dati-JSON.
002000
002010
002020			GO TO CICLO-TABELLA.
002030
002040
002050 FINE-TABELLA.
002060
002070			INSPECT DATI-JSON REPLACING all "}, " BY
002080										    "}  ".
002090
002100			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002110
002120
002130			MOVE "]}"					TO DATI-JSON.
002140			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002150
002160			CLOSE ARKJSON.
002170
002180
002190 EX-LOAD-VIEW.
002200          EXIT.
002210
002220 CONTA-RECORD.
002230
002240          MOVE LOW-VALUE          TO CHIAVE-CAUS.
002250          PERFORM STARTO-CAUS     THRU EX-STARTO-CAUS.
002260			
002270			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002280
002290 CICLO-CONTA-RECORD.
002300
002310			PERFORM LEGGO-NEXT-CAUS THRU EX-LEGGO-NEXT-CAUS.
002320
002330			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002340
002350			ADD 1					TO CONTA.
002360
002370			GO TO CICLO-CONTA-RECORD.
002380
002390 EX-CONTA-RECORD.
002400			EXIT.
002410
002420
