000010*
000020* Copyright (C) 2010-2022 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANUTENILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENTA3.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270			COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300			COPY "SELJSON.CBL".
000340
000350 DATA             DIVISION.
000361 FILE SECTION.
000362
000370			COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410			COPY "FDEJSON.CBL".
000420
000430
000440 WORKING-STORAGE  SECTION.
000450
000460          COPY "COBW3.CBL".
000470          COPY "GLOBALS.CBL".
000480          COPY "IMAGES.CBL".
000490*
000491  LINKAGE SECTION.
000492
000494  77 TIPO-TABELLA		PIC XX.
000495  77 SIGLA-TABELLA	PIC X(10).
000496
000497  PROCEDURE       DIVISION USING TIPO-TABELLA SIGLA-TABELLA.
000498
000510 INIZIO.
000532          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000550
000560                                             
000533
000540          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000570
000590          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000670
000680 FINE.
000690          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000700          PERFORM CLOSE-TAB     THRU EX-CLOSE-TAB.
000710
000720          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000730
000740
000750          GOBACK.
000760			COPY "PIOWEB1.CBL".
000780          COPY "PIOVIEW.CBL".
000790			COPY "PIOJSON.CBL".
000800			COPY "PIOTAB.CBL".
000810
000820 LOAD-VIEW.
000830
000840			MOVE SPACES				TO NOME-JSON.
000850
001080  		STRING "/OPenPa/files/ark" DELIMITED BY SIZE
001081				SIGLA-TABELLA DELIMITED  BY "    "
001082				".json" delimited bY SIZE INTO NOME-JSON.
001083
001084			MOVE "/OPenPa/files/arkabil.json" to NOME-JSON.
001090
001100			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001110
001170
001180			MOVE ZEROS				TO CONTA.
001190
001200			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001210
001220			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001230			 OR CONTA(IND:1) > "0"
001240			 CONTINUE
001250			END-PERFORM.
001260
001270			STRING '{"total":' CONTA(IND:) ',"rows":['		
001280			DELIMITED BY SIZE INTO DATI-JSON.
001290			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001300
001310			MOVE SPACES				TO DATI-JSON.
001320
001321
001330          MOVE LOW-VALUE          TO tabella.
001331
001332			move 01					TO ENTE-TAB.
001333			MOVE "03"				TO TIPO-TAB.
001334
001340          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
001350
001360          if ESITO-NOK GO TO FINE-TABELLA.
001370
001380
001390 CICLO-TABELLA.
001400
001410			PERFORM LEGGO-NEXT-TAB 	THRU EX-LEGGO-NEXT-TAB.
001411
001412			IF TIPO-TAB NOT = "03" move "S" to fine-file.
001420
001430			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001440
001450			IF DATI-JSON > SPACES
001460			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001470
001480***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001490
001500			INSPECT TABELLA REPLACING ALL "\" BY " ".			
001510
001520				
001530**** ITEM
001540		
001550			STRING 
001560
001570			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001580			PROG-TAB        DELIMITED BY "   "
001590			'",'			DELIMITED BY SIZE
001600			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001610
001620**** ITEM
001630			STRING "        "
001640			'"DESC":"'	DELIMITED BY SIZE
001650			DESC-TAB         DELIMITED BY "     "
001950          '"},' DELIMITED BY SIZE 
001951			into dati-JSON.
002090
002091			GO TO CICLO-TABELLA.
002100
002110
002120 FINE-TABELLA.
002130
002140			INSPECT DATI-JSON REPLACING all "}, " BY
002150										    "}  ".
002160
002170			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002180
002190
002200			MOVE "]}"					TO DATI-JSON.
002210			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002220
002230			CLOSE ARKJSON.
002240
002250
002260 EX-LOAD-VIEW.
002270          EXIT.
002280
002290 CONTA-RECORD.
002300
002330          MOVE LOW-VALUE          TO tabella.
002331
002332			move 01					TO ENTE-TAB.
002333			MOVE TIPO-TABELLA		TO TIPO-TAB.
002334
002335          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
002336			
002340			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002350
002360 CICLO-CONTA-RECORD.
002370
002390			PERFORM LEGGO-NEXT-TAB 	THRU EX-LEGGO-NEXT-TAB.
002391
002392			IF TIPO-TAB NOT = TIPO-TABELLA move "S" to fine-file.
002394
002400			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002410
002420			ADD 1					TO CONTA.
002430
002440			GO TO CICLO-CONTA-RECORD.
002450
002460 EX-CONTA-RECORD.
002470			EXIT.
002480
