000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENPA99.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000260			COPY "SPECIAL.CBL".
000270
000280 INPUT-OUTPUT     SECTION.
000290 FILE-CONTROL.
000300
000310          COPY "SELWEB.CBL".
000320	     	COPY "SELVIEW.CBL".
000330			COPY "SELUTEN.CBL".
000340		
000350
000360 DATA             DIVISION.
000370 FILE SECTION.
000380
000390          COPY "FDEWEB.CBL".
000400			COPY "FDEUTEN.CBL".
000410	        COPY "FDEVIEW.CBL".
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470			COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500
000510 DECLARATIVES.
000520 ERROR-ARCHIVIO SECTION.
000530			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW.
000540 EX-ERRORE-ARCHIVIO.
000550			EXIT.
000560 END DECLARATIVES.
000570
000580*
000590          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000600
000610                                             
000620 
000630          MOVE "MK-KEY"        TO FIELD-WEB
000640          PERFORM READ-WEB     THRU EX-READ-WEB
000650
000660          MOVE VALUE-WEB       TO SECTION-WEB(1:).
000670
000680			IF SECTION-WEB  = SPACES
000690		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000700			GO TO USCITA.
000710
000740          PERFORM OPEN-IO-UTEN  THRU EX-OPEN-IO-UTEN.
000750
000760			PERFORM VALIDITA	 THRU EX-VALIDITA.
000770
000780			IF ESITO-NOK
000790		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000800			GO TO FINE.
000810
000820          MOVE "UTENTE"        TO NOME-VIEW
000830          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000840
000850          MOVE STRINGA-VIEW    TO NOME-UTEN.
000860          PERFORM LETTURA-UTEN THRU EX-LETTURA-UTEN.
000870          
000880           IF ESITO-NOK
000890            STRING "SESSIONE SCADUTA O UTENTE NON LOGGATO:" CHIAVE-UTEN
000900			  DELIMITED BY SIZE INTO MESSAGGIO
000910            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
000920           GO TO FINE.
000930
000940			perform CANCELLO-VIEW THRU EX-CANCELLO-VIEW
000950
000960          STRING "SESSIONE TERMINATA - UTENTE  " NOME-UTEN 
000970			" DISCONNESSO "  DELIMITED BY SIZE INTO MESSAGGIO
000980
000990			MOVE ZEROS 			TO MINUTI-SCA-UTEN
001000
001010			PERFORM AGGIORNO-UTEN THRU EX-AGGIORNO-UTEN.
001020
001030			MOVE MESSAGGIO      TO VALUE-WEB.
001040			MOVE "MK-MESSAGE"   TO FIELD-WEB.
001050			PERFORM METTI-WEB   THRU EX-METTI-WEB.
001060
001070			MOVE "DISCONNESSIONE UTENTE"	TO VALUE-WEB.
001080			MOVE "MK-TITLE"     TO FIELD-WEB.
001090			PERFORM METTI-WEB   THRU EX-METTI-WEB.
001100
001110
001120			MOVE "TEMPLATE/LOGOUT.HTM"  TO PAGE-WEB.
001130			PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001140
001150 FINE.
001160		
001170			PERFORM CLOSE-VIEW	THRU EX-CLOSE-VIEW.
001180
001190			CALL "CBL_DELETE_FILE" USING FILE-VIEW.
001200
001210			PERFORM CLOSE-UTEN	THRU EX-CLOSE-UTEN.
001220          
001230
001240 USCITA.
001250
001260	        PERFORM FINE-WEB     THRU EX-FINE-WEB.
001270
001280          GOBACK.
001290
001300			COPY "PIOUTEN.CBL".
001310	    	COPY "PIOWEB1.CBL".
001320         	COPY "PIOVIEW.CBL".
001330
001340 
001350
