000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANORAILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENMOPR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELPROF.CBL".
000300			COPY "SELDATO.CBL".
000310
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360          COPY "FDEWEB.CBL".
000370          COPY "FDEVIEW.CBL".
000380          COPY "FDEPROF.CBL".
000390			COPY "FDEDATO.CBL".
000400
000410 WORKING-STORAGE  SECTION.
000420
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000510			PERFORM OPEN-I-PROF  THRU EX-OPEN-I-PROF.
000520
000530			PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000540
000550          COPY "INIZIALI.CBL".
000560
000570		    MOVE "MK-ITEM"       TO FIELD-WEB
000580          PERFORM READ-WEB     THRU EX-READ-WEB
000590          MOVE VALUE-WEB       TO CHIAVE-PROF
000600*
000610**** SI LEGGE IL RECORD DA MODIFICARE: N.B NON VIENE ANCORA POSTO IN LOCK 
000620*
000630			PERFORM LEGGO-PROF   THRU EX-LEGGO-PROF.
000640
000650			IF ESITO-NOK
000660			 STRING "ERRORE NON GESTITO LETTURA PROFILO"
000670			 DELIMITED BY SIZE INTO MESSAGGIO
000680			 PERFORM VIS-MESS	THRU EX-VIS-MESS
000690			 GO TO FINE.
000700
000710          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000720
000730			MOVE SPACES			 TO PAGE-WEB
000740
000770
000773			STRING "TEMPLATE/INSE" ENTITA-WEB FUNZIONE-WEB ".HTM"
000774			  DELIMITED BY SIZE INTO PAGE-WEB
000775
000778
000779
000780          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000790
000800
000810 FINE.
000820          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000830		 	PERFORM CLOSE-PROF   THRU EX-CLOSE-PROF.
000840			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000850          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000860
000870          GOBACK.
000880
000890          COPY "PIOWEB.CBL".
000900          COPY "PIOVIEW.CBL".
000910			COPY "PIOPROF.CBL".
000920			COPY "PIODATO.CBL".
000930
000940
000950 REPLACE-WEB.
000960
000970          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
000980
000990 EX-REPLACE-WEB.
001000          EXIT.
001010
001020 LOAD-VIEW.
001030
001040          MOVE "VARIAZIONE"               TO STRINGA-VIEW
001050          MOVE "LAVORO"           		TO NOME-VIEW
001060          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001070
001080          MOVE CHIAVE-PROF 	            TO STRINGA-VIEW
001090          MOVE "CHIAVE-PROF"       		TO NOME-VIEW
001100          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001110          
001120
001130***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001140
001150
001160			PERFORM AZZERA-VIEW				THRU EX-AZZERA-VIEW. 
001170
001180			MOVE "PR"						TO CHIAVE-DATO.
001190
001200			PERFORM STARTO-DATO				THRU EX-STARTO-DATO.
001210
001220			IF ESITO-NOK GO TO EX-LOAD-VIEW.
001230
001240******* SI POSIZIONA SULLA ORAELLA IN FASE DI GESTIONE  ORAELLA-0XX XX=TIPO-ORA
001250
001260 CICLO-VIEW.
001270
001280			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001290
001300          IF CHIAVE-DATO(1:2) NOT = "PR" MOVE "S" TO FINE-FILE.
001310
001320      	IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001330		
001340*
001350*** IL PRIMO CAMPO  E' ORAALE  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001360*
001370
001380 CICLO-DATI-VIEW.
001390
001400			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001410
001420**** HA RAGGIUNTO UN ALTRA ORAELLA: FINE
001430
001440			IF CHIAVE-DATO(1:2) NOT = "PR" MOVE "S" TO FINE-FILE.
001450
001460			IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001470
001480
001490***** TODO: GESTIRE IMPORTO O VALORI NUMERICI STANDARD
001500
001510			MOVE PROFILO(POS-DATO:SIZE-DATO) TO STRINGA-VIEW.
001520
001530          MOVE NOME-COBOL-DATO    TO NOME-VIEW.
001540
001550          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001560
001570
001580			
001590****** aggiunge il valore COME VARIBILE NELLA FORMA NOMECAMPOX X=VALORE SIGNIFICATIVO PER INSERIRE checked=true
001600
001610	    	MOVE PROFILO(POS-DATO:SIZE-DATO) TO STRINGA-VIEW.
001620
001630		   if stringa-view > spaces
001640		   AND SIZE-DATO = 1
001650			move spaces				TO NOME-VIEW
001660			STRING NOME-COBOL-DATO	DELIMITED BY "  "
001670			 STRINGA-VIEW			DELIMITED BY SIZE
001680			 INTO NOME-VIEW
001690			MOVE 'checked="true"'	TO STRINGA-VIEW
001700		    MOVE CHIAVE-DATO		TO CHIAVE-DATO-VIEW
001710          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001720
001730			GO TO CICLO-DATI-VIEW.
001740		 
001750 EX-LOAD-VIEW.
001760			EXIT.
001770
001780 AZZERA-VIEW.
001790
001800			MOVE "PR"					TO CHIAVE-DATO-VIEW.
001810			PERFORM STARTO-DATO-VIEW	THRU EX-STARTO-DATO-VIEW.
001820			IF ESITO-NOK GO TO EX-AZZERA-VIEW.
001830
001840 CICLO-AZZERA-VIEW.
001850
001860			PERFORM LEGGO-NEXT-VIEW THRU EX-LEGGO-NEXT-VIEW.
001870
001880			IF CHIAVE-DATO-VIEW(1:2) NOT = "PR" MOVE "S" TO FINE-FILE.
001890
001900			IF FINE-FILE = "S" GO TO EX-AZZERA-VIEW.
001910
001920			IF CHIAVE-DATO-VIEW(1:2) = "PR"
001930			 PERFORM CANCELLO-VIEW	THRU EX-CANCELLO-VIEW.
001940
001950			GO TO CICLO-AZZERA-VIEW.
001960
001970 EX-AZZERA-VIEW.
001980			EXIT.
