000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENMATR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELMATR.CBL".
000300			COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDEMATR.CBL".
000400			COPY "FDEJSON.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520
000530                                             
000540
000550          PERFORM OPEN-I-MATR  THRU EX-OPEN-I-MATR.
000560
000570          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000580
000590			MOVE "MATRICOLA.HTM" TO PAGE-WEB.
000600
000610          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000620
000630
000640 FINE.
000650          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000660          PERFORM CLOSE-MATR   THRU EX-CLOSE-MATR.
000670
000680          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000690
000700          GOBACK.
000710
000720          COPY "PIOWEB1.CBL".
000730          COPY "PIOVIEW.CBL".
000740			COPY "PIOJSON.CBL".
000750          COPY "PIOMATR.CBL".
000760
000770 LOAD-VIEW.
000780
000790
000800
000810          MOVE SPACES              TO STRINGA-VIEW.
000820
000830
000840			STRING 
000850
000860			'<a href="openmatr.exe?MK-KEY='
000870			 SECTION-WEB DELIMITED BY SIZE
000880			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000890			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000900			'" class="easyui-linkbutton" data-options="iconCls:'
000910			"'icon-undo'"
000920			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000930			' <span style="font-size:14px;">Indietro</span></a>'  
000940			DELIMITED BY SIZE INTO STRINGA-VIEW.
000950            
000960
000970          MOVE "GOBACK"           TO NOME-VIEW
000980          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000990
001000
001010			STRING "MATRICOLA" FUNZIONE-WEB 				
001020			DELIMITED BY SIZE INTO  NOME-JSON.
001030          MOVE "FILE-JSON"        TO NOME-VIEW
001031
001040			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001110
001120			MOVE ZEROS				TO CONTA.
001130
001140			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001150
001160			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001170			 OR CONTA(IND:1) > "0"
001180			 CONTINUE
001190			END-PERFORM.
001200
001210			STRING '{"total":' CONTA(IND:) ',"rows":['		
001220			DELIMITED BY SIZE INTO DATI-JSON.
001230			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001240
001250			MOVE SPACES				TO DATI-JSON.
001260
001270          MOVE LOW-VALUE          TO CHIAVE-MATR.
001280          PERFORM STARTO-MATR     THRU EX-STARTO-MATR.
001290
001300          if ESITO-NOK GO TO FINE-TABELLA.
001310
001320
001330 CICLO-TABELLA.
001340
001350			PERFORM LEGGO-NEXT-MATR THRU EX-LEGGO-NEXT-MATR.
001360
001370			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001380
001390			IF DATI-JSON > SPACES
001400			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001410
001420***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001430
001440			INSPECT MATRICOLA REPLACING ALL "\" BY " ".			
001450
001460				
001470**** ITEM
001480		
001490			STRING 
001500
001510			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001520			PROG-MATR     DELIMITED BY "   "
001530			'",'			DELIMITED BY SIZE
001540			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001550
001560**** ITEM
001570			STRING "        "
001580			'"DESC":"'	DELIMITED BY SIZE
001590          COGNOME-MATR DELIMITED BY "   "
001600			" " NOME-MATR DELIMITED BY  "   "
001610			'",'			DELIMITED BY SIZE
001620			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001630**** ITEM
001640			STRING "        "
001650			'"TIPO":"'	DELIMITED BY SIZE
001660			BADGE-MATR      DELIMITED BY "     "
001670			'",'			DELIMITED BY SIZE
001680			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001690**** ITEM
001700			STRING "        "
001710			'"DESC1":"'	DELIMITED BY SIZE
001720			CF-MATR         DELIMITED BY "     "
001730			'",'			DELIMITED BY SIZE
001740			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001750**** ITEM
001760			STRING "        "
001770			'"' 		
001780			'CANCELLA":"'	DELIMITED BY SIZE
001790			'<a href=opencanc.exe?MK-KEY='
001800			 SECTION-WEB DELIMITED BY SIZE
001810			"&MK-ITEM=" DELIMITED BY SIZE
001820			CHIAVE-MATR
001830			"&MK-FILE=MA" DELIMITED BY SIZE
001840			'>' delimited by size 
001850			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001860				delimited by size 
001870			'",'			DELIMITED BY SIZE
001880			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001890**** ITEM
001900			STRING "        "
001910			'"' 		
001920			'MODIFICA":"'	DELIMITED BY SIZE
001930			'<a href=openmoma.exe?MK-KEY='
001940			 SECTION-WEB DELIMITED BY SIZE
001950			"&MK-ITEM=" DELIMITED BY SIZE
001960			CHIAVE-MATR  DELIMITED BY SIZE
001970			'>' delimited by size 
001980			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001990				delimited by size 
002000          '"},' DELIMITED BY SIZE 
002010			into dati-JSON.
002020
002030
002040			GO TO CICLO-TABELLA.
002050
002060
002070 FINE-TABELLA.
002080
002090			INSPECT DATI-JSON REPLACING all "}, " BY
002100										    "}  ".
002110
002120			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002130
002140
002150			MOVE "]}"					TO DATI-JSON.
002160			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002170
002180			CLOSE ARKJSON.
002190
002200
002210 EX-LOAD-VIEW.
002220          EXIT.
002230
002240 CONTA-RECORD.
002250
002260          MOVE LOW-VALUE          TO CHIAVE-MATR.
002270          PERFORM STARTO-MATR     THRU EX-STARTO-MATR.
002280			
002290			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002300
002310 CICLO-CONTA-RECORD.
002320
002330			PERFORM LEGGO-NEXT-MATR THRU EX-LEGGO-NEXT-MATR.
002340
002350			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002360
002370			ADD 1					TO CONTA.
002380
002390			GO TO CICLO-CONTA-RECORD.
002400
002410 EX-CONTA-RECORD.
002420			EXIT.
002430
