000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENCAUS.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELCAUS.CBL".
000310			COPY "SELJSON.CBL".
000320
000330
000340
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDECAUS.CBL".
000410			COPY "FDEJSON.CBL".
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000520
000530          PERFORM OPEN-I-CAUS  THRU EX-OPEN-I-CAUS.
000540
000550          COPY "INIZIALI.CBL".
000560
000570          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000580
000590			MOVE "TEMPLATE/CAUSALI.HTM" TO PAGE-WEB.
000600
000610          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000620
000630
000640 FINE.
000650          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000660          PERFORM CLOSE-CAUS   THRU EX-CLOSE-CAUS.
000670
000680          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000690
000700          GOBACK.
000710
000720          COPY "PIOWEB1.CBL".
000730          COPY "PIOVIEW.CBL".
000740			COPY "PIOJSON.CBL".
000750          COPY "PIOCAUS.CBL".
000760
000770 LOAD-VIEW.
000780
000790
000960
000970          MOVE SPACES              TO STRINGA-VIEW.
000980
000990
001000			STRING 
001010
001020			'<a href="opencaus.exe?MK-KEY='
001030			 SECTION-WEB DELIMITED BY SIZE
001040			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
001050			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
001060			'" class="easyui-linkbutton" data-options="iconCls:'
001070			"'icon-undo'"
001080			'" style="padding:5px 0px;width:25%; margin-left:20px">'
001090			' <span style="font-size:14px;">Indietro</span></a>'  
001100			DELIMITED BY SIZE INTO STRINGA-VIEW.
001110            
001120
001130          MOVE "GOBACK"           TO NOME-VIEW
001140          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001150
001160
001170			STRING "CAUSALI" FUNZIONE-WEB 				
001180			DELIMITED BY SIZE INTO  NOME-JSON.
001190
001200			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001210
001220			STRING "/OpenPA/" FILE-JSON 
001230			 DELIMITED BY SIZE INTO STRINGA-VIEW.
001240
001250          MOVE "FILE-JSON"        TO NOME-VIEW
001260          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001270
001280			MOVE ZEROS				TO CONTA.
001290
001300			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001310
001320			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001330			 OR CONTA(IND:1) > "0"
001340			 CONTINUE
001350			END-PERFORM.
001360
001370			STRING '{"total":' CONTA(IND:) ',"rows":['		
001380			DELIMITED BY SIZE INTO DATI-JSON.
001390			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001400
001410			MOVE SPACES				TO DATI-JSON.
001420
001430          MOVE LOW-VALUE          TO CHIAVE-CAUS.
001440          PERFORM STARTO-CAUS     THRU EX-STARTO-CAUS.
001450
001460          if ESITO-NOK GO TO FINE-TABELLA.
001470
001480
001490 CICLO-TABELLA.
001500
001510			PERFORM LEGGO-NEXT-CAUS THRU EX-LEGGO-NEXT-CAUS.
001520
001530			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001540
001550			IF DATI-JSON > SPACES
001560			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001570
001580***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001590
001600			INSPECT CAUSALE REPLACING ALL "\" BY " ".			
001610
001620				
001630**** ITEM
001640		
001650			STRING 
001660
001670			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001680			PROG-CAUS     DELIMITED BY "   "
001690			'",'			DELIMITED BY SIZE
001700			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001710
001720**** ITEM
001730			STRING "        "
001740			'"DESC":"'	DELIMITED BY SIZE
001750			DESC-CAUS       DELIMITED BY "     "
001760			'",'			DELIMITED BY SIZE
001770			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001780**** ITEM
001790			STRING "        "
001800			'"TIPO":"'	DELIMITED BY SIZE
001810			TIPO-CAUS       DELIMITED BY "     "
001820			'",'			DELIMITED BY SIZE
001830			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001840**** ITEM
001850			STRING "        "
001860			'"DESC1":"'	DELIMITED BY SIZE
001870			SIGLA-CAUS      DELIMITED BY "     "
001880			'",'			DELIMITED BY SIZE
001890			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001900**** ITEM
001910			STRING "        "
001920			'"' 		
001930			'CANCELLA":"'	DELIMITED BY SIZE
001940			'<a href=opencanc.exe?MK-KEY='
001950			 SECTION-WEB DELIMITED BY SIZE
001960			"&MK-ITEM=" DELIMITED BY SIZE
001970			CHIAVE-CAUS
001980			"&MK-FILE=CA" DELIMITED BY SIZE
001990			'>' delimited by size 
002000			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
002010				delimited by size 
002020			'",'			DELIMITED BY SIZE
002030			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002040**** ITEM
002050			STRING "        "
002060			'"' 		
002070			'MODIFICA":"'	DELIMITED BY SIZE
002080			'<a href=openmoca.exe?MK-KEY='
002090			 SECTION-WEB DELIMITED BY SIZE
002100			"&MK-ITEM=" DELIMITED BY SIZE
002110			CHIAVE-CAUS  DELIMITED BY SIZE
002120			'>' delimited by size 
002130			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
002140				delimited by size 
002150          '"},' DELIMITED BY SIZE 
002160			into dati-JSON.
002170
002180
002190			GO TO CICLO-TABELLA.
002200
002210
002220 FINE-TABELLA.
002230
002240			INSPECT DATI-JSON REPLACING all "}, " BY
002250										    "}  ".
002260
002270			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002280
002290
002300			MOVE "]}"					TO DATI-JSON.
002310			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002320
002330			CLOSE ARKJSON.
002340
002350
002360 EX-LOAD-VIEW.
002370          EXIT.
002380
002390 CONTA-RECORD.
002400
002410          MOVE LOW-VALUE          TO CHIAVE-CAUS.
002420          PERFORM STARTO-CAUS     THRU EX-STARTO-CAUS.
002430			
002440			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002450
002460 CICLO-CONTA-RECORD.
002470
002480			PERFORM LEGGO-NEXT-CAUS THRU EX-LEGGO-NEXT-CAUS.
002490
002500			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002510
002520			ADD 1					TO CONTA.
002530
002540			GO TO CICLO-CONTA-RECORD.
002550
002560 EX-CONTA-RECORD.
002570			EXIT.
002580
002650
