000010*
000020* Copyright (C) 2010-2022 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANABIILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENABIL.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELTAB.CBL".
000300			COPY "SELJSON.CBL".
000310
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360          COPY "FDEWEB.CBL".
000370          COPY "FDEVIEW.CBL".
000380          COPY "FDETAB.CBL".
000390			COPY "FDEJSON.CBL".
000400
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520                                             
000530
000540          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000550
000560          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000570
000580
000590			MOVE "ABILITAZ.HTM" TO PAGE-WEB.
000600
000610          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000620
000630
000640 FINE.
000650          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000660          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB1.CBL".
000720          COPY "PIOVIEW.CBL".
000730			COPY "PIOJSON.CBL".
000740			COPY "PIOTAB.CBL".
000750
000760 LOAD-VIEW.
000770
000780
000790			STRING "ABILIT" FUNZIONE-WEB 				
000800			DELIMITED BY SIZE INTO  NOME-JSON.
000810
000811          MOVE "FILE-JSON"        TO NOME-VIEW
000812
000820			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
000830
000860
000890
000900			MOVE ZEROS				TO CONTA.
000910
000920			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
000930
000940			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
000950			 OR CONTA(IND:1) > "0"
000960			 CONTINUE
000970			END-PERFORM.
000980
000990			STRING '{"total":' CONTA(IND:) ',"rows":['		
001000			DELIMITED BY SIZE INTO DATI-JSON.
001010			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001020
001030			MOVE SPACES				TO DATI-JSON.
001040
001050		    INITIALIZE TABELLA.
001060          MOVE "03"				TO TIPO-TAB.
001070			MOVE 01				    TO ENTE-TAB.
001080			
001090          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
001100
001110          if ESITO-NOK GO TO FINE-ABILITA.
001120
001130
001140 CICLO-ABILITA.
001150
001160			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
001170
001180      	IF TIPO-TAB NOT = "03" MOVE "S" TO FINE-FILE.
001190		
001200			IF FINE-FILE = "S" GO TO FINE-ABILITA.
001210
001220			IF DATI-JSON > SPACES
001230			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001240
001250***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001260
001270			INSPECT TABELLA REPLACING ALL "\" BY " ".			
001280
001290				
001300**** ITEM
001310		
001320			STRING 
001330
001340			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001350			CHIAVE-TAB      DELIMITED BY "   "
001360			'",'			DELIMITED BY SIZE
001370			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001380
001390**** ITEM
001400			STRING "        "
001410			'"DESC":"'	DELIMITED BY SIZE
001420			DESC-ABI-003    DELIMITED BY "     "
001430			'",'			DELIMITED BY SIZE
001440			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001450**** ITEM
001460			STRING "        "
001470			'"DESC1":"'	DELIMITED BY SIZE
001480			ENTE-TAB       DELIMITED BY "     "
001490			'",'			DELIMITED BY SIZE
001500			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001510**** ITEM
001520			STRING "        "
001530			'"DESC2":"'	DELIMITED BY SIZE
001540			ELEMENTO-TAB    DELIMITED BY "     "
001550			'",'			DELIMITED BY SIZE
001560			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001570
001580**** ITEM
001590			STRING "        "
001600			'"' 		
001610			'CANCELLA":"'	DELIMITED BY SIZE
001620			"NON DISPONIBILE"
001630			'",'			DELIMITED BY SIZE
001640			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001650**** ITEM
001660			STRING "        "
001670			'"' 		
001680			'MODIFICA":"'	DELIMITED BY SIZE
001690			'<a href=openmoab.exe?MK-KEY='
001700			 SECTION-WEB DELIMITED BY SIZE
001710			"&MK-ITEM=" DELIMITED BY SIZE
001720			ELEMENTO-TAB
001730			'>' delimited by size 
001740			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001750				delimited by size 
001760          '"},' DELIMITED BY SIZE 
001770			into dati-JSON.
001780
001790			GO TO CICLO-ABILITA.
001800
001810
001820 FINE-ABILITA.
001830
001840			INSPECT DATI-JSON REPLACING all "}, " BY
001850										    "}  ".
001860
001870			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001880
001890
001900			MOVE "]}"					TO DATI-JSON.
001910			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
001920
001930			CLOSE ARKJSON.
001940
001950
001960 EX-LOAD-VIEW.
001970          EXIT.
001980
001990 CONTA-RECORD.
002000
002010
002020		    INITIALIZE TABELLA.
002030          MOVE "03"				TO TIPO-TAB.
002040			MOVE 01				    TO ENTE-TAB.
002050
002060          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
002070
002080          if ESITO-NOK GO TO EX-CONTA-RECORD.
002090		
002100 CICLO-CONTA-RECORD.
002110
002120			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
002130
002140      	IF TIPO-TAB NOT = "03" MOVE "S" TO FINE-FILE.
002150
002160			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002170
002180			ADD 1					TO CONTA.
002190
002200			GO TO CICLO-CONTA-RECORD.
002210
002220 EX-CONTA-RECORD.
002230			EXIT.
002240
