000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENINCA.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230 SPECIAL-NAMES.
000240          DECIMAL-POINT IS COMMA.
000250 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300
000310
000320
000330 DATA             DIVISION.
000340 FILE SECTION.
000350
000360          COPY "FDEWEB.CBL".
000370          COPY "FDEVIEW.CBL".
000380
000390 WORKING-STORAGE  SECTION.
000400
000410          COPY "COBW3.CBL".
000420          COPY "GLOBALS.CBL".
000430          COPY "IMAGES.CBL".
000440*
000450 PROCEDURE  DIVISION.
000460*
000470          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000480
000490                                             
000500
000540
000550          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000570
000580			MOVE "INSECAUS.HTM" TO PAGE-WEB.
000590
000600          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000610
000620 FINE.
000630          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000640
000650          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000660
000670          GOBACK.
000680
000690          COPY "PIOWEB.CBL".
000700          COPY "PIOVIEW.CBL".
000710
000720
000730
000740
000750 REPLACE-WEB.
000760
000770          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
000780
000790
000800 EX-REPLACE-WEB.
000810          EXIT.
000820
000830 LOAD-VIEW.
000840
000850          MOVE "INSERIMENTO"              TO STRINGA-VIEW
000860          MOVE "LAVORO"           		TO NOME-VIEW
000870          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW.
000880
000890 EX-LOAD-VIEW.
000900          EXIT.
