000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENRECA.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000310          COPY "SELORA.CBL".
000320			COPY "SELDATO.CBL".
000330
000340
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEORA.CBL".
000390          COPY "FDEWEB.CBL".
000400          COPY "FDEVIEW.CBL".
000410          COPY "FDETAB.CBL".
000420			COPY "FDEDATO.CBL".
000430
000440 WORKING-STORAGE  SECTION.
000450
000460          COPY "COBW3.CBL".
000470          COPY "GLOBALS.CBL".
000480          COPY "IMAGES.CBL".
000490*
000500 PROCEDURE  DIVISION.
000510*
000520          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000530
000540          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000550          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000560          PERFORM OPEN-IO-ORA  THRU EX-OPEN-IO-ORA.
000570
000580          COPY "INIZIALI.CBL".
000590
000600          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000610
000620          IF ESITO-NOK
000630          MOVE "ERRORE MEMORIZZAZIONE DATI ORARIO" TO MESSAGGIO
000640           ELSE
000650          MOVE "MEMORIZZAZIONE ORARIO  EFFETTUATA"  TO MESSAGGIO.
000660
000670          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000680
000690 FINE.
000700          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000710          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000720			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000730          PERFORM CLOSE-ORA    THRU EX-CLOSE-ORA.
000740
000750          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000760
000770          GOBACK.
000780
000790          COPY "PIOWEB1.CBL".
000800          COPY "PIOVIEW.CBL".
000810          COPY "PIOTAB.CBL".
000820			COPY "PIODATO.CBL".
000830          COPY "PIOORA.CBL".
000840
000850 LOAD-VIEW.
000860
000870          MOVE "LAVORO"   	     TO NOME-VIEW
000880          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000890
000900			MOVE STRINGA-VIEW		TO SW-LAVORO.
000910
000920			IF SW-LAVORO = "INSERIMENTO"
000930           INITIALIZE ORARIO
000940
000950		
000960
000970*****  TIPO RECORD DA INSERIRE
000980
000990
001000			ELSE
001010
001020          MOVE "CHIAVE-ORA" 	    TO NOME-VIEW
001030          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
001040
001050			IF ESITO-NOK
001060			 MOVE "ERRORE NON GESTITO CHIAVE-ORA  SU OPENREOR"
001070			 TO MESSAGGIO
001080			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001090			 GO TO EX-LOAD-VIEW
001100			END-IF
001110
001120*****  RECORD DA VARIARE
001130
001140			MOVE STRINGA-VIEW		TO CHIAVE-ORA 
001150
001160***** LOCK DEL RECORD
001170
001180			PERFORM LEGGO-ORA   	THRU EX-LEGGO-ORA.
001190
001200***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001210
001220
001230			MOVE "OR"				TO CHIAVE-DATO.
001240			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001250			IF ESITO-NOK GO TO FINE-VIEW.
001260
001270******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001280
001290 CICLO-VIEW.
001300
001310			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001320
001330          IF CHIAVE-DATO(1:2) NOT = "OR" MOVE "S" TO FINE-FILE.
001340
001350      	IF FINE-FILE = "S" GO TO FINE-VIEW.
001360		
001370*** IL PRIMO CAMPO  E' ORARIO   LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001380*
001390 CICLO-DATI-VIEW.
001400
001410			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001420
001430			IF CHIAVE-DATO(1:2) NOT = "OR" MOVE "S" TO FINE-FILE.
001440
001450			IF FINE-FILE = "S" GO TO FINE-VIEW.
001460
001470          MOVE NOME-COBOL-DATO    TO FIELD-WEB.
001480
001490          PERFORM READ-WEB        THRU EX-READ-WEB.
001500
001510          IF COBW3-SEARCH-FLAG-EXIST
001520          MOVE VALUE-WEB          TO ORARIO(POS-DATO:SIZE-DATO).
001530
001740
001750			GO TO CICLO-DATI-VIEW.
001760			 
001770
001780 FINE-VIEW.
001790
001800			IF SW-LAVORO = "INSERIMENTO"
001810			 CONTINUE
001820			ELSE
001830			PERFORM AGGIORNO-ORA    THRU EX-AGGIORNO-ORA 
001840			 GO TO EX-LOAD-VIEW.
001850
001860 LOOP-VIEW.
001870
001880          perform SCRIVO-ORA      THRU EX-SCRIVO-ORA.
001890
001900          IF ESITO-NOK ADD 1 TO CODICE-ORA 
001910             GO TO LOOP-VIEW.
001920
001930 EX-LOAD-VIEW.
001940          EXIT.
001950
