000010*
000011* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000012*
000013* This program is free software; you can redistribute it and/or modify
000014* it under the terms of the GNU General Public License as published by
000015* the Free Software Foundation; either version 2, or (at your option)
000016* any later version.
000017*
000018* This program is distributed in the hope that it will be useful,
000019* but WITHOUT ANY WARRANTY; without even the implied warranty of
000020* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000021* GNU General Public License for more details.
000022*
000023* You should have received a copy of the GNU General Public License
000024* along with this software; see the file COPYING.  If not, write to
000025* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000026* Boston, MA 02110-1301 USA
000027*
000028 IDENTIFICATION   DIVISION.
000029 PROGRAM-ID       OPENTA01.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000070			COPY "SPECIAL.CBL".
000071 INPUT-OUTPUT     SECTION.
000080 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110          COPY "SELVIEW.CBL".
000120          COPY "SELTAB.CBL".
000121			COPY "SELDATO.CBL".
000130
000140
000150
000160 DATA             DIVISION.
000170 FILE SECTION.
000180
000190          COPY "FDEWEB.CBL".
000200          COPY "FDEVIEW.CBL".
000210          COPY "FDETAB.CBL".
000211			COPY "FDEDATO.CBL".
000220
000230 WORKING-STORAGE  SECTION.
000320
000330          COPY "COBW3.CBL".
000340          COPY "GLOBALS.CBL".
000350          COPY "IMAGES.CBL".
000360*
000370 PROCEDURE  DIVISION.
000380*
000390          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000400
000401			COPY "INIZIALI.CBL".
000402
000403
000410          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000411			PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000420
000500
000501          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000511
000520          MOVE "TEMPLATE/INSETA01.HTM"    TO PAGE-WEB
000530          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000550
000560 FINE.
000570          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000580          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000581			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000600
000610          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000620
000630          GOBACK.
000640
000650          COPY "PIOWEB1.CBL".
000660          COPY "PIOVIEW.CBL".
000670          COPY "PIOTAB.CBL".
000671			COPY "PIODATO.CBL".
000680
000690
000700 LOAD-VIEW.
000710
000720          MOVE SPACES              TO STRINGA-VIEW.
000766
000767
000768			STRING 
000769
000770			'<a href="openta01.exe?MK-KEY='
000771			 SECTION-WEB DELIMITED BY SIZE
000772			'" class="easyui-linkbutton" data-options="iconCls:'
000773			"'icon-undo'"
000774			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000775			' <span style="font-size:14px;">Indietro</span></a>'  
000776			DELIMITED BY SIZE INTO STRINGA-VIEW.
000777
000778          MOVE "GOBACK"           TO NOME-VIEW
000779          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000781
000782			INITIALIZE TABELLA-001.
000783
000784          MOVE "01"               TO TIPO-TAB.
000790          MOVE 1                  TO PROG-TAB.
000800          MOVE 01                 TO ENTE-TAB.
000810          PERFORM LEGGO-TAB       THRU EX-LEGGO-TAB.
000820
000830          if esito-NOK INITIALIZE TABELLA-001
000836
000837          MOVE "INSERIMENTO"      TO STRINGA-VIEW
000838          MOVE "LAVORO"           TO NOME-VIEW
000839          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW
000840			ELSE
000841          MOVE "VARIAZIONE"       TO STRINGA-VIEW
000842          MOVE "LAVORO"           TO NOME-VIEW
000843          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000844
000851          MOVE TIPO-TAB           TO STRINGA-VIEW
000852          MOVE "TIPO-TAB"         TO NOME-VIEW
000853          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW .
000854
000864          MOVE CHIAVE-TAB 	    TO STRINGA-VIEW
000865          MOVE "CHIAVE-TAB"       TO NOME-VIEW
000866          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000867
000874
001790
001791***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001792
001793
001794			MOVE "TA"				TO CHIAVE-DATO.
001795
001796			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001797
001798			IF ESITO-NOK GO TO EX-LOAD-VIEW.
001799
001800******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001801
001802 CICLO-VIEW.
001803
001804			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001805
001806      	IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001807		
001808			IF NOME-COBOL-DATO(1:9) NOT = "TABELLA-0" GO TO CICLO-VIEW.
001809			 
001810			IF NOME-COBOL-DATO(10:2) NOT = TIPO-TAB GO TO CICLO-VIEW.
001811*
001812*** IL PRIMO CAMPO  E' TABELLA-0XX  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001813*
001815	
001816
001817 CICLO-DATI-VIEW.
001818
001819			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001820
001821**** HA RAGGIUNTO UN ALTRA TABELLA: FINE
001822
001823			IF NOME-COBOL-DATO(1:9) = "TABELLA-0" MOVE "S" TO FINE-FILE.
001824
001825			IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001826
001827
001828***** TODO: GESTIRE IMPORTO O VALORI NUMERICI STANDARD
001829
001830			MOVE TABELLA(POS-DATO:SIZE-DATO) TO STRINGA-VIEW.
001831
001832          MOVE NOME-COBOL-DATO    TO NOME-VIEW.
001833
001834          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001835
001836			GO TO CICLO-DATI-VIEW.
001837		 
001838
001839 EX-LOAD-VIEW.
001840          EXIT.
001841
001842
