000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENVEDI.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300			COPY "SELPRES.CBL".
000301			COPY "SELCART.CBL".
000302			COPY "SELCAUS.CBL".
000303			COPY "SELMATR.CBL".
000304			COPY "SELJSON.CBL".
000305			COPY "SELORA.CBL".
000306
000310
000320 DATA             DIVISION.
000330 FILE SECTION.
000340
000350          COPY "FDEWEB.CBL".
000360          COPY "FDEVIEW.CBL".
000362			COPY "FDEPRES.CBL".
000363			COPY "FDECART.CBL".
000364			COPY "FDECAUS.CBL".
000365			COPY "FDEMATR.CBL".
000366			COPY "FDEJSON.CBL".
000367			COPY "FDEORA.CBL".
000368
000370
000380 WORKING-STORAGE  SECTION.
000381
000390 77 ANNO			PIC 9999.
000391 77 MESE			PIC 99.
000392 77 DOV			PIC X.
000393 77 DEB			PIC X.
000394 77 CRE			PIC X.
000395 77 LAV			PIC X.
000396
000397
000400          COPY "COBW3.CBL".
000410          COPY "GLOBALS.CBL".
000420          COPY "IMAGES.CBL".
000430*
000440 PROCEDURE  DIVISION.
000450*
000460          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000470
000480
000481                                             
000490
000495
000496			MOVE "ID"        		TO FIELD-WEB
000497			PERFORM READ-WEB     	THRU EX-READ-WEB
000499		    MOVE VALUE-WEB       	TO STRINGA-VIEW.
000501			MOVE "MK-MATR"	     	TO NOME-VIEW
000503	        PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000504
000505
000506			if VALUE-WEB = SPACES
000507		    MOVE "INDICARE IL DIPENDENTE DA GESTIRE " TO MESSAGGIO
000508		    PERFORM VIS-MESS		THRU EX-VIS-MESS
000509			GO TO FINE.
000510
000511
000512
000513
000514			MOVE "MESE"        		TO FIELD-WEB
000515			PERFORM READ-WEB     	THRU EX-READ-WEB
000516		    MOVE VALUE-WEB       	TO STRINGA-VIEW.
000517
000520
000521		    MOVE NUMERO-WEB		    TO MESE.
000522
000523			IF MESE > ZEROS
000524			MOVE MESE-IN-CORSO(MESE) TO STRINGA-VIEW.
000525
000526			MOVE "MK-MESE"	     	TO NOME-VIEW
000527	        PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000528
000529			MOVE "ANNO"        		TO FIELD-WEB
000530			PERFORM READ-WEB     	THRU EX-READ-WEB
000531		    MOVE VALUE-WEB       	TO STRINGA-VIEW.
000532		    MOVE NUMERO-WEB		    TO ANNO.
000533			MOVE "MK-ANNO"	     	TO NOME-VIEW
000534	        PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000535
000536			PERFORM OPEN-I-MATR		THRU EX-OPEN-I-MATR.
000537			PERFORM OPEN-I-PRES		THRU EX-OPEN-I-PRES.
000538			PERFORM OPEN-I-CART		THRU EX-OPEN-I-CART.
000539			PERFORM OPEN-I-CAUS		THRU EX-OPEN-I-CAUS.
000540			PERFORM OPEN-I-ORA  	THRU EX-OPEN-I-ORA.
000541
000542		    PERFORM AZZERA-VIEW     THRU EX-AZZERA-VIEW.
000543	
000544
000545
000546          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000547
000550
000552			MOVE "CARTELL.HTM"	TO PAGE-WEB
000980
000990          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
001000
001010
001020 FINE.
001021			perform CLOSE-ORA    THRU EX-CLOSE-ORA.
001030          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
001040          PERFORM CLOSE-CART   THRU EX-CLOSE-CART.
001041          PERFORM CLOSE-PRES   THRU EX-CLOSE-PRES.
001042          PERFORM CLOSE-CAUS   THRU EX-CLOSE-CAUS.
001043			PERFORM CLOSE-MATR   THRU EX-CLOSE-MATR.
001050          PERFORM FINE-WEB     THRU EX-FINE-WEB.
001060
001070          GOBACK.
001080
001081			COPY "PIOORA.CBL".
001082			COPY "PIOMATR.CBL".
001090          COPY "PIOWEB1.CBL".
001100          COPY "PIOVIEW.CBL".
001120			COPY "PIOCART.CBL".
001130			COPY "PIOPRES.CBL".
001140			COPY "PIOCAUS.CBL".
001200			COPY "PIOJSON.CBL".
001201
001210
001211
001212 LOAD-VIEW.
001213
001214
001223
001224			MOVE SPACES				TO STRINGA-VIEW
001225			STRING
001227			'<a href="opencart.exe?MK-KEY='
001228			 SECTION-WEB DELIMITED BY SIZE
001229			"&MK-ENTITA=" DELIMITED BY SIZE
001230			ENTITA-WEB DELIMITED BY "   "
001231			"&MK-FUNZIONE=" DELIMITED BY SIZE
001232			FUNZIONE-WEB DELIMITED BY "   "
001233			" " DELIMITED BY SIZE
001234			'" class="easyui-linkbutton" data-options="iconCls:'
001235			"'icon-undo'"
001236			'" style="padding:5px 0px;width:15%; margin-left:20px">'
001237			' <span style="font-size:14px;">Ritorna</span></a>'  
001238			DELIMITED BY SIZE INTO STRINGA-VIEW.
001239
001240          MOVE "GOBACK"           TO NOME-VIEW
001241          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001242
001243
001244
001264			MOVE "ID"        		TO FIELD-WEB
001265			PERFORM READ-WEB     	THRU EX-READ-WEB
001266		    MOVE NUMERO-WEB       	TO PROG-MATR.
001270			MOVE 01					TO ENTE-MATR.
001271		
001272			PERFORM LEGGO-MATR		THRU EX-LEGGO-MATR.
001273
001274			IF ESITO-NOK INITIALIZE MATRICOLA.
001275
001276
001277
001278		    MOVE COGNOME-MATR    	TO STRINGA-VIEW.
001279
001280			INSPECT STRINGA-VIEW REPLACING ALL "'" BY " "
001281
001282			MOVE "MK-COGNOME"   	TO NOME-VIEW
001283	        PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001284
001285		    MOVE NOME-MATR       	TO STRINGA-VIEW.
001286			MOVE "MK-NOME"   		TO NOME-VIEW
001287	        PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001288
001289		    MOVE BADGE-MATR       	TO STRINGA-VIEW.
001290			MOVE "MK-BADGE"   		TO NOME-VIEW
001291	        PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001292		
001293
001299
001300
001301 			STRING "CARTELLINO" FUNZIONE-WEB 				
001302			DELIMITED BY SIZE INTO  NOME-JSON.
001303
001304          MOVE "FILE-JSON-CART"   TO NOME-VIEW
001305
001306			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001307
001312
001313
001314			MOVE "["			TO DATI-JSON.
001315
001316
001317			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001318
001319			MOVE SPACES				TO DATI-JSON.
001320
001321
001322			move spaces to CARTELLINO.
001325
001326          MOVE ANNO               	TO AA-CART.
001327			MOVE MESE					TO MM-CART
001328			move 01						TO GG-CART.
001329		    MOVE PROG-MATR  			TO DIP-CART.
001330		    MOVE 01       				TO ENTE-CART.
001331          PERFORM STARTO-CART         THRU EX-STARTO-CART.
001332
001333          if ESITO-NOK GO TO FINE-TABELLA.
001334
001337
001338 CICLO-TABELLA.
001339
001340			PERFORM LEGGO-NEXT-CART THRU EX-LEGGO-NEXT-CART.
001346
001347		    IF AA-CART > ANNO MOVE "S" TO FINE-FILE.
001351               
001352		    IF MM-CART NOT = MESE MOVE "S" TO FINE-FILE.
001353
001354			IF DIP-CART  NOT = PROG-MATR MOVE "S" TO FINE-FILE.
001355
001356			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001357
001358			IF AA-CART NOT = ANNO GO TO CICLO-TABELLA.
001359
001360
001361
001362			IF DATI-JSON > SPACES
001363			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001364
001365***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001366
001367			INSPECT CARTELLINO REPLACING ALL "\" BY " ".			
001368
001369
001370			MOVE ORARIO-CART  		TO CHIAVE-ORA
001371
001372			IF ORARIO-ELAB-CART > SPACES
001373			MOVE ORARIO-ELAB-CART 	TO CHIAVE-ORA.
001374
001375			PERFORM LEGGO-ORA 		THRU EX-LEGGO-ORA.
001376
001377			IF ESITO-NOK INITIALIZE ORARIO.
001378
001379
001380			MOVE ":" TO LAV DOV CRE DEB.
001381
001382
001383
001384			IF DOVUTO-CART = "0000" MOVE SPACES 	TO DOVUTO-CART DOV.
001385			IF LAVORO-CART = "0000" MOVE SPACES 	TO LAVORO-CART LAV.
001386			IF CREDITO-CART = "0000" MOVE SPACES 	TO CREDITO-CART CRE.
001387			IF DEBITO-CART = "0000" MOVE SPACES 	TO DEBITO-CART DEB.
001388
001389
001390
001391
001392
001393				
001394**** ITEM
001395
001396			IF TIPO-GIORNO-CART = "F"
001397
001398			STRING "       {"
001399			'"DESC01":"'	DELIMITED BY SIZE
001400			"<strong>"                             DELIMITED BY SIZE
001401			"<font color='red'>"                 DELIMITED BY SIZE
001402			GG-CART       DELIMITED BY "   "
001403			"-" SIGLA-GG-CART
001404			"</font>"                            DELIMITED BY SIZE
001406			"</strong>"                             DELIMITED BY SIZE
001407			'",'			DELIMITED BY SIZE
001408			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001409
001410			ELSE
001411		
001412			STRING "       {"
001413
001414			'"DESC01":"'	DELIMITED BY SIZE
001415
001416
001417			GG-CART       DELIMITED BY "   "
001418			"-" SIGLA-GG-CART
001419			'",'			DELIMITED BY SIZE
001420			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001421
001422
001423
001424			STRING "        "
001425			'"STATO":"'	DELIMITED BY SIZE
001426          COD-ERRORE-CART DELIMITED BY "   "
001427
001428			'",'			DELIMITED BY SIZE
001429			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001430
001431
001432
001433**** ITEM
001434			STRING "        "
001435			'"DESC02":"'	DELIMITED BY SIZE
001436          PROFILO-CART DELIMITED BY "   "
001437
001438			'",'			DELIMITED BY SIZE
001439			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001440**** ITEM
001441			STRING "        "
001442			'"DESC03":"'	DELIMITED BY SIZE
001443			"<strong>"                             DELIMITED BY SIZE
001444
001445			ORARIO-CART     DELIMITED BY "     "
001446			" " 			DELIMITED BY SIZE
001447			CHIAVE-ORA DELIMITED BY  "  "
001448			" " 			DELIMITED BY SIZE
001449			 DESC-ORA		DELIMITED BY "   "
001450			"</strong>"                            DELIMITED BY SIZE
001451			'",'			DELIMITED BY SIZE
001452			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001453**** ITEM
001454			STRING "        "
001455			'"DESC04":"'	DELIMITED BY SIZE
001456			ORE-DOV-CART    DELIMITED BY SIZE
001457			DOV				DELIMITED BY SIZE
001458			MIN-DOV-CART    DELIMITED BY SIZE
001459			'",'			DELIMITED BY SIZE
001460			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001461**** ITEM
001462
001463			STRING "        "
001464			'"DESC05":"'	DELIMITED BY SIZE
001465			ORE-LAV-CART    DELIMITED BY SIZE
001466			LAV				DELIMITED BY SIZE
001467			MIN-LAV-CART    DELIMITED BY SIZE
001468			'",'			DELIMITED BY SIZE
001469			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001470
001471**** ITEM
001472
001473			IF DEBITO-CART NOT = ZEROS
001475			STRING "        "
001476			'"DESC06":"'	DELIMITED BY SIZE
001477			"<font color='red'>"                 DELIMITED BY SIZE
001478			ORE-DEB-CART    DELIMITED BY SIZE
001479			DEB 			DELIMITED BY SIZE
001480			MIN-DEB-CART    DELIMITED BY SIZE
001481			"</font'>"      DELIMITED BY SIZE
001482			'",'			DELIMITED BY SIZE
001483			INTO DATI-JSON  
001484
001485			ELSE
001486			STRING "        "
001493			'"DESC06":"'	DELIMITED BY SIZE
001494			'",'			DELIMITED BY SIZE
001495			INTO DATI-JSON.
001496
001497
001498			PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001499
001500
001501**** ITEM
001502
001511
001512			IF CREDITO-CART NOT = ZEROS
001513			STRING "        "
001514			'"DESC07":"'	DELIMITED BY SIZE
001515			"<font color='darkgreen'>"                 DELIMITED BY SIZE
001516			ORE-CRE-CART    DELIMITED BY SIZE
001517			CRE 			DELIMITED BY SIZE
001518			MIN-CRE-CART    DELIMITED BY SIZE
001519			"</font>"                 DELIMITED BY SIZE
001520			'",'			DELIMITED BY SIZE
001521			INTO DATI-JSON  
001522
001523			ELSE
001524			STRING "        "
001525			'"DESC07":"'	DELIMITED BY SIZE
001526			'",'			DELIMITED BY SIZE
001527			INTO DATI-JSON.
001528
001530			PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001531
001532
001533			MOVE 7				TO CONTA.
001534
001535			INITIALIZE PRESENZA.
001536
001537			MOVE DATA-CART		TO DATA-PRES
001538			MOVE DIP-MATR    	TO DIP-PRES.
001539			MOVE DATA-CART		TO DATA-PRES
001540		    MOVE ENTE-CART		TO ENTE-PRES.
001541
001542			PERFORM STARTO-PRES THRU EX-STARTO-PRES.
001543
001544			IF ESITO-NOK GO TO RICICLO.
001545
001546
001547		    
001548
001549 CICLO-PRES.
001550
001551
001552          PERFORM LEGGO-NEXT-PRES THRU EX-LEGGO-NEXT-PRES.
001553
001554
001555			IF DIP-PRES NOT = PROG-MATR MOVE "S" TO FINE-FILE.
001556
001557			IF DATA-PRES NOT = DATA-CART MOVE "S" TO FINE-FILE.
001558		
001559			IF FINE-FILE = "S" GO TO RICICLO.
001560
001561
001562
001563
001564			MOVE SPACES		TO ARGUMENT
001565
001566			IF CAUS-PRES NOT = ZERO
001567			MOVE CAUS-PRES	TO CHIAVE-CAUS
001568			PERFORM LEGGO-CAUS THRU EX-LEGGO-CAUS
001569		
001570			STRING " " CAUS-PRES " " SIGLA-CAUS 
001571			 DELIMITED BY SIZE INTO ARGUMENT.
001572
001573			ADD 1				TO CONTA.
001574
001575
001576			IF CONTA = 1
001577			 PERFORM VUOTI		THRU EX-VUOTI.
001578
001579			EVALUATE CONTA 
001580
001581			WHEN 8
001582			STRING "        "
001583			'"DESC08":"'	DELIMITED BY SIZE
001584			ORA-PRES        DELIMITED BY SIZE
001585			":"				DELIMITED BY SIZE
001586			MIN-PRES        DELIMITED BY SIZE
001587			ARGUMENT DELIMITED BY "  "
001588			'",'			DELIMITED BY SIZE
001589			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001590
001591			WHEN 9
001592			STRING "        "
001593			'"DESC09":"'	DELIMITED BY SIZE
001594			ORA-PRES        DELIMITED BY SIZE
001595			":"				DELIMITED BY SIZE
001596			MIN-PRES        DELIMITED BY SIZE
001597			ARGUMENT DELIMITED BY "  "
001598			'",'			DELIMITED BY SIZE
001599			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001600
001601			WHEN 10
001602			STRING "        "
001603			'"DESC10":"'	DELIMITED BY SIZE
001604			ORA-PRES        DELIMITED BY SIZE
001605			":"				DELIMITED BY SIZE
001606			MIN-PRES        DELIMITED BY SIZE
001607			ARGUMENT DELIMITED BY "  "
001608			'",'			DELIMITED BY SIZE
001609			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001610
001611			WHEN 11
001612			STRING "        "
001613			'"DESC11":"'	DELIMITED BY SIZE
001614			ORA-PRES        DELIMITED BY SIZE
001615			":"				DELIMITED BY SIZE
001616			MIN-PRES        DELIMITED BY SIZE
001617			ARGUMENT DELIMITED BY "  "
001618			'",'			DELIMITED BY SIZE
001619			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001620
001621
001622			WHEN 12
001623			STRING "        "
001624			'"DESC12":"'	DELIMITED BY SIZE
001625			ORA-PRES        DELIMITED BY SIZE
001626			":"				DELIMITED BY SIZE
001627			MIN-PRES        DELIMITED BY SIZE
001628			ARGUMENT DELIMITED BY "  "
001629			'",'			DELIMITED BY SIZE
001630			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001631
001632 			WHEN 13
001633			STRING "        "
001634			'"DESC13":"'	DELIMITED BY SIZE
001635			ORA-PRES        DELIMITED BY SIZE
001636			":"				DELIMITED BY SIZE
001637			MIN-PRES        DELIMITED BY SIZE
001638			ARGUMENT DELIMITED BY "  "
001639			'",'			DELIMITED BY SIZE
001640			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001641
001642 			WHEN 14
001643			STRING "        "
001644			'"DESC14":"'	DELIMITED BY SIZE
001645			ORA-PRES        DELIMITED BY SIZE
001646			":"				DELIMITED BY SIZE
001647			MIN-PRES        DELIMITED BY SIZE
001648			ARGUMENT DELIMITED BY "  "
001649			'",'			DELIMITED BY SIZE
001650			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001651
001652 			WHEN 15
001653			STRING "        "
001654			'"DESC15":"'	DELIMITED BY SIZE
001655			ORA-PRES        DELIMITED BY SIZE
001656			":"				DELIMITED BY SIZE
001657			MIN-PRES        DELIMITED BY SIZE
001658			ARGUMENT DELIMITED BY "  "
001659			'",'			DELIMITED BY SIZE
001660			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001661
001665 		 	PERFORM TASTI	THRU EX-TASTI.
001666
001668			
001669          GO TO CICLO-PRES.
001670		
001671
001672
001673 RICICLO.
001674
001675			IF CONTA = 07
001676			 ADD 1				TO CONTA
001677			STRING "        "
001678			'"DESC08":"'	DELIMITED BY SIZE
001679			'",'			DELIMITED BY SIZE
001680			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001681
001682			IF CONTA = 08
001683			 ADD 1				TO CONTA
001684			STRING "        "
001685			'"DESC09":"'	DELIMITED BY SIZE
001686			'",'			DELIMITED BY SIZE
001687			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001688
001689
001690			IF CONTA = 09
001691			 ADD 1				TO CONTA
001692			STRING "        "
001693			'"DESC10":"'	DELIMITED BY SIZE
001694			'",'			DELIMITED BY SIZE
001695			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001696
001697			IF CONTA = 10
001698			 ADD 1				TO CONTA
001699			STRING "        "
001700			'"DESC11":"'	DELIMITED BY SIZE
001701			'",'			DELIMITED BY SIZE
001702			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001703
001704			IF CONTA = 11
001705			 ADD 1				TO CONTA
001706			STRING "        "
001707			'"DESC12":"'	DELIMITED BY SIZE
001708			'",'			DELIMITED BY SIZE
001709			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001710
001711			IF CONTA = 12
001712			 ADD 1				TO CONTA
001713			STRING "        "
001714			'"DESC13":"'	DELIMITED BY SIZE
001715			'",'			DELIMITED BY SIZE
001716			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001717
001718			IF CONTA = 13 
001719			 ADD 1				TO CONTA
001720			STRING "        "
001721			'"DESC14":"'	DELIMITED BY SIZE
001722			'",'			DELIMITED BY SIZE
001723			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001724
001725			IF CONTA = 14 
001726			 ADD 1				TO CONTA
001727			STRING "        "
001728			'"DESC15":"'	DELIMITED BY SIZE
001729			'",'			DELIMITED BY SIZE
001730			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON
001732
001733			PERFORM TASTI	THRU EX-TASTI.
001734
001735
001736			GO TO CICLO-TABELLA.
001737
001738
001739 FINE-TABELLA.
001740
001741			INSPECT DATI-JSON REPLACING all "}, " BY
001742										    "}  ".
001743
001744			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001745
001746
001747			MOVE "]"					TO DATI-JSON.
001748			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
001749
001750			CLOSE ARKJSON.
001751		
001752
001753 EX-LOAD-VIEW.
001754          EXIT.
001755
001756 TASTI.
001757
001758**** ITEM
001759			STRING "        "
001760			'"' 		
001761			'CALCOLA":"'	DELIMITED BY SIZE
001762			'<a href=opencalc.exe?MK-KEY='
001763			 SECTION-WEB DELIMITED BY SIZE
001764			"&MK-ITEM=" DELIMITED BY SIZE
001765			CHIAVE-CART DELIMITED BY SIZE
001766			'>' delimited by size 
001767			"<img src='/openpa/images/sum.png' BORDER='0'></a>",
001768				delimited by size 
001769			'",'			DELIMITED BY SIZE
001770			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001771**** ITEM
001772			STRING "        "
001773			'"' 		
001774			'MODIFICA":"'	DELIMITED BY SIZE
001775			'<a href=openmocr.exe?MK-KEY='
001776			 SECTION-WEB DELIMITED BY SIZE
001777			"&MK-ITEM=" DELIMITED BY SIZE
001778			CHIAVE-CART
001779			'>' delimited by size 
001780			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001781				delimited by size 
001782          '"},' DELIMITED BY SIZE 
001783
001784			INTO DATI-JSON  
001785
001786			
001787
001788
001789			MOVE zeros		TO CONTA.
001790
001791
001792 EX-TASTI.
001793			EXIT.
001794
001795 AZZERA-VIEW.
001796
001797			MOVE "VEDI"					TO CHIAVE-DATO-VIEW.
001798			PERFORM STARTO-DATO-VIEW	THRU EX-STARTO-DATO-VIEW.
001799			IF ESITO-NOK GO TO EX-AZZERA-VIEW.
001800
001801 CICLO-AZZERA-VIEW.
001802
001803			PERFORM LEGGO-NEXT-VIEW THRU EX-LEGGO-NEXT-VIEW.
001804
001805
001806			IF CHIAVE-DATO-VIEW(1:4) NOT = "VEDI" MOVE "S" TO FINE-FILE.
001807
001808			IF FINE-FILE = "S" GO TO EX-AZZERA-VIEW.
001809
001810			IF CHIAVE-DATO-VIEW(1:4) = "VEDI"    
001811			 PERFORM CANCELLO-VIEW	THRU EX-CANCELLO-VIEW.
001812
001813			GO TO CICLO-AZZERA-VIEW.
001814
001815 EX-AZZERA-VIEW.
001816			EXIT.
001817
001818 VUOTI.
001819
001820			MOVE "},{"		TO DATI-JSON.
001821			PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001822
001823**** ITEM
001824
001825		
001826			STRING "        "
001827
001828			'"DESC01":"'	DELIMITED BY SIZE
001829			'",'			DELIMITED BY SIZE
001830			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001831
001832
001833			STRING "        "
001834			'"STATO":"'	DELIMITED BY SIZE
001835			'",'			DELIMITED BY SIZE
001836			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001837
001838
001839**** ITEM
001840			STRING "        "
001841			'"DESC02":"'	DELIMITED BY SIZE
001842			'",'			DELIMITED BY SIZE
001843			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001844**** ITEM
001845			STRING "        "
001846			'"DESC03":"'	DELIMITED BY SIZE
001847			'",'			DELIMITED BY SIZE
001848			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001849**** ITEM
001850			STRING "        "
001851			'"DESC04":"'	DELIMITED BY SIZE
001852			'",'			DELIMITED BY SIZE
001853			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001854**** ITEM
001855
001856			STRING "        "
001857			'"DESC05":"'	DELIMITED BY SIZE
001858			'",'			DELIMITED BY SIZE
001859			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001860
001861**** ITEM
001862
001863			STRING "        "
001864			'"DESC06":"'	DELIMITED BY SIZE
001865			'",'			DELIMITED BY SIZE
001866			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001867
001868
001869**** ITEM
001870
001871			STRING "        "
001872			'"DESC07":"'	DELIMITED BY SIZE
001873			'",'			DELIMITED BY SIZE
001874			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001875
001876			MOVE 8			to CONTA.
001877
001878
001879 EX-VUOTI.
001880			EXIT.
001881	
