000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENPA00.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000320			COPY "SPECIAL.CBL".
000321
000330 INPUT-OUTPUT     SECTION.
000340 FILE-CONTROL.
000350
000360          COPY "SELWEB.CBL".
000370	     	COPY "SELVIEW.CBL".
000380          COPY "SELUTEN.CBL".
000390       	COPY "SELTAB.CBL".
000420
000430		
000440
000450 DATA             DIVISION.
000460 FILE SECTION.
000470
000480          COPY "FDEWEB.CBL".
000490	        COPY "FDEVIEW.CBL".
000500          COPY "FDEUTEN.CBL".
000510          COPY "FDETAB.CBL".
000540
000550 WORKING-STORAGE  SECTION.
000560
000570          COPY "COBW3.CBL".
000580          COPY "GLOBALS.CBL".
000590			COPY "IMAGES.CBL".
000600*
000610 PROCEDURE  DIVISION.
000620
000630 DECLARATIVES.
000640 ERROR-ARCHIVIO SECTION.
000650			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW ARKLOG.
000660 EX-ERRORE-ARCHIVIO.
000670			EXIT.
000680 END DECLARATIVES.
000690
000700*
000710          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000720
000730			                                    
000830
000840          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000880
000950
000960          MOVE "UTENTE"        TO NOME-VIEW
000970          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000980
000990          MOVE STRINGA-VIEW    TO NOME-UTEN.
001000          PERFORM LETTURA-UTEN THRU EX-LETTURA-UTEN.
001010          
001020           IF ESITO-NOK
001030            STRING "SESSIONE SCADUTA O UTENTE NON LOGGATO:" CHIAVE-UTEN
001040			  DELIMITED BY SIZE INTO MESSAGGIO
001050            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
001060           ELSE
001070
001080          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN
001090
001100			PERFORM LOAD-VIEW	 THRU EX-LOAD-VIEW
001110
001120
001121			STRING PATH-WEB DELIMITED BY "  "
001122		       "openmenu.htm" DELIMITED BY SIZE
001123             INTO PAGE-WEB.
001124
001130          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
001140		
001150			PERFORM CLOSE-VIEW	THRU EX-CLOSE-VIEW.
001160          
001170 FINE.
001180			PERFORM CLOSE-UTEN   THRU EX-CLOSE-UTEN.  
001220 USCITA.
001230	        PERFORM FINE-WEB     THRU EX-FINE-WEB.
001240
001250          GOBACK.
001260
001270	    	COPY "PIOWEB1.CBL".
001280         	COPY "PIOVIEW.CBL".
001290          COPY "PIOTAB.CBL".
001300          COPY "PIOUTEN.CBL".
001330
001340
001350 LOAD-VIEW.
001360
001370	        STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
001380           DELIMITED BY SIZE INTO STRINGA-VIEW.
001390
001400          MOVE "SCADENZA"       TO NOME-VIEW
001410          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001420
001430
001440          MOVE "VALIDITA"      TO NOME-VIEW
001450		    MOVE SPACES			 TO STRINGA-VIEW.
001460
001470			STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
001480			DELIMITED BY SIZE INTO STRINGA-VIEW.
001490
001500          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001510 
001520
001530 EX-LOAD-VIEW.
001540		   EXIT.
