000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200 IDENTIFICATION   DIVISION.
000210 PROGRAM-ID       OPENPA01.
000220 ENVIRONMENT      DIVISION.
000230 CONFIGURATION    SECTION.
000240
000250			COPY "SPECIAL.CBL".
000260
000270 INPUT-OUTPUT     SECTION.
000280 FILE-CONTROL.
000290
000300          COPY "SELWEB.CBL".
000310          COPY "SELVIEW.CBL".
000320          COPY "SELUTEN.CBL".
000330          COPY "SELTAB.CBL".
000360
000370
000380
000390 DATA             DIVISION.
000400 FILE SECTION.
000410
000420          COPY "FDEWEB.CBL".
000430          COPY "FDEVIEW.CBL".
000440          COPY "FDEUTEN.CBL".
000450          COPY "FDETAB.CBL".
000480
000490 WORKING-STORAGE  SECTION.
000500
000510          COPY "COBW3.CBL".
000520          COPY "GLOBALS.CBL".
000530          COPY "IMAGES.CBL".
000540*
000550 PROCEDURE  DIVISION.
000560*
000570          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000580
000590          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000600
000610          MOVE "MK-UTENTE"    TO FIELD-WEB
000620          PERFORM READ-WEB    THRU EX-READ-WEB
000630
000640          MOVE FUNCTION UPPER-CASE(VALUE-WEB)   TO NOME-UTEN
000641          PERFORM LEGGO-UTEN  THRU EX-LEGGO-UTEN.
000700
000710          IF ESITO-NOK
000720		    INITIALIZE UTENTE
000730			ELSE
000740		 	PERFORM SESSIONE	THRU EX-SESSIONE.
000750 
000760          PERFORM OPEN-O-VIEW THRU EX-OPEN-O-VIEW.
000770
000780          PERFORM LOAD-VIEW   THRU EX-LOAD-VIEW.
000790          
000791
000792			MOVE "MK-PASSWORD"  TO FIELD-WEB
000793	        PERFORM READ-WEB    THRU EX-READ-WEB
000794
000803			MOVE VALUE-WEB      TO FIELD-WEB.
000810          PERFORM SHA-WEB     THRU EX-SHA-WEB.
000820          
000850
000851          MOVE VALUE-WEB      TO STRINGA-VIEW.
000852          MOVE "SHA3-WEB"     TO NOME-VIEW
000853          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
000854          
000860          IF VALUE-WEB NOT = PASSWORD-UTEN
000880			OR PASSWORD-UTEN = SPACES
000890          MOVE "ERRORE LOGIN UTENTE" TO MESSAGGIO
000900          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
000910			GO TO FINE.
000911              
000920          MOVE "TEMPLATE/openmenu.htm"    TO PAGE-WEB .
000941         
000970
000980          PERFORM MAKE-WEB    THRU EX-MAKE-WEB
000990
001020          PERFORM CLOSE-VIEW  THRU EX-CLOSE-VIEW.
001030
001040		   
001050
001060
001070 FINE.
001080          PERFORM CLOSE-UTEN  THRU EX-CLOSE-UTEN.
001090
001100
001110          PERFORM FINE-WEB    THRU EX-FINE-WEB.
001120
001130          GOBACK.
001140
001150          COPY "PIOWEB1.CBL".
001160          COPY "PIOUTEN.CBL".
001170          COPY "PIOVIEW.CBL".
001180          COPY "PIOTAB.CBL".
001210
001300 
001310 LOAD-VIEW.
001320
001330          MOVE SPACES TO STRINGA-VIEW.
001340          DISPLAY "REMOTE_ADDR" UPON ENV-NAME
001350          ACCEPT STRINGA-VIEW   FROM ENV-VALUE
001360          ON EXCEPTION CONTINUE
001370          END-ACCEPT.
001380
001390          MOVE "REMOTE-IP"       TO NOME-VIEW
001400          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001410
001420          MOVE SPACES TO STRINGA-VIEW.
001430
001440          DISPLAY "REMOTE_PORT" UPON ENV-NAME
001450          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001460          ON EXCEPTION CONTINUE
001470          END-ACCEPT.
001480
001490          MOVE "REMOTE-PORT"     TO NOME-VIEW
001500          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001510
001520
001530
001540          DISPLAY "TEST_PORT" UPON ENV-NAME 
001550
001560          DISPLAY "FEDERICO" UPON ENV-VALUE
001570
001580          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001590          ON EXCEPTION CONTINUE
001600          END-ACCEPT.
001610
001620          MOVE "TEST-PORT"  TO NOME-VIEW
001630          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001640
001650
001660
001670
001680          MOVE SECTION-WEB    TO STRINGA-VIEW.
001690          MOVE "SECTION-WEB"  TO NOME-VIEW
001700          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001710
001720
001730          PERFORM OPEN-I-TAB  THRU EX-OPEN-I-TAB.
001740          MOVE 1                  TO PROG-TAB.
001750          MOVE "01"           TO TIPO-TAB.
001760          MOVE 01             TO ENTE-TAB.
001770          PERFORM LEGGO-TAB   THRU EX-LEGGO-TAB.
001780
001790          IF ESITO-NOK MOVE "ENTE DI PROVA" TO DESC-ENTE-001.
001800
001810          CLOSE ARKTAB.
001820
001830          MOVE DESC-ENTE-001  TO STRINGA-VIEW.
001840          MOVE "DESC-ENTE"    TO NOME-VIEW
001850          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001860
001870
001880          MOVE NOME-UTEN      TO STRINGA-VIEW
001890          MOVE "UTENTE"       TO NOME-VIEW
001900          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001910
001920
001930
001940
001950          ACCEPT DATA-SYS FROM DATE.
001960          MOVE GG-SYS         TO GG-WEB.
001970          MOVE MM-SYS         TO MM-WEB.
001980          MOVE AA-SYS         TO AA-WEB.
001990          ADD 2000                        TO AA-WEB.
002000
002010          MOVE DATA-WEB       TO DATA-VIEW
002020          MOVE "OGGI  "       TO NOME-VIEW
002030          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002040
002050
002060
002070          MOVE "MK-DATA"      TO FIELD-WEB
002080          PERFORM READ-WEB    THRU EX-READ-WEB
002090
002100          MOVE DATA-WEB       TO DATA-VIEW
002110
002120          MOVE "ACCESSO"      TO NOME-VIEW
002130          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002140
002150          STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
002160           DELIMITED BY SIZE INTO STRINGA-VIEW.
002170
002180          MOVE "SCADENZA"       TO NOME-VIEW
002190          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002200
002210
002220          MOVE "VALIDITA"      TO NOME-VIEW
002230          MOVE SPACES          TO STRINGA-VIEW.
002240
002250          STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
002260          DELIMITED BY SIZE INTO STRINGA-VIEW.
002270
002280          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002290
002300
002310
002320 EX-LOAD-VIEW.
002330          EXIT.
002340
002490
002500
004280 SESSIONE.
004350
004360          ACCEPT TIME-SECTION-WEB FROM TIME.
004370
004380          ACCEPT DATA-SYS FROM DATE.
004390          MOVE GG-SYS         TO GG-SECTION-WEB.
004400          MOVE MM-SYS         TO MM-SECTION-WEB.
004410          MOVE AA-SYS         TO AA-SECTION-WEB.
004420          ADD 2000            TO AA-SECTION-WEB.
004430
004440          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN.
004450
004460 EX-SESSIONE.
004470			EXIT.
004480
