000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENORAR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230			COPY "SPECIAL.CBL".
000240 INPUT-OUTPUT     SECTION.
000250 FILE-CONTROL.
000260
000270          COPY "SELWEB.CBL".
000280          COPY "SELVIEW.CBL".
000290          COPY "SELORA.CBL".
000300		    COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDEORA.CBL".
000400		    COPY "FDEJSON.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520          PERFORM OPEN-I-ORA  THRU EX-OPEN-I-ORA.
000530
000540          COPY "INIZIALI.CBL".
000550
000560          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000570
000580		    MOVE "TEMPLATE/ORARI.HTM" TO PAGE-WEB.
000590
000600          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000610
000620
000630 FINE.
000640          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000650          PERFORM CLOSE-ORA   THRU EX-CLOSE-ORA.
000660
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB1.CBL".
000720          COPY "PIOVIEW.CBL".
000730  	    COPY "PIOJSON.CBL".
000740          COPY "PIOORA.CBL".
000750
000760 LOAD-VIEW.
000770
000780          MOVE SPACES             TO STRINGA-VIEW.
000790
000800
000810			STRING
000820
000830			'<a href="openorar.exe?MK-KEY='
000840			 SECTION-WEB DELIMITED BY SIZE
000850			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
000860			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
000870			'" class="easyui-linkbutton" data-options="iconCls:'
000880			"'icon-undo'"
000890			'" style="padding:5px 0px;width:25%; margin-left:20px">'
000900			' <span style="font-size:14px;">Indietro</span></a>'
000910			DELIMITED BY SIZE INTO STRINGA-VIEW.
000920
000930
000940           MOVE "GOBACK"           TO NOME-VIEW
000950           PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000960
000970
000980			STRING "ORARI" FUNZIONE-WEB 				
000990			DELIMITED BY SIZE INTO  NOME-JSON.
001000
001010			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001020
001030			STRING "/OpenPA/" FILE-JSON
001040			 DELIMITED BY SIZE INTO STRINGA-VIEW.
001050
001060          MOVE "FILE-JSON"        TO NOME-VIEW
001070          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001080
001090			MOVE ZEROS				TO CONTA.
001100
001110			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001120
001130			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001140			 OR CONTA(IND:1) > "0"
001150			 CONTINUE
001160			END-PERFORM.
001170
001180			STRING '{"total":' CONTA(IND:) ',"rows":['		
001190			DELIMITED BY SIZE INTO DATI-JSON.
001200			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001210
001220			MOVE SPACES				TO DATI-JSON.
001230
001240           MOVE LOW-VALUE          TO CHIAVE-ORA.
001250           PERFORM STARTO-ORA     THRU EX-STARTO-ORA.
001260
001270           if ESITO-NOK GO TO FINE-TABELLA.
001280
001290
001300 CICLO-TABELLA.
001310
001320			PERFORM LEGGO-NEXT-ORA THRU EX-LEGGO-NEXT-ORA.
001330
001340			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001350
001360			IF DATI-JSON > SPACES
001370			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001380
001390***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001400
001410			INSPECT ORARIO REPLACING ALL "\" BY " ".			
001420
001430				
001440**** ITEM
001450		
001460			STRING
001470
001480			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001490			CODICE-ORA   DELIMITED BY "   "
001500			'",'			DELIMITED BY SIZE
001510			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001520
001530**** ITEM
001540			STRING "        "
001550			'"DESC":"'	DELIMITED BY SIZE
001560			DESC-ORA       DELIMITED BY "     "
001570			'",'			DELIMITED BY SIZE
001580			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001590**** ITEM
001600			STRING "        "
001610			'"TIPO":"'	DELIMITED BY SIZE
001620			TIPO-ORA       DELIMITED BY "     "
001630			'",'			DELIMITED BY SIZE
001640			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001650**** ITEM
001660			STRING "        "
001670			'"DESC1":"'	DELIMITED BY SIZE
001680			TESTO-ORA      DELIMITED BY "     "
001690			'",'			DELIMITED BY SIZE
001700			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001710**** ITEM
001720			STRING "        "
001730			'"' 		
001740			'CANCELLA":"'	DELIMITED BY SIZE
001750			'<a href=opencanc.exe?MK-KEY='
001760			 SECTION-WEB DELIMITED BY SIZE
001770			"&MK-ITEM=" DELIMITED BY SIZE
001780			CHIAVE-ORA
001790			"&MK-FILE=OR" DELIMITED BY SIZE
001800			'>' delimited by size
001810			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001820				delimited by size
001830			'",'			DELIMITED BY SIZE
001840			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001850**** ITEM
001860			STRING "        "
001870			'"' 		
001880			'MODIFICA":"'	DELIMITED BY SIZE
001890			'<a href=openmoor.exe?MK-KEY='
001900			 SECTION-WEB DELIMITED BY SIZE
001910			"&MK-ITEM=" DELIMITED BY SIZE
001920			CHIAVE-ORA
001930			'>' delimited by size
001940			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
001950				delimited by size
001960          '"},' DELIMITED BY SIZE
001970			into dati-JSON.
001980
001990
002000			GO TO CICLO-TABELLA.
002010
002020
002030 FINE-TABELLA.
002040
002050			INSPECT DATI-JSON REPLACING all "}, " BY
002060										    "}  ".
002070
002080			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002090
002100
002110			MOVE "]}"					TO DATI-JSON.
002120			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002130
002140			CLOSE ARKJSON.
002150
002160
002170 EX-LOAD-VIEW.
002180          EXIT.
002190
002200 CONTA-RECORD.
002210
002220          MOVE LOW-VALUE          TO CHIAVE-ORA.
002230          PERFORM STARTO-ORA     THRU EX-STARTO-ORA.
002240			
002250			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002260
002270 CICLO-CONTA-RECORD.
002280
002290			PERFORM LEGGO-NEXT-ORA THRU EX-LEGGO-NEXT-ORA.
002300
002310			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002320
002330			ADD 1					TO CONTA.
002340
002350			GO TO CICLO-CONTA-RECORD.
002360
002370 EX-CONTA-RECORD.
002380			EXIT.
002390
