000010*
000011* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000012*
000013* This program is free software; you can redistribute it and/or modify
000014* it under the terms of the GNU General Public License as published by
000015* the Free Software Foundation; either version 2, or (at your option)
000016* any later version.
000017*
000018* This program is distributed in the hope that it will be useful,
000019* but WITHOUT ANY WARRANTY; without even the implied warranty of
000020* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000021* GNU General Public License for more details.
000022*
000023* You should have received a copy of the GNU General Public License
000024* along with this software; see the file COPYING.  If not, write to
000025* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000026* Boston, MA 02110-1301 USA
000027*
000028 IDENTIFICATION   DIVISION.
000029 PROGRAM-ID       OPENRE07.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000050 SPECIAL-NAMES.
000060          DECIMAL-POINT IS COMMA.
000070 INPUT-OUTPUT     SECTION.
000080 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110          COPY "SELVIEW.CBL".
000120          COPY "SELTAB.CBL".
000130
000140
000150
000160 DATA             DIVISION.
000170 FILE SECTION.
000180
000190          COPY "FDEWEB.CBL".
000200          COPY "FDEVIEW.CBL".
000210          COPY "FDETAB.CBL".
000220
000230 WORKING-STORAGE  SECTION.
000240
000250          COPY "COBW3.CBL".
000260          COPY "GLOBALS.CBL".
000270          COPY "IMAGES.CBL".
000280*
000290 PROCEDURE  DIVISION.
000300*
000310          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000320
000330          PERFORM OPEN-IO-TAB  THRU EX-OPEN-IO-TAB.
000340
000350          COPY "INIZIALI.CBL".
000360
000370
000380          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000390
000400          IF ESITO-NOK
000410          MOVE "ERRORE MEMORIZZAZIONE DATI TABELLE" TO MESSAGGIO
000420           ELSE
000430          MOVE "MEMORIZZAZIONE TABELLE EFFETTUATA"  TO MESSAGGIO.
000440
000450          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000460
000470 FINE.
000480          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000490          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000500
000510          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000520
000530          GOBACK.
000540
000550          COPY "PIOWEB.CBL".
000560          COPY "PIOVIEW.CBL".
000570          COPY "PIOTAB.CBL".
000580
000590
000600 LOAD-VIEW.
000610
000611          MOVE "LAVORO"   	     TO NOME-VIEW
000612          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000616
000617			MOVE STRINGA-VIEW		TO SW-LAVORO.
000618
000619			IF SW-LAVORO = "INSERIMENTO"
000621           INITIALIZE TABELLA
000622
000623          MOVE "07"               TO TIPO-TAB
000624          MOVE 1                  TO PROG-TAB
000625          MOVE 01                 TO ENTE-TAB
000627
000628			ELSE
000629
000633          MOVE "CHIAVE-TAB"	    TO NOME-VIEW
000634          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
000635
000636			MOVE STRINGA-VIEW		TO CHIAVE-TAB
000637
000638***** LOCK DEL RECORD
000639
000640			PERFORM LEGGO-TAB		THRU EX-LEGGO-TAB.
000641
000650
000681          MOVE "DESC-QUAL-007"    TO FIELD-WEB
000683          PERFORM READ-WEB        THRU EX-READ-WEB.
000686          MOVE VALUE-WEB          TO DESC-QUAL-007.
000687
000688          MOVE "CONTO-007"        TO FIELD-WEB
000689          PERFORM READ-WEB        THRU EX-READ-WEB.
000690          MOVE VALUE-WEB          TO CONTO-007.
000691
000692          MOVE "TIPO-QUAL-007"    TO FIELD-WEB
000693          PERFORM READ-WEB        THRU EX-READ-WEB.
000694          MOVE VALUE-WEB          TO TIPO-QUAL-007.
000695
000696
000697			IF SW-LAVORO = "INSERIMENTO"
000698			 CONTINUE
000699			ELSE
000700			PERFORM AGGIORNO-TAB	THRU EX-AGGIORNO-TAB
000701			 GO TO EX-LOAD-VIEW.
000702
000703 LOOP-VIEW.
000704
000705          perform SCRIVO-TAB      THRU EX-SCRIVO-TAB.
000706
000707          IF ESITO-NOK ADD 1 TO PROG-TAB
000708             GO TO LOOP-VIEW.
000709
000810 EX-LOAD-VIEW.
000820          EXIT.
000830
000840
000850 REPLACE-WEB.
000860
000870
000880 EX-REPLACE-WEB.
000890          EXIT.
000900
