000010  IDENTIFICATION DIVISION.
000020  PROGRAM-ID.    TOTALE.
000030*
000040* PROGRAMMA PER LA CONVERSIONE DA MINUTI IN HHHH:MM
000050*
000060  ENVIRONMENT DIVISION.
000070  CONFIGURATION SECTION.
000080  SOURCE-COMPUTER.        PC-IBM.
000090  OBJECT-COMPUTER.        PC-IBM.
000100  SPECIAL-NAMES.
000110
000120          DECIMAL-POINT IS COMMA.
000130
000140  DATA DIVISION.
000150
000160  LINKAGE SECTION.
000170
000180  01 W-DURATA          PIC S9(9) COMP-5.
000190
000200  01 ORARIO-DUR.
000210     09 ORA-DUR        PIC 9999.
000220     09 MIN-DUR        PIC 99.
000230
000240  PROCEDURE DIVISION USING W-DURATA ORARIO-DUR.
000250  INIZIO.
000260
000270          DIVIDE W-DURATA BY 60 GIVING ORA-DUR
000280            REMAINDER MIN-DUR.
000290
000300          GOBACK.
000310
000320
