000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENTABE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000310			COPY "SELJSON.CBL".
000320
000330
000340
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDETAB.CBL".
000410			COPY "FDEJSON.CBL".
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000520
000530          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000540
000550          COPY "INIZIALI.CBL".
000560
000570
000580          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000590
000600
000610			STRING "TEMPLATE/TABELL" FUNZIONE-WEB ".HTM"
000620			DELIMITED BY SIZE  INTO PAGE-WEB.
000630
000640          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000650
000660
000670 FINE.
000680          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000690          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000700
000710
000720          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000730
000740          GOBACK.
000750
000760          COPY "PIOWEB.CBL".
000770          COPY "PIOVIEW.CBL".
000780          COPY "PIOTAB.CBL".
000790			COPY "PIOJSON.CBL".
000800
000810
000820 LOAD-VIEW.
000830
000840          MOVE "MK-ENTITA"     	TO FIELD-WEB NOME-VIEW.
000850          PERFORM READ-WEB     	THRU EX-READ-WEB
000860          MOVE VALUE-WEB       	TO STRINGA-VIEW ENTITA-WEB
000870          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000880
000890          MOVE "MK-FUNZIONE"   	TO FIELD-WEB NOME-VIEW.
000900          PERFORM READ-WEB     	THRU EX-READ-WEB
000910          MOVE VALUE-WEB       	TO STRINGA-VIEW FUNZIONE-WEB
000920          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000930
000940          MOVE SECTION-WEB        TO STRINGA-VIEW.
000950          MOVE "SECTION-WEB"      TO NOME-VIEW
000960          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000970
000980          MOVE SPACES              TO STRINGA-VIEW.
000990
001000			STRING 
001010
001020			'<a href="opentabe.exe?MK-KEY='
001030			 SECTION-WEB DELIMITED BY SIZE
001040			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
001050			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
001060			'" class="easyui-linkbutton" data-options="iconCls:'
001070			"'icon-undo'"
001080			'" style="padding:5px 0px;width:25%; margin-left:20px">'
001090			' <span style="font-size:14px;">Indietro</span></a>'  
001100			DELIMITED BY SIZE INTO STRINGA-VIEW.
001110            
001120
001130          MOVE "GOBACK"           TO NOME-VIEW
001140          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001150
001160
001170			STRING "TABELL" FUNZIONE-WEB 				
001180			DELIMITED BY SIZE INTO  NOME-JSON.
001190
001200			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001210
001220			STRING "/OpenPA/" FILE-JSON 
001230			 DELIMITED BY SIZE INTO STRINGA-VIEW.
001240
001250          MOVE "FILE-JSON"        TO NOME-VIEW
001260          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001270
001280			MOVE ZEROS				TO CONTA.
001290
001300			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001310
001320			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001330			 OR CONTA(IND:1) > "0"
001340			 CONTINUE
001350			END-PERFORM.
001360
001370			STRING '{"total":' CONTA(IND:) ',"rows":['		
001380			DELIMITED BY SIZE INTO DATI-JSON.
001390			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001400
001410			MOVE SPACES				TO DATI-JSON.
001420
001430          MOVE LOW-VALUE          TO CHIAVE-TAB.
001440          MOVE FUNZIONE-WEB       TO TIPO-TAB.
001450          MOVE 1                  TO ENTE-TAB.
001460          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
001470
001480          if ESITO-NOK GO TO FINE-TABELLA.
001490
001500
001510 CICLO-TABELLA.
001520
001530			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
001540
001550			IF TIPO-TAB NOT = FUNZIONE-WEB MOVE "S" TO FINE-FILE.
001560
001570			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001580
001590			IF DATI-JSON > SPACES
001600			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001610
001620***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001630
001640			INSPECT TABELLA REPLACING ALL "\" BY " ".			
001650
001660				
001670**** ITEM
001680		
001690			STRING 
001700
001710			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001720			ELEMENTO-TAB    DELIMITED BY "   "
001730			'",'			DELIMITED BY SIZE
001740			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001750
001760**** ITEM
001770			STRING "        "
001780			'"DESC":"'	DELIMITED BY SIZE
001790			DESC-TAB        DELIMITED BY "     "
001800			'",'			DELIMITED BY SIZE
001810			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001820**** ITEM
001830			STRING "        "
001840			'"DESC1":"'	DELIMITED BY SIZE
001850			DESCR-TAB(1)    DELIMITED BY "     "
001860			'",'			DELIMITED BY SIZE
001870			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001880**** ITEM
001890			STRING "        "
001900			'"DESC2":"'	DELIMITED BY SIZE
001910			DESCR-TAB(2)    DELIMITED BY "     "
001920			'",'			DELIMITED BY SIZE
001930			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001940**** ITEM
001950			STRING "        "
001960			'"' 		
001970			'CANCELLA":"'	DELIMITED BY SIZE
001980			'<a href=opencanc.exe?MK-KEY='
001990			 SECTION-WEB DELIMITED BY SIZE
002000			"&MK-ITEM=" DELIMITED BY SIZE
002010			CHIAVE-TAB  DELIMITED BY SIZE
002020			"&MK-FILE=TA" DELIMITED BY SIZE
002030			'>' delimited by size 
002040			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
002050				delimited by size 
002060			'",'			DELIMITED BY SIZE
002070			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002080**** ITEM
002090			STRING "        "
002100			'"' 		
002110			'MODIFICA":"'	DELIMITED BY SIZE
002120			'<a href=openmota.exe?MK-KEY='
002130			 SECTION-WEB DELIMITED BY SIZE
002140			"&MK-ITEM=" DELIMITED BY SIZE
002150			CHIAVE-TAB
002160			'>' delimited by size 
002170			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
002180				delimited by size 
002190          '"},' DELIMITED BY SIZE 
002200			into dati-JSON.
002210
002220
002230			GO TO CICLO-TABELLA.
002240
002250
002260 FINE-TABELLA.
002270
002280			INSPECT DATI-JSON REPLACING all "}, " BY
002290										    "}  ".
002300
002310			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002320
002330
002340			MOVE "]}"					TO DATI-JSON.
002350			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002360
002370			CLOSE ARKJSON.
002380
002390
002400 EX-LOAD-VIEW.
002410          EXIT.
002420
002430 CONTA-RECORD.
002440
002450          MOVE LOW-VALUE          TO CHIAVE-TAB.
002460          MOVE FUNZIONE-WEB		TO TIPO-TAB.
002470          MOVE 1                  TO ENTE-TAB.
002480          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
002490			
002500			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002510
002520 CICLO-CONTA-RECORD.
002530
002540			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
002550
002560			IF TIPO-TAB NOT = FUNZIONE-WEB  MOVE "S" TO FINE-FILE.
002570
002580			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002590
002600			ADD 1					TO CONTA.
002610
002620			GO TO CICLO-CONTA-RECORD.
002630
002640 EX-CONTA-RECORD.
002650			EXIT.
002660
002670 REPLACE-WEB.
002680
002690
002700          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
002710
002720
002730 EX-REPLACE-WEB.
002740          EXIT.
002750
