000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENMOTA.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000310			COPY "SELDATO.CBL".
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDETAB.CBL".
000391			COPY "FDEDATO.CBL".
000400
000410 WORKING-STORAGE  SECTION.
000423
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000520			PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000521
000522			PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000523
000530          COPY "INIZIALI.CBL".
000540
000550		    MOVE "MK-ITEM"       TO FIELD-WEB
000551          PERFORM READ-WEB     THRU EX-READ-WEB
000552          MOVE VALUE-WEB       TO CHIAVE-TAB     
000553*
000554**** SI LEGGE IL RECORD DA MODIFICARE: N.B NON VIENE ANCORA POSTO IN LOCK 
000555*
000556			PERFORM LEGGO-TAB	 THRU EX-LEGGO-TAB.
000557
000558			IF ESITO-NOK
000559			 STRING "ERRORE NON GESTITO LETTURA TABELLA"
000560			 DELIMITED BY SIZE INTO MESSAGGIO
000561			 PERFORM VIS-MESS	THRU EX-VIS-MESS
000562			 GO TO FINE.
000563
000564          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000565
000566			MOVE SPACES			 TO PAGE-WEB
000567
000568			STRING "TEMPLATE/INSE" ENTITA-WEB FUNZIONE-WEB  ".HTM"
000569			  DELIMITED BY SIZE INTO PAGE-WEB.
000586
000590          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000601
000610
000620 FINE.
000630          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000660		 	PERFORM CLOSE-TAB	 THRU EX-CLOSE-TAB.
000661			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB.CBL".
000720          COPY "PIOVIEW.CBL".
000740			COPY "PIOTAB.CBL".
000750			COPY "PIODATO.CBL".
000850
000860
000870 REPLACE-WEB.
000880
000890          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
000910
000920 EX-REPLACE-WEB.
000931          EXIT.
000932
000933 LOAD-VIEW.
000939
000940          MOVE "VARIAZIONE"               TO STRINGA-VIEW
000941          MOVE "LAVORO"           		TO NOME-VIEW
000942          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
000943
000944          MOVE CHIAVE-TAB 	            TO STRINGA-VIEW
000945          MOVE "CHIAVE-TAB"       		TO NOME-VIEW
000946          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
000949          
000957
000958***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
000959
000960
000961			MOVE "TA"				TO CHIAVE-DATO.
000962
000963			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
000964
000965			IF ESITO-NOK GO TO EX-LOAD-VIEW.
000966
000967******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
000968
000969 CICLO-VIEW.
000970
000971			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
000972
000973      	IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
000974		
000975			IF NOME-COBOL-DATO(1:9) NOT = "TABELLA-0" GO TO CICLO-VIEW.
000976			 
000977			IF NOME-COBOL-DATO(10:2) NOT = TIPO-TAB GO TO CICLO-VIEW.
000978*
000979*** IL PRIMO CAMPO  E' TABELLA-0XX  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
000980*
000981
000984	
000985
000986 CICLO-DATI-VIEW.
000987
000988			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
000989
000990**** HA RAGGIUNTO UN ALTRA TABELLA: FINE
000991
000992			IF NOME-COBOL-DATO(1:9) = "TABELLA-0" MOVE "S" TO FINE-FILE.
000993
000994			IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
000995
000996
000997***** TODO: GESTIRE IMPORTO O VALORI NUMERICI STANDARD
000998
000999			MOVE TABELLA(POS-DATO:SIZE-DATO) TO STRINGA-VIEW.
001000
001001          MOVE NOME-COBOL-DATO    TO NOME-VIEW.
001002
001003          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001004
001005			GO TO CICLO-DATI-VIEW.
001024		 
001025 EX-LOAD-VIEW.
001026			EXIT.
001036
