000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENINSE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300
000310
000320 DATA             DIVISION.
000330 FILE SECTION.
000340
000350          COPY "FDEWEB.CBL".
000360          COPY "FDEVIEW.CBL".
000370
000380 WORKING-STORAGE  SECTION.
000390
000400          COPY "COBW3.CBL".
000410          COPY "GLOBALS.CBL".
000420          COPY "IMAGES.CBL".
000430*
000440 PROCEDURE  DIVISION.
000450*
000460          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000470
000480          COPY "INIZIALI.CBL".
000490
000500
000510          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000520
000530			MOVE SPACES			 TO PAGE-WEB
000550
000551
000552			STRING "TEMPLATE/INSE" ENTITA-WEB FUNZIONE-WEB ".HTM"
000553			  DELIMITED BY SIZE INTO PAGE-WEB
000980
000990          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
001000
001010
001020 FINE.
001030          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
001040
001050          PERFORM FINE-WEB     THRU EX-FINE-WEB.
001060
001070          GOBACK.
001080
001090          COPY "PIOWEB.CBL".
001100          COPY "PIOVIEW.CBL".
001110
001120
001130 REPLACE-WEB.
001140
001150          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001160
001170
001180 EX-REPLACE-WEB.
001190          EXIT.
001200
001210 LOAD-VIEW.
001220
001230          MOVE "INSERIMENTO"              TO STRINGA-VIEW
001240          MOVE "LAVORO"           		TO NOME-VIEW
001250          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW.
001260   
001261          MOVE FUNZIONE-WEB       		TO STRINGA-VIEW
001262          MOVE "TIPO-TAB"         		TO NOME-VIEW
001263          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW .
001264
001265
001270
001280 EX-LOAD-VIEW.
001290
