000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENRE07.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000310			COPY "SELDATO.CBL".
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDETAB.CBL".
000400			COPY "FDEDATO.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520          PERFORM OPEN-IO-TAB  THRU EX-OPEN-IO-TAB.
000530          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000540
000550          COPY "INIZIALI.CBL".
000560
000570
000580          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000590
000600          IF ESITO-NOK
000610          MOVE "ERRORE MEMORIZZAZIONE DATI TABELLE" TO MESSAGGIO
000620           ELSE
000630          MOVE "MEMORIZZAZIONE TABELLE EFFETTUATA"  TO MESSAGGIO.
000640
000650          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000660
000670 FINE.
000680          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000690          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000700			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000710
000720          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000730
000740          GOBACK.
000750
000760          COPY "PIOWEB.CBL".
000770          COPY "PIOVIEW.CBL".
000780          COPY "PIOTAB.CBL".
000790			COPY "PIODATO.CBL".
000800
000810 LOAD-VIEW.
000820
000830          MOVE "LAVORO"   	     TO NOME-VIEW
000840          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000850
000860			MOVE STRINGA-VIEW		TO SW-LAVORO.
000870
000880			IF SW-LAVORO = "INSERIMENTO"
000890           INITIALIZE TABELLA
000900
000910          MOVE "TIPO-TAB" 	     TO NOME-VIEW
000920          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW
000930		
000940			IF ESITO-NOK
000950			 MOVE "ERRORE NON GESTITO TIPO-TAB SU OPENRETA"
000960			 TO MESSAGGIO
000970			 PERFORM VIS-MESS		THRU EX-VIS-MESS
000980			 GO TO EX-LOAD-VIEW
000990			END-IF
001000
001010*****  TIPO RECORD DA INSERIRE
001020
001030			MOVE STRINGA-VIEW		TO TIPO-TAB
001040
001050          MOVE 1                  TO PROG-TAB
001060          MOVE 01                 TO ENTE-TAB
001070
001080			ELSE
001090
001100          MOVE "CHIAVE-TAB"	    TO NOME-VIEW
001110          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
001120
001130			IF ESITO-NOK
001140			 MOVE "ERRORE NON GESTITO CHIAVE-TAB SU OPENRETA"
001150			 TO MESSAGGIO
001160			 PERFORM VIS-MESS		THRU EX-VIS-MESS
001170			 GO TO EX-LOAD-VIEW
001180			END-IF
001190
001200*****  RECORD DA VARIARE
001210
001220			MOVE STRINGA-VIEW		TO CHIAVE-TAB
001230
001240***** LOCK DEL RECORD
001250
001260			PERFORM LEGGO-TAB		THRU EX-LEGGO-TAB.
001270
001280***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001290
001300
001310			MOVE "TA"				TO CHIAVE-DATO.
001320			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
001330			IF ESITO-NOK GO TO FINE-VIEW.
001340
001350******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
001360
001370 CICLO-VIEW.
001380
001390			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001400
001410      	IF FINE-FILE = "S" GO TO FINE-VIEW.
001420		
001430			IF NOME-COBOL-DATO(1:9) NOT = "TABELLA-0" GO TO CICLO-VIEW.
001440			 
001450			IF NOME-COBOL-DATO(10:2) NOT = TIPO-TAB GO TO CICLO-VIEW.
001460*
001470*** IL PRIMO CAMPO  E' TABELLA-0XX  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001480*
001490 CICLO-DATI-VIEW.
001500
001510			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001520
001530			IF NOME-COBOL-DATO(1:9) = "TABELLA-0" MOVE "S" TO FINE-FILE.
001540
001550			IF FINE-FILE = "S" GO TO FINE-VIEW.
001560
001570          MOVE NOME-COBOL-DATO    TO FIELD-WEB.
001580
001590          PERFORM READ-WEB        THRU EX-READ-WEB.
001600
001610          IF COBW3-SEARCH-FLAG-EXIST
001620           MOVE VALUE-WEB         TO TABELLA(POS-DATO:SIZE-DATO).
001630
001640			GO TO CICLO-DATI-VIEW.
001650			 
001660
001670 FINE-VIEW.
001680
001690			IF SW-LAVORO = "INSERIMENTO"
001700			 CONTINUE
001710			ELSE
001720			PERFORM AGGIORNO-TAB	THRU EX-AGGIORNO-TAB
001730			 GO TO EX-LOAD-VIEW.
001740
001750 LOOP-VIEW.
001760
001770          perform SCRIVO-TAB      THRU EX-SCRIVO-TAB.
001780
001790          IF ESITO-NOK ADD 1 TO PROG-TAB
001800             GO TO LOOP-VIEW.
001810
001820 EX-LOAD-VIEW.
001830          EXIT.
001840
001850
001860 REPLACE-WEB.
001870*
001880** DICHIARATO IN COPY ANCHE SE NON SERVE VA SEMPRE ESPLICITATO
001890*
001900 EX-REPLACE-WEB.
001910          EXIT.
001920
