000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENINSE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230 SPECIAL-NAMES.
000240          DECIMAL-POINT IS COMMA.
000250 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300
000310
000320 DATA             DIVISION.
000330 FILE SECTION.
000340
000350          COPY "FDEWEB.CBL".
000360          COPY "FDEVIEW.CBL".
000370
000380 WORKING-STORAGE  SECTION.
000390
000400          COPY "COBW3.CBL".
000410          COPY "GLOBALS.CBL".
000420          COPY "IMAGES.CBL".
000430*
000440 PROCEDURE  DIVISION.
000450*
000460          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000470
000480          COPY "INIZIALI.CBL".
000490
000500
000510          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000520
000530			MOVE SPACES			 TO PAGE-WEB
000540
000550			EVALUATE ENTITA-WEB
000560
000570			WHEN "TA"
000580
000590			STRING "TEMPLATE/INSERT" FUNZIONE-WEB ".HTM"
000600			  DELIMITED BY SIZE INTO PAGE-WEB
000610
000620			WHEN "TD"
000630
000640			STRING "TEMPLATE/INSERT" FUNZIONE-WEB ".HTM"
000650			  DELIMITED BY SIZE INTO PAGE-WEB
000660
000670			WHEN OTHER
000671
000672			  EVALUATE FUNZIONE-WEB
000673
000674			     WHEN "CA"
000680
000690	 			 MOVE   "TEMPLATE/INSECAUS.HTM" TO PAGE-WEB
000700
000710				 WHEN "OR"
000720
000730				 MOVE   "TEMPLATE/INSEORAR.HTM" TO PAGE-WEB
000740
000750				 WHEN "PR"
000760
000770	 			 MOVE   "TEMPLATE/INSEPROF.HTM" TO PAGE-WEB

000750				 WHEN "MR"
000760
000770	 			 MOVE   "TEMPLATE/INSEMATR.HTM" TO PAGE-WEB

000790
000800				WHEN OTHER
000810  	
000820				STRING "INSERIMENTO  " ENTITA-WEB " " FUNZIONE-WEB
000830 				 " NON IMPLEMENTATO " DELIMITED BY SIZE INTO MESSAGGIO
000840				PERFORM VIS-MESS	 THRU EX-VIS-MESS
000850	           GO TO FINE
000860	
000870			   END-EVALUATE
000871
000872			END-EVALUATE.
000880
000890          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000900
000910
000920 FINE.
000930          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000940
000950          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000960
000970          GOBACK.
000980
000990          COPY "PIOWEB.CBL".
001000          COPY "PIOVIEW.CBL".
001010
001020
001030 REPLACE-WEB.
001040
001050          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001060
001070
001080 EX-REPLACE-WEB.
001090          EXIT.
001100
001110 LOAD-VIEW.
001120
001130          MOVE "INSERIMENTO"              TO STRINGA-VIEW
001140          MOVE "LAVORO"           		TO NOME-VIEW
001150          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW.
001160   
001170
001180 EX-LOAD-VIEW.
001190
