000010*
000011* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000012*
000013* This program is free software; you can redistribute it and/or modify
000014* it under the terms of the GNU General Public License as published by
000015* the Free Software Foundation; either version 2, or (at your option)
000016* any later version.
000017*
000018* This program is distributed in the hope that it will be useful,
000019* but WITHOUT ANY WARRANTY; without even the implied warranty of
000020* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000021* GNU General Public License for more details.
000022*
000023* You should have received a copy of the GNU General Public License
000024* along with this software; see the file COPYING.  If not, write to
000025* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000026* Boston, MA 02110-1301 USA
000027*
000028 IDENTIFICATION   DIVISION.
000029 PROGRAM-ID       OPENRE07.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000050 SPECIAL-NAMES.
000060          DECIMAL-POINT IS COMMA.
000070 INPUT-OUTPUT     SECTION.
000080 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110          COPY "SELVIEW.CBL".
000120          COPY "SELTAB.CBL".
000121			COPY "SELDATO.CBL".
000140
000150
000160 DATA             DIVISION.
000170 FILE SECTION.
000180
000190          COPY "FDEWEB.CBL".
000200          COPY "FDEVIEW.CBL".
000210          COPY "FDETAB.CBL".
000211			COPY "FDEDATO.CBL".
000220
000230 WORKING-STORAGE  SECTION.
000240
000250          COPY "COBW3.CBL".
000260          COPY "GLOBALS.CBL".
000270          COPY "IMAGES.CBL".
000280*
000290 PROCEDURE  DIVISION.
000300*
000310          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000320
000330          PERFORM OPEN-IO-TAB  THRU EX-OPEN-IO-TAB.
000340          PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000341
000350          COPY "INIZIALI.CBL".
000360
000370
000380          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000390
000400          IF ESITO-NOK
000410          MOVE "ERRORE MEMORIZZAZIONE DATI TABELLE" TO MESSAGGIO
000420           ELSE
000430          MOVE "MEMORIZZAZIONE TABELLE EFFETTUATA"  TO MESSAGGIO.
000440
000450          PERFORM VIS-MESS     THRU EX-VIS-MESS.
000460
000470 FINE.
000480          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000490          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000491			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000500
000510          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000520
000530          GOBACK.
000540
000550          COPY "PIOWEB.CBL".
000560          COPY "PIOVIEW.CBL".
000570          COPY "PIOTAB.CBL".
000580			COPY "PIODATO.CBL".
000590
000600 LOAD-VIEW.
000610
000611          MOVE "LAVORO"   	     TO NOME-VIEW
000612          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW.
000616
000617			MOVE STRINGA-VIEW		TO SW-LAVORO.
000618
000619			IF SW-LAVORO = "INSERIMENTO"
000621           INITIALIZE TABELLA
000622
000623          MOVE "TIPO-TAB" 	     TO NOME-VIEW
000624          PERFORM LEGGO-VIEW  	 THRU EX-LEGGO-VIEW
000625		
000626			IF ESITO-NOK
000627			 MOVE "ERRORE NON GESTITO TIPO-TAB SU OPENRETA"
000628			 TO MESSAGGIO
000629			 PERFORM VIS-MESS		THRU EX-VIS-MESS
000630			 GO TO EX-LOAD-VIEW
000631			END-IF
000632
000633*****  TIPO RECORD DA INSERIRE
000634
000635			MOVE STRINGA-VIEW		TO TIPO-TAB
000636
000637          MOVE 1                  TO PROG-TAB
000638          MOVE 01                 TO ENTE-TAB
000639
000640			ELSE
000641
000642          MOVE "CHIAVE-TAB"	    TO NOME-VIEW
000643          PERFORM LEGGO-VIEW  	THRU EX-LEGGO-VIEW
000644
000645			IF ESITO-NOK
000646			 MOVE "ERRORE NON GESTITO CHIAVE-TAB SU OPENRETA"
000647			 TO MESSAGGIO
000648			 PERFORM VIS-MESS		THRU EX-VIS-MESS
000649			 GO TO EX-LOAD-VIEW
000650			END-IF
000653
000654*****  RECORD DA VARIARE
000655
000656			MOVE STRINGA-VIEW		TO CHIAVE-TAB
000657
000658***** LOCK DEL RECORD
000659
000660			PERFORM LEGGO-TAB		THRU EX-LEGGO-TAB.
000661
000662***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
000672
000673
000677			MOVE "TA"				TO CHIAVE-DATO.
000678			PERFORM STARTO-DATO		THRU EX-STARTO-DATO.
000679			IF ESITO-NOK GO TO FINE-VIEW.
000680
000681******* SI POSIZIONA SULLA TABELLA IN FASE DI GESTIONE  TABELLA-0XX XX=TIPO-TAB
000682
000683 CICLO-VIEW.
000684
000685			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
000686
000687      	IF FINE-FILE = "S" GO TO FINE-VIEW.
000688		
000689			IF NOME-COBOL-DATO(1:9) NOT = "TABELLA-0" GO TO CICLO-VIEW.
000690			 
000691			IF NOME-COBOL-DATO(10:2) NOT = TIPO-TAB GO TO CICLO-VIEW.
000692*
000694*** IL PRIMO CAMPO  E' TABELLA-0XX  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
000695*
000696 CICLO-DATI-VIEW.
000697
000698			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
000699
000701			IF NOME-COBOL-DATO(1:9) = "TABELLA-0" MOVE "S" TO FINE-FILE.
000702
000703			IF FINE-FILE = "S" GO TO FINE-VIEW.
000705
000706          MOVE NOME-COBOL-DATO    TO FIELD-WEB.
000707
000708          PERFORM READ-WEB        THRU EX-READ-WEB.
000709
                IF COBW3-SEARCH-FLAG-EXIST
                 MOVE VALUE-WEB         TO TABELLA(POS-DATO:SIZE-DATO).
000711
000713			GO TO CICLO-DATI-VIEW.
000714			 
000727
000728 FINE-VIEW.
000729
000730			IF SW-LAVORO = "INSERIMENTO"
000731			 CONTINUE
000732			ELSE
000733			PERFORM AGGIORNO-TAB	THRU EX-AGGIORNO-TAB
000734			 GO TO EX-LOAD-VIEW.
000735
000736 LOOP-VIEW.
000737
000738          perform SCRIVO-TAB      THRU EX-SCRIVO-TAB.
000739
000740          IF ESITO-NOK ADD 1 TO PROG-TAB
000741             GO TO LOOP-VIEW.
000742
000810 EX-LOAD-VIEW.
000820          EXIT.
000830
000840
000850 REPLACE-WEB.
000860*
000861** DICHIARATO IN COPY ANCHE SE NON SERVE VA SEMPRE ESPLICITATO
000870*
000880 EX-REPLACE-WEB.
000890          EXIT.
000900
