000010*
000011* Copyright (C) 2010-2020 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000012*
000013* This program is free software; you can redistribute it and/or modify
000014* it under the terms of the GNU General Public License as published by
000015* the Free Software Foundation; either version 2, or (at your option)
000016* any later version.
000017*
000018* This program is distributed in the hope that it will be useful,
000019* but WITHOUT ANY WARRANTY; without even the implied warranty of
000020* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000021* GNU General Public License for more details.
000022*
000023* You should have received a copy of the GNU General Public License
000024* along with this software; see the file COPYING.  If not, write to
000025* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000026* Boston, MA 02110-1301 USA
000027*
000028 IDENTIFICATION   DIVISION.
000029 PROGRAM-ID       OPENPA02.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000050 SPECIAL-NAMES.
000060          DECIMAL-POINT IS COMMA.
000070 INPUT-OUTPUT     SECTION.
000080 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110          COPY "SELVIEW.CBL".
000120          COPY "SELTAB.CBL".
000130
000140
000150
000160 DATA             DIVISION.
000170 FILE SECTION.
000180
000190          COPY "FDEWEB.CBL".
000200          COPY "FDEVIEW.CBL".
000210          COPY "FDETAB.CBL".
000220
000230 WORKING-STORAGE  SECTION.
000320
000330          COPY "COBW3.CBL".
000340          COPY "GLOBALS.CBL".
000350          COPY "IMAGES.CBL".
000360*
000370 PROCEDURE  DIVISION.
000380*
000390          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000400
000410          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000420
000498			COPY "INIZIALI.CBL".
000499
000500
000501          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000511
000520          MOVE "TEMPLATE/TABELL01.HTM"    TO PAGE-WEB
000530          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000540
000550
000560 FINE.
000570          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000580          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000590
000600
000610          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000620
000630          GOBACK.
000640
000650          COPY "PIOWEB.CBL".
000660          COPY "PIOVIEW.CBL".
000670          COPY "PIOTAB.CBL".
000680
000690
000700 LOAD-VIEW.
000710
000720          MOVE SECTION-WEB        TO STRINGA-VIEW.
000730          MOVE "SECTION-WEB"      TO NOME-VIEW
000740          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000750
000760
000780          MOVE "01"               TO TIPO-TAB.
000790          MOVE 1                  TO PROG-TAB.
000800          MOVE 01                 TO ENTE-TAB.
000810          PERFORM LEGGO-TAB       THRU EX-LEGGO-TAB.
000820
000830          if esito-NOK INITIALIZE TABELLA-001.
000840
000850          MOVE DESC-ENTE-001      TO STRINGA-VIEW.
000860          MOVE "DESC-ENTE-001"    TO NOME-VIEW
000870          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000880
000890
000900
000910          MOVE CITTA-001          TO STRINGA-VIEW.
000920          MOVE "CITTA-001"        TO NOME-VIEW
000930          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000940
000950
000960          MOVE PROV-001           TO STRINGA-VIEW.
000970          MOVE "PROV-001"         TO NOME-VIEW
000980          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000990
001000          MOVE VIA-001            TO STRINGA-VIEW.
001010          MOVE "VIA-001"          TO NOME-VIEW
001020          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001030
001040          MOVE TEL-001            TO STRINGA-VIEW.
001050          MOVE "TEL-001"          TO NOME-VIEW
001060          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001070
001080          MOVE PASSWORD-EMAIL-001 TO STRINGA-VIEW.
001090          MOVE "PASSWORD-EMAIL-001"       TO NOME-VIEW
001100          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001110
001120          MOVE EMAIL-001          TO STRINGA-VIEW.
001130          MOVE "EMAIL-001"        TO NOME-VIEW
001140          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001150
001790
001800 EX-LOAD-VIEW.
001810          EXIT.
001820
001830
001840 REPLACE-WEB.
001850
001860          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001870
001880
001890 EX-REPLACE-WEB.
001900          EXIT.
001910
