000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENDELE.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230 SPECIAL-NAMES.
000240          DECIMAL-POINT IS COMMA.
000250 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000301			COPY "SELCAUS.CBL".
000302			COPY "SELORA.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDETAB.CBL".
000400			COPY "FDECAUS.CBL".
000401			COPY "FDEORA.CBL".
000402
000410 WORKING-STORAGE  SECTION.
000420
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000510          COPY "INIZIALI.CBL".
000520
000521          MOVE "FILE-DELETE" 	 TO NOME-VIEW.
000522          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000523
000524			EVALUATE STRINGA-VIEW
000525
000526			WHEN "TA"
000527
000528			PERFORM TABELLE		THRU EX-TABELLE
000529
000530			WHEN "CA"
000540
000550			PERFORM CAUSALI 	THRU EX-CAUSALI
000560
000760			WHEN "OR"
000761
000762			PERFORM ORARI   	THRU EX-ORARI   
000763	
000764			WHEN OTHER
000765
000766			STRING "CANCELLAZIONE NON IMPLEMENTATA PER "
000767			 STRINGA-VIEW
000768			 DELIMITED BY SIZE INTO MESSAGGIO
000769
000770          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000771		
000772
000773 FINE.
000780
000790
000800          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000810
000820          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000830
000840          GOBACK.
000850
000860          COPY "PIOWEB.CBL".
000870          COPY "PIOVIEW.CBL".
000880          COPY "PIOTAB.CBL".
000890          COPY "PIOCAUS.CBL".
000891			COPY "PIOORA.CBL".
000892
000900			
000910 REPLACE-WEB.
000920
000930          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
000940
000950
000960 EX-REPLACE-WEB.
000970          EXIT.
000980
000990 TABELLE.
001000
001010          PERFORM OPEN-IO-TAB  THRU EX-OPEN-IO-TAB.
001020
001030          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001040          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001050          MOVE STRINGA-VIEW    TO CHIAVE-TAB.
001060
001070          PERFORM CANCELLO-TAB THRU EX-CANCELLO-TAB.
001080
001090          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
001100
001110          IF ESITO-NOK
001120            STRING "ERRORE CANCELLAZIONE:" CHIAVE-TAB
001130             " STATUS:" STATUS-TAB
001140               DELIMITED BY SIZE INTO MESSAGGIO
001150               ELSE
001160                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-TAB
001170                   " STATUS:" STATUS-TAB
001180                  DELIMITED BY SIZE INTO MESSAGGIO.
001190
001200          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001201
001210 EX-TABELLE.
001220			EXIT.
001230
001240 CAUSALI.
001250
001260          PERFORM OPEN-IO-CAUS  THRU EX-OPEN-IO-CAUS.
001270
001280          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001290          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001300          MOVE STRINGA-VIEW    TO CHIAVE-CAUS.
001310
001320          PERFORM CANCELLO-CAUS THRU EX-CANCELLO-CAUS.
001330
001340          PERFORM CLOSE-CAUS    THRU EX-CLOSE-CAUS.
001350
001360          IF ESITO-NOK
001370            STRING "ERRORE CANCELLAZIONE:" CHIAVE-CAUS
001380             " STATUS:" STATUS-CAUS
001390               DELIMITED BY SIZE INTO MESSAGGIO
001400               ELSE
001410                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-CAUS
001420                   " STATUS:" STATUS-CAUS
001430                  DELIMITED BY SIZE INTO MESSAGGIO.
001440
001450          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001460
001470 EX-CAUSALI.
001480			EXIT.
001490
001491 ORARI.
001492
001493          PERFORM OPEN-IO-ORA   THRU EX-OPEN-IO-ORA.
001494
001495          MOVE "CHIAVE-DELETE" TO NOME-VIEW.
001496          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
001497          MOVE STRINGA-VIEW    TO CHIAVE-ORA.
001498
001499          PERFORM CANCELLO-ORA  THRU EX-CANCELLO-ORA.
001500
001501          PERFORM CLOSE-ORA     THRU EX-CLOSE-ORA.
001502
001503          IF ESITO-NOK
001504            STRING "ERRORE CANCELLAZIONE:" CHIAVE-ORA 
001505             " STATUS:" STATUS-ORA
001506               DELIMITED BY SIZE INTO MESSAGGIO
001507               ELSE
001508                   STRING "CANCELLAZIONE EFFETTUATA:" CHIAVE-ORA
001509                   " STATUS:" STATUS-ORA
001510                  DELIMITED BY SIZE INTO MESSAGGIO.
001511
001512          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001513
001514 EX-ORARI.
001515			EXIT.
001516
001517
