000010*
000011* Copyright (C) 2010-2020 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000012*
000013* This program is free software; you can redistribute it and/or modify
000014* it under the terms of the GNU General Public License as published by
000015* the Free Software Foundation; either version 2, or (at your option)
000016* any later version.
000017*
000018* This program is distributed in the hope that it will be useful,
000019* but WITHOUT ANY WARRANTY; without even the implied warranty of
000020* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000021* GNU General Public License for more details.
000022*
000023* You should have received a copy of the GNU General Public License
000024* along with this software; see the file COPYING.  If not, write to
000025* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000026* Boston, MA 02110-1301 USA
000027*
000028 IDENTIFICATION   DIVISION.
000029 PROGRAM-ID       OPENRE02.
000030 ENVIRONMENT      DIVISION.
000040 CONFIGURATION    SECTION.
000050 SPECIAL-NAMES.
000060          DECIMAL-POINT IS COMMA.
000070 INPUT-OUTPUT     SECTION.
000080 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110          COPY "SELVIEW.CBL".
000120          COPY "SELTAB.CBL".
000130
000140
000150
000160 DATA             DIVISION.
000170 FILE SECTION.
000180
000190          COPY "FDEWEB.CBL".
000200          COPY "FDEVIEW.CBL".
000210          COPY "FDETAB.CBL".
000220
000230 WORKING-STORAGE  SECTION.
000240
000250          COPY "COBW3.CBL".
000260          COPY "GLOBALS.CBL".
000270          COPY "IMAGES.CBL".
000280*
000290 PROCEDURE  DIVISION.
000300*
000310          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000320
000330          PERFORM OPEN-IO-TAB      THRU EX-OPEN-IO-TAB.
000340
000350          COPY "INIZIALI.CBL".
000360
000370
000380          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW.
000390
000400          IF ESITO-NOK
000410          MOVE "ERRORE MEMORIZZAZIONE DATI TABELLE" TO MESSAGGIO
000420           ELSE
000430          MOVE "MEMORIZZAZIONE TABELLE EFFETTUATA"  TO MESSAGGIO.
000440
000450          PERFORM VIS-MENU     THRU EX-VIS-MENU.
000460
000470 FINE.
000480          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000490          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000500
000510          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000520
000530          GOBACK.
000540
000550          COPY "PIOWEB.CBL".
000560          COPY "PIOVIEW.CBL".
000570          COPY "PIOTAB.CBL".
000580
000590
000600 LOAD-VIEW.
000610
000620          MOVE "02"               TO TIPO-TAB.
000630          MOVE 1                  TO PROG-TAB.
000640          MOVE 01                 TO ENTE-TAB.
000650          PERFORM LEGGO-TAB       THRU EX-LEGGO-TAB.
000660
000670          if esito-NOK INITIALIZE TABELLA-002
000680
000690          perform SCRIVO-TAB      THRU EX-SCRIVO-TAB.
000700
000710
000720          MOVE "ULT-MATR-002"     TO FIELD-WEB
000730          PERFORM READ-WEB        THRU EX-READ-WEB
000740
000750          MOVE NUMERO-WEB         TO ULT-MATR-002.
000760
000770          PERFORM AGGIORNO-TAB  THRU EX-AGGIORNO-TAB.
000780
000790
000800
000810 EX-LOAD-VIEW.
000820          EXIT.
000830
000840
000850 REPLACE-WEB.
000860
000870
000880 EX-REPLACE-WEB.
000890          EXIT.
000900
