000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANORAILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENMOOR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000250			COPY "SPECIAL.CBL".
000251 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELORA.CBL".
000310			COPY "SELDATO.CBL".
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDEORA.CBL".
000400			COPY "FDEDATO.CBL".
000410
000420 WORKING-STORAGE  SECTION.
000430
000440          COPY "COBW3.CBL".
000450          COPY "GLOBALS.CBL".
000460          COPY "IMAGES.CBL".
000470*
000480 PROCEDURE  DIVISION.
000490*
000500          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000510
000520			PERFORM OPEN-I-ORA  THRU EX-OPEN-I-ORA.
000530
000540			PERFORM OPEN-I-DATO  THRU EX-OPEN-I-DATO.
000550
000560          COPY "INIZIALI.CBL".
000570
000580		    MOVE "MK-ITEM"       TO FIELD-WEB
000590          PERFORM READ-WEB     THRU EX-READ-WEB
000600          MOVE VALUE-WEB       TO CHIAVE-ORA
000610*
000620**** SI LEGGE IL RECORD DA MODIFICARE: N.B NON VIENE ANCORA POSTO IN LOCK 
000630*
000640			PERFORM LEGGO-ORA   THRU EX-LEGGO-ORA.
000650
000660			IF ESITO-NOK
000670			 STRING "ERRORE NON GESTITO LETTURA ORARIO"
000680			 DELIMITED BY SIZE INTO MESSAGGIO
000690			 PERFORM VIS-MESS	THRU EX-VIS-MESS
000700			 GO TO FINE.
000710
000720          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000730
000740			MOVE SPACES			 TO PAGE-WEB
000750
000760			STRING "TEMPLATE/INSEORAR" ".HTM"
000770			  DELIMITED BY SIZE INTO PAGE-WEB.
000780
000790          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000800
000810
000820 FINE.
000830          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000840		 	PERFORM CLOSE-ORA   THRU EX-CLOSE-ORA.
000850			PERFORM CLOSE-DATO   THRU EX-CLOSE-DATO.
000860          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000870
000880          GOBACK.
000890
000900          COPY "PIOWEB.CBL".
000910          COPY "PIOVIEW.CBL".
000920			COPY "PIOORA.CBL".
000930			COPY "PIODATO.CBL".
000940
000950
000960 REPLACE-WEB.
000970
000980          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
000990
001000 EX-REPLACE-WEB.
001010          EXIT.
001020
001030 LOAD-VIEW.
001040
001050          MOVE "VARIAZIONE"               TO STRINGA-VIEW
001060          MOVE "LAVORO"           		TO NOME-VIEW
001070          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001080
001090          MOVE CHIAVE-ORA 	            TO STRINGA-VIEW
001100          MOVE "CHIAVE-ORA"       		TO NOME-VIEW
001110          PERFORM SCRITTURA-VIEW  		THRU EX-SCRITTURA-VIEW
001120          
001130
001140***** LETTURA VARIABILI DA MASCHERA HTML : NB. IL NOME DEVE COINCIDERE CON IL NOME RECORD
001150
001160
001161			PERFORM AZZERA-VIEW				THRU EX-AZZERA-VIEW. 
001162
001170			MOVE "OR"						TO CHIAVE-DATO.
001180
001190			PERFORM STARTO-DATO				THRU EX-STARTO-DATO.
001200
001210			IF ESITO-NOK GO TO EX-LOAD-VIEW.
001220
001230******* SI POSIZIONA SULLA ORAELLA IN FASE DI GESTIONE  ORAELLA-0XX XX=TIPO-ORA
001240
001250 CICLO-VIEW.
001260
001270			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001280
001290          IF CHIAVE-DATO(1:2) NOT = "OR" MOVE "S" TO FINE-FILE.
001300
001310      	IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001320		
001330*
001340*** IL PRIMO CAMPO  E' ORAALE  LEGGE SUBITO IL PROSSIMO CHE IDENTIFICA IL PRIMO CAMPO RECORD
001350*
001360
001370 CICLO-DATI-VIEW.
001380
001390			PERFORM LEGGO-NEXT-DATO THRU EX-LEGGO-NEXT-DATO.
001400
001410**** HA RAGGIUNTO UN ALTRA ORAELLA: FINE
001420
001430			IF CHIAVE-DATO(1:2) NOT = "OR" MOVE "S" TO FINE-FILE.
001440
001450			IF FINE-FILE = "S" GO TO EX-LOAD-VIEW.
001460
001470
001480***** TODO: GESTIRE IMPORTO O VALORI NUMERICI STANDARD
001490
001500			MOVE ORARIO(POS-DATO:SIZE-DATO) TO STRINGA-VIEW.
001510
001520          MOVE NOME-COBOL-DATO    TO NOME-VIEW.
001530
001540          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001541
001542
001543			
001544****** aggiunge il valore COME VARIBILE NELLA FORMA NOMECAMPOX X=VALORE SIGNIFICATIVO PER INSERIRE checked=true
001545
001546	    	MOVE ORARIO(POS-DATO:SIZE-DATO) TO STRINGA-VIEW.
001547
001548		   if stringa-view > spaces
001549		   AND SIZE-DATO = 1
001550			move spaces				TO NOME-VIEW
001551			STRING NOME-COBOL-DATO	DELIMITED BY "  "
001552			 STRINGA-VIEW			DELIMITED BY SIZE
001553			 INTO NOME-VIEW
001554			MOVE 'checked="true"'	TO STRINGA-VIEW
001555		    MOVE CHIAVE-DATO		TO CHIAVE-DATO-VIEW
001556          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001562
001563			GO TO CICLO-DATI-VIEW.
001570		 
001580 EX-LOAD-VIEW.
001590			EXIT.
001600
001610 AZZERA-VIEW.
001611
001612			MOVE "OR"			TO NOME-VIEW.
001613			PERFORM STARTO-VIEW	THRU EX-STARTO-VIEW.
001614			IF ESITO-NOK GO TO EX-AZZERA-VIEW.
001615
001616 CICLO-AZZERA-VIEW.
001617
001618			PERFORM LEGGO-NEXT-VIEW THRU EX-LEGGO-NEXT-VIEW.
001619
001620			IF NOME-VIEW(1:2) NOT = "OR" MOVE "S" TO FINE-FILE.
001621
001622			IF FINE-FILE = "S" GO TO EX-AZZERA-VIEW.
001624
001625			IF CHIAVE-DATO-VIEW(1:2) = "OR"
001626			 PERFORM CANCELLO-VIEW	THRU EX-CANCELLO-VIEW.
001627
001628			GO TO CICLO-AZZERA-VIEW.
001629
001630 EX-AZZERA-VIEW.
001631			EXIT.
