000010*
000020* Copyright (C) 2010-2020 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200 IDENTIFICATION   DIVISION.
000210 PROGRAM-ID       OPENPA01.
000220 ENVIRONMENT      DIVISION.
000230 CONFIGURATION    SECTION.
000240
000250 SPECIAL-NAMES.
000260
000270                  ENVIRONMENT-NAME  ENV-NAME
000280                  ENVIRONMENT-VALUE ENV-VALUE
000290
000300                  DECIMAL-POINT IS COMMA.
000310
000320
000330 INPUT-OUTPUT     SECTION.
000340 FILE-CONTROL.
000350
000360          COPY "SELWEB.CBL".
000370          COPY "SELVIEW.CBL".
000380          COPY "SELUTEN.CBL".
000390          COPY "SELTAB.CBL".
000400          COPY "SELMENU.CBL".
000410          COPY "SELABI.CBL".
000420
000430
000440
000450 DATA             DIVISION.
000460 FILE SECTION.
000470
000480          COPY "FDEWEB.CBL".
000490          COPY "FDEVIEW.CBL".
000500          COPY "FDEUTEN.CBL".
000510          COPY "FDETAB.CBL".
000520          COPY "FDEMENU.CBL".
000530          COPY "FDEABI.CBL".
000540
000550 WORKING-STORAGE  SECTION.
000560
000570          COPY "COBW3.CBL".
000580          COPY "GLOBALS.CBL".
000590          COPY "IMAGES.CBL".
000600*
000610 PROCEDURE  DIVISION.
000620*
000630          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000640
000650          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000660
000670          MOVE "MK-UTENTE"    TO FIELD-WEB
000680          PERFORM READ-WEB    THRU EX-READ-WEB
000690
000700          MOVE FUNCTION UPPER-CASE(VALUE-WEB)   TO NOME-UTEN
000710
000720          MOVE "MK-PASSWORD"  TO FIELD-WEB
000730          PERFORM READ-WEB    THRU EX-READ-WEB
000740		
000750      	
000760
000770          PERFORM LEGGO-UTEN  THRU EX-LEGGO-UTEN.
000780
000790          IF ESITO-NOK
000800          MOVE "NOME UTENTE NON PRESENTE " TO MESSAGGIO
000810          PERFORM VIS-MESS    THRU EX-VIS-MESS
000820          GO TO FINE.
000830
000840
000850          MOVE VALUE-WEB      TO REC-DAT.
000860          MOVE 30             TO SIZE-DAT.
000870          CALL "CRIPTA" USING REC-DAT SIZE-DAT.
000880
000890          MOVE REC-DAT(1:30)  TO PASSWORD-WEB.
000900
000910          ACCEPT TIME-SECTION-WEB FROM TIME.
000920
000930          ACCEPT DATA-SYS FROM DATE.
000940          MOVE GG-SYS         TO GG-SECTION-WEB.
000950          MOVE MM-SYS         TO MM-SECTION-WEB.
000960          MOVE AA-SYS         TO AA-SECTION-WEB.
000970          ADD 2000            TO AA-SECTION-WEB.
000980
000990          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN.
001000
001010
001020          PERFORM OPEN-O-VIEW THRU EX-OPEN-O-VIEW.
001030
001040          PERFORM LOAD-VIEW   THRU EX-LOAD-VIEW.
001050
001060
001070          IF PASSWORD-WEB NOT = PASSWORD-UTEN
001080          MOVE "ERRORE LOGIN UTENTE" TO MESSAGGIO
001090          PERFORM VIS-MESS    THRU EX-VIS-MESS
001100              ELSE
001110          MOVE "TEMPLATE/ADMIN.HTM"    TO PAGE-WEB
001120
001130
001140          PERFORM OPEN-I-MENU THRU EX-OPEN-I-MENU
001150          PERFORM OPEN-I-ABI  THRU EX-OPEN-I-ABI
001160
001170          PERFORM MAKE-WEB    THRU EX-MAKE-WEB
001180
001190          PERFORM CLOSE-MENU  THRU EX-CLOSE-MENU
001200          PERFORM CLOSE-ABI   THRU EX-CLOSE-ABI.
001210          PERFORM CLOSE-VIEW  THRU EX-CLOSE-VIEW.
001220
001230
001240
001250
001260 FINE.
001270          PERFORM CLOSE-UTEN  THRU EX-CLOSE-UTEN.
001280
001290
001300          PERFORM FINE-WEB    THRU EX-FINE-WEB.
001310
001320          GOBACK.
001330
001340          COPY "PIOWEB.CBL".
001350          COPY "PIOUTEN.CBL".
001360          COPY "PIOVIEW.CBL".
001370          COPY "PIOTAB.CBL".
001380          COPY "PIOMENU.CBL".
001390          COPY "PIOABI.CBL".
001400
001410 TRATTA-WEB.
001420
001430          PERFORM REPLACE-WEB THRU EX-REPLACE-WEB.
001440
001450          PERFORM LINE-WEB    THRU EX-LINE-WEB.
001460
001470 EX-TRATTA-WEB.
001480          EXIT.
001490
001500 LOAD-VIEW.
001510
001520          MOVE SPACES TO STRINGA-VIEW.
001530          DISPLAY "REMOTE_ADDR" UPON ENV-NAME
001540          ACCEPT STRINGA-VIEW   FROM ENV-VALUE
001550          ON EXCEPTION CONTINUE
001560          END-ACCEPT.
001570
001580          MOVE "REMOTE-IP"       TO NOME-VIEW
001590          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001600
001610          MOVE SPACES TO STRINGA-VIEW.
001620
001630          DISPLAY "REMOTE_PORT" UPON ENV-NAME
001640          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001650          ON EXCEPTION CONTINUE
001660          END-ACCEPT.
001670
001680          MOVE "REMOTE-PORT"     TO NOME-VIEW
001690          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001700
001710
001720
001730          MOVE SECTION-WEB    TO STRINGA-VIEW.
001740          MOVE "SECTION-WEB"  TO NOME-VIEW
001750          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001760
001770
001780          PERFORM OPEN-I-TAB  THRU EX-OPEN-I-TAB.
001790          MOVE 1                  TO PROG-TAB.
001800          MOVE "01"           TO TIPO-TAB.
001810          MOVE 01             TO ENTE-TAB.
001820          PERFORM LEGGO-TAB   THRU EX-LEGGO-TAB.
001830
001840          IF ESITO-NOK MOVE "ENTE DI PROVA" TO DESC-ENTE-001.
001850
001860          CLOSE ARKTAB.
001870
001880          MOVE DESC-ENTE-001  TO STRINGA-VIEW.
001890          MOVE "DESC-ENTE"    TO NOME-VIEW
001900          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001910
001920
001930          MOVE NOME-UTEN      TO STRINGA-VIEW
001940          MOVE "UTENTE"       TO NOME-VIEW
001950          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001960
001970
001980
001990
002000          ACCEPT DATA-SYS FROM DATE.
002010          MOVE GG-SYS         TO GG-WEB.
002020          MOVE MM-SYS         TO MM-WEB.
002030          MOVE AA-SYS         TO AA-WEB.
002040          ADD 2000                        TO AA-WEB.
002050
002060          MOVE DATA-WEB       TO DATA-VIEW
002070          MOVE "OGGI  "       TO NOME-VIEW
002080          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002090
002100
002110
002120          MOVE "MK-DATA"      TO FIELD-WEB
002130          PERFORM READ-WEB    THRU EX-READ-WEB
002140
002150          MOVE DATA-WEB       TO DATA-VIEW
002160
002170          MOVE "ACCESSO"      TO NOME-VIEW
002180          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002190
002200          STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
002210           DELIMITED BY SIZE INTO STRINGA-VIEW.
002220
002230          MOVE "SCADENZA"       TO NOME-VIEW
002240          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002250
002260
002270          MOVE "VALIDITA"      TO NOME-VIEW
002280          MOVE SPACES          TO STRINGA-VIEW.
002290
002300          STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
002310          DELIMITED BY SIZE INTO STRINGA-VIEW.
002320
002330          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002340
002350
002360
002370 EX-LOAD-VIEW.
002380          EXIT.
002390
002400 REPLACE-WEB.
002410
002420          IF DATI-WEB(1:5) = "@MENU"
002430           PERFORM LETTURA-MENU   THRU EX-LETTURA-MENU
002440           MOVE SPACES            TO DATI-WEB(1:8).
002450
002460          IF DATI-WEB(1:5) = "@LOAD"
002470           PERFORM LETTURA-MOD THRU EX-LETTURA-MOD
002480           MOVE SPACES            TO DATI-WEB(1:8).
002490
002500          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
002510
002520 EX-REPLACE-WEB.
002530          EXIT.
002540
002550
002560 LETTURA-MENU.
002570
002580          INITIALIZE ABILITAZIONE.
002590
002600          MOVE GRUPPO-UTEN                TO GRUPPO-ABI.
002610          IF GRUPPO-ABI = ZEROS
002620          MOVE 1                          TO GRUPPO-ABI.
002630          MOVE 01                         TO ENTE-ABI.
002640          MOVE DATI-WEB(6:2)              TO MOD-ABI.
002650
002660          PERFORM ABILITAZIONI    THRU EX-ABILITAZIONI.
002670
002680          IF DISABLED
002690          INSPECT DATI-WEB REPLACING ALL "false" BY "true ".
002700
002710
002720 EX-LETTURA-MENU.
002730          EXIT.
002740
002750 LETTURA-MOD.
002760
002770          INITIALIZE MENU.
002780
002790
002800          MOVE DATI-WEB(6:2)      TO DEP-MOD.
002810
002820          PERFORM STARTO-MENU     THRU EX-STARTO-MENU.
002830          IF ESITO-NOK
002840          STRING  "MANCA MENU" MOD-MENU DELIMITED BY SIZE INTO MESSAGGIO
002850           PERFORM VIS-MESS    THRU EX-VIS-MESS
002860            GO TO EX-LETTURA-MOD.
002870
002880          SET FIRST-TIME  TO TRUE.
002890
002900 CICLO-LETTURA-MOD.
002910
002920          PERFORM LEGGO-NEXT-MENU THRU EX-LEGGO-NEXT-MENU.
002930
002940
002950          IF FINE-FILE = "S" GO TO END-LETTURA-MOD.
002960
002970          IF MOD-MENU NOT = DEP-MOD GO CICLO-LETTURA-MOD.
002980
002990          IF ENT-MENU = SPACES GO TO CICLO-LETTURA-MOD.
003000
003010
003020          IF FUNCTION UPPER-CASE(DESC-MENU) = "SEPARATORE"
003030           MOVE '        <div class="menu-sep"></div>' TO DATI-WEB
003040           PERFORM LINE-WEB        THRU EX-LINE-WEB
003050            GO TO CICLO-LETTURA-MOD.
003060
003070          INITIALIZE ABILITAZIONE.
003080
003090          MOVE GRUPPO-UTEN        TO GRUPPO-ABI.
003100          IF GRUPPO-ABI = ZEROS
003110            MOVE 1                TO GRUPPO-ABI.
003120
003130          MOVE 01                 TO ENTE-ABI.
003140          MOVE CHIAVE-SEC-MENU    TO CHIAMATA-ABI.
003150
003160          PERFORM ABILITAZIONI    THRU EX-ABILITAZIONI.
003170
003180
003190          IF FUNZ-MENU = SPACES
003200              PERFORM MAKE-ENTITA   THRU EX-MAKE-ENTITA
003210           ELSE
003220              PERFORM MAKE-FUNZIONE THRU EX-MAKE-FUNZIONE.
003230
003240          GO TO CICLO-LETTURA-MOD.
003250
003260 END-LETTURA-MOD.
003270
003280          MOVE "          </div></div>"     TO DATI-WEB
003290          PERFORM LINE-WEB                  THRU EX-LINE-WEB.
003300
003310 EX-LETTURA-MOD.
003320          EXIT.
003330
003340 ABILITAZIONI.
003350
003360          PERFORM LEGGO-ABI       THRU EX-LEGGO-ABI.
003370
003380          IF ESITO-NOK
003390           SET DISABLED           TO TRUE.
003400
003410          IF NOME-UTEN = "ADMIN" OR GRUPPO-UTEN > 99
003420           MOVE "N"                TO FLAG-DISABLED.
003430
003440 EX-ABILITAZIONI.
003450          EXIT.
003460 MAKE-ENTITA.
003470
003480          IF NOT FIRST-TIME
003490          MOVE   "        </div></div>"     TO DATI-WEB
003500          PERFORM LINE-WEB        THRU EX-LINE-WEB
003510          ELSE
003520          MOVE "N"                        TO FLAG-TIME.
003530
003540
003550
003560          IF DISABLED
003570                  MOVE "disabled:true"            to wdisable
003580          else
003590                  MOVE "disabled:false"           to wdisable.
003600
003610          IF IMG-MENU > ZEROS
003620                  AND IMG-MENU < 20
003630                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
003640
003650              else
003660                  MOVE SPACES                     to wIMAGES.
003670
003680          STRING "             " DELIMITED BY SIZE
003690          '<div data-options="'
003700                  wdisable delimited by  "  "
003710                  wimages delimited by "   "
003720                   '"><span>' delimited BY  SIZE
003730          DESC-MENU DELIMITED BY "    " "</span><div>"
003740              DELIMITED BY SIZE INTO DATI-WEB.
003750
003760          PERFORM LINE-WEB        THRU EX-LINE-WEB.
003770
003780
003790 EX-MAKE-ENTITA.
003800          EXIT.
003810
003820
003830
003840 MAKE-FUNZIONE.
003850
003860
003870          IF DISABLED
003880          string
003890          '            <div data-options="disabled:true">'
003900          DESC-MENU DELIMITED BY "     " "</div>"
003910              DELIMITED BY SIZE INTO DATI-WEB
003920          ELSE
003930          STRING
003940          '            <div>'  DELIMITED BY SIZE
003950          DESC-MENU DELIMITED BY "     " "</div>"
003960              DELIMITED BY SIZE INTO DATI-WEB.
003970
003980          IF DISABLED
003990                  MOVE "disabled:true"            to wdisable
004000                  else
004010                  MOVE "disabled:false"           to wdisable.
004020
004030          IF IMG-MENU > ZEROS
004040                  AND IMG-MENU < 20
004050                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
004060
004070                  else
004080                  MOVE SPACES                     to wIMAGES.
004090
004100          STRING "             " DELIMITED BY SIZE
004110                  '<div data-options="'
004120                  wdisable delimited by  "  "
004130                  wimages delimited by "   "
004140                  '"><a style="text-decoration:none;" href="' DELIMITED BY SIZE
004150                  PROG-MENU DELIMITED BY "   "
004160                  ".exe?MK-KEY=" SECTION-WEB
004170*                 '" onClick="window.location.reload()" class="easyui-menulink">'
004180                  '" class="easyui-menulink">'
004190
004200          DESC-MENU DELIMITED BY "    " "</a></div>"
004210              DELIMITED BY SIZE INTO DATI-WEB.
004220
004230
004240          PERFORM LINE-WEB        THRU EX-LINE-WEB.
004250
004260
004270 EX-MAKE-FUNZIONE.
004280          EXIT.
