000010*
000012* Copyright (C) 2010-2020 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000013*
000014* This program is free software; you can redistribute it and/or modify
000015* it under the terms of the GNU General Public License as published by
000016* the Free Software Foundation; either version 2, or (at your option)
000017* any later version.
000018*
000019* This program is distributed in the hope that it will be useful,
000020* but WITHOUT ANY WARRANTY; without even the implied warranty of
000021* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000022* GNU General Public License for more details.
000023*
000024* You should have received a copy of the GNU General Public License
000025* along with this software; see the file COPYING.  If not, write to
000026* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000027* Boston, MA 02110-1301 USA
000028*
000029*

000010 IDENTIFICATION   DIVISION.
000020 PROGRAM-ID       OPENPA00.
000030 ENVIRONMENT      DIVISION.
000073 CONFIGURATION    SECTION.
000074
000076 SPECIAL-NAMES.
000077
000078                  ENVIRONMENT-NAME  ENV-NAME
000079                  ENVIRONMENT-VALUE ENV-VALUE
000080
000081                  DECIMAL-POINT IS COMMA.
000082
000083 INPUT-OUTPUT     SECTION.
000084 FILE-CONTROL.
000090
000100          COPY "SELWEB.CBL".
000110	     	COPY "SELVIEW.CBL".
000120          COPY "SELUTEN.CBL".
000130       	COPY "SELTAB.CBL".
000140	    	COPY "SELMENU.CBL".
000150	        COPY "SELABI.CBL".
000160
000170		
000180
000190 DATA             DIVISION.
000200 FILE SECTION.
000210
000220          COPY "FDEWEB.CBL".
000230	        COPY "FDEVIEW.CBL".
000240          COPY "FDEUTEN.CBL".
000250          COPY "FDETAB.CBL".
000260          COPY "FDEMENU.CBL".
000270	        COPY "FDEABI.CBL".
000280
000290 WORKING-STORAGE  SECTION.
000380
000390          COPY "COBW3.CBL".
000400          COPY "GLOBALS.CBL".
000410			COPY "IMAGES.CBL".
000420*
000430 PROCEDURE  DIVISION.
000431
000432 DECLARATIVES.
000433 ERROR-ARCHIVIO SECTION.
000434			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW.
000435 EX-ERRORE-ARCHIVIO.
000436			EXIT.
000437 END DECLARATIVES.
000438
000440*
000450          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000451
000460 
000470          MOVE "MK-KEY"        TO FIELD-WEB
000480          PERFORM READ-WEB     THRU EX-READ-WEB
000490
000500          MOVE VALUE-WEB       TO SECTION-WEB(1:).
000501
000502			IF SECTION-WEB  = SPACES
000503		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000505			GO TO USCITA.
000506
000510
000520          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000530			PERFORM OPEN-I-MENU  THRU EX-OPEN-I-MENU.
000540			PERFORM OPEN-I-ABI   THRU EX-OPEN-I-ABI.
000550          PERFORM OPEN-IO-VIEW THRU EX-OPEN-IO-VIEW.
000551
000552
000553			PERFORM VALIDITA	 THRU EX-VALIDITA.
000554
000555			IF ESITO-NOK
000556		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000557			GO TO FINE.
000570
000580          MOVE "UTENTE"        TO NOME-VIEW
000590          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000600
000610          MOVE STRINGA-VIEW    TO NOME-UTEN.
000620          PERFORM LETTURA-UTEN THRU EX-LETTURA-UTEN.
000630          
000640           IF ESITO-NOK
000650            STRING "SESSIONE SCADUTA O UTENTE NON LOGGATO:" CHIAVE-UTEN
000660			  DELIMITED BY SIZE INTO MESSAGGIO
000670            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
000680           ELSE
000690
000700          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN
000710
000720			PERFORM LOAD-VIEW	 THRU EX-LOAD-VIEW
000730
000740          MOVE "TEMPLATE/ADMIN.HTM"    TO PAGE-WEB
000750          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000760		
000770			PERFORM CLOSE-VIEW	THRU EX-CLOSE-VIEW.
000780          
000790 FINE.
000800			PERFORM CLOSE-UTEN   THRU EX-CLOSE-UTEN.
000810          PERFORM CLOSE-MENU   THRU EX-CLOSE-MENU.
000820	    	PERFORM CLOSE-ABI    THRU EX-CLOSE-ABI.
000830 USCITA.
000831
000840	        PERFORM FINE-WEB     THRU EX-FINE-WEB.
000850
000860          GOBACK.
000870
000880	    	COPY "PIOWEB.CBL".
000890         	COPY "PIOVIEW.CBL".
000900          COPY "PIOTAB.CBL".
000910          COPY "PIOMENU.CBL".
000920          COPY "PIOABI.CBL".
000930          COPY "PIOUTEN.CBL".
000940
000950
000960 LOAD-VIEW.
000970
000980	        STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
000990           DELIMITED BY SIZE INTO STRINGA-VIEW.
001000
001010          MOVE "SCADENZA"       TO NOME-VIEW
001020          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001030
001031
001032          MOVE "VALIDITA"      TO NOME-VIEW
001033		    MOVE SPACES			 TO STRINGA-VIEW.
001034
001035			STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
001036			DELIMITED BY SIZE INTO STRINGA-VIEW.
001037
001038          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001039 
001040
001050 EX-LOAD-VIEW.
001060		   EXIT.
001070
001080 TRATTA-WEB.
001090
001100	        PERFORM REPLACE-WEB  THRU EX-REPLACE-WEB.
001110
001120          PERFORM LINE-WEB     THRU EX-LINE-WEB.
001130          
001140 EX-TRATTA-WEB.
001150          EXIT.
001160
001170
001180 REPLACE-WEB.
001190
001200          IF DATI-WEB(1:5) = "@MENU"
001210           PERFORM LETTURA-MENU	THRU EX-LETTURA-MENU
001220           MOVE SPACES		TO DATI-WEB(1:8).
001230
001240          IF DATI-WEB(1:5) = "@LOAD"
001250           PERFORM LETTURA-MOD THRU EX-LETTURA-MOD
001260           MOVE SPACES		TO DATI-WEB(1:8).
001270
001280			PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001290
001300 EX-REPLACE-WEB.
001310          EXIT.
001320
001330
001340 LETTURA-MENU.
001350
001360	        INITIALIZE ABILITAZIONE.
001370
001380			MOVE GRUPPO-UTEN		TO GRUPPO-ABI.
001390			IF GRUPPO-ABI = ZEROS 
001400			 MOVE 1				    TO GRUPPO-ABI.
001410			MOVE 01				    TO ENTE-ABI.
001420			MOVE DATI-WEB(6:2)	   	TO MOD-ABI.
001430
001440          PERFORM ABILITAZIONI 	THRU EX-ABILITAZIONI.
001450
001460			IF DISABLED 
001470			 INSPECT DATI-WEB REPLACING ALL "false" BY "true ".
001480
001490
001500 EX-LETTURA-MENU.
001510          EXIT.
001520
001530 LETTURA-MOD.
001540 
001550          INITIALIZE MENU.
001560          
001570
001580          MOVE DATI-WEB(6:2)      TO DEP-MOD.
001590          
001600          PERFORM STARTO-MENU     THRU EX-STARTO-MENU.
001610          IF ESITO-NOK 
001620          STRING  "MANCA MENU" MOD-MENU DELIMITED BY SIZE INTO MESSAGGIO
001630           PERFORM VIS-MESS    THRU EX-VIS-MESS
001640            GO TO EX-LETTURA-MOD.
001650            
001660          SET FIRST-TIME  TO TRUE.
001670 
001680 CICLO-LETTURA-MOD.
001690  
001700          PERFORM LEGGO-NEXT-MENU THRU EX-LEGGO-NEXT-MENU.
001710          
001720          
001730          IF FINE-FILE = "S" GO TO END-LETTURA-MOD.
001740
001750          IF MOD-MENU NOT = DEP-MOD GO CICLO-LETTURA-MOD.
001760          
001770          IF ENT-MENU = SPACES GO TO CICLO-LETTURA-MOD.
001780
001790
001800			IF FUNCTION UPPER-CASE(DESC-MENU) = "SEPARATORE"
001810			MOVE '        <div class="menu-sep"></div>' TO DATI-WEB
001820			PERFORM LINE-WEB	THRU EX-LINE-WEB
001830			 GO TO CICLO-LETTURA-MOD.
001840
001850          INITIALIZE ABILITAZIONE.
001860          
001870          MOVE GRUPPO-UTEN	TO GRUPPO-ABI.
001880	        IF GRUPPO-ABI = ZEROS 
001890            MOVE 1	        TO GRUPPO-ABI.
001900            
001910	        MOVE 01			TO ENTE-ABI.
001920	        MOVE CHIAVE-SEC-MENU    TO CHIAMATA-ABI.
001930
001940          PERFORM ABILITAZIONI 	THRU EX-ABILITAZIONI.
001950
001960          
001970          IF FUNZ-MENU = SPACES   
001980              PERFORM MAKE-ENTITA   THRU EX-MAKE-ENTITA     
001990           ELSE
002000              PERFORM MAKE-FUNZIONE THRU EX-MAKE-FUNZIONE.
002010
002020          GO TO CICLO-LETTURA-MOD.
002030          
002040 END-LETTURA-MOD.
002050 
002060          MOVE "          </div></div>"     TO DATI-WEB
002070          PERFORM LINE-WEB                  THRU EX-LINE-WEB.
002080
002090 EX-LETTURA-MOD.
002100          EXIT.
002110
002120 ABILITAZIONI.
002130		
002140	        PERFORM LEGGO-ABI	THRU EX-LEGGO-ABI.
002150
002160	        IF ESITO-NOK
002170           SET DISABLED           TO TRUE.
002180
002190			IF NOME-UTEN = "ADMIN" OR GRUPPO-UTEN > 99
002200 			MOVE "N"		TO FLAG-DISABLED.
002210
002220 EX-ABILITAZIONI.
002230	    	EXIT.          
002240 MAKE-ENTITA.
002250 
002260          IF NOT FIRST-TIME 
002270          MOVE   "        </div></div>"     TO DATI-WEB
002280          PERFORM LINE-WEB        THRU EX-LINE-WEB
002290          ELSE
002300          MOVE "N"		        TO FLAG-TIME.
002310
002320
002330          
002340          IF DISABLED
002350			MOVE "disabled:true"		to wdisable
002360	    	else
002370			MOVE "disabled:false"		to wdisable.
002380
002390          IF IMG-MENU > ZEROS 
002400			AND IMG-MENU < 20
002410			MOVE WIMAGE(IMG-MENU)		TO WIMAGES
002420
002430		    else
002440			MOVE SPACES          		to wIMAGES.
002450
002460          STRING "             " DELIMITED BY SIZE
002470          '<div data-options="' 
002480			wdisable delimited by  "  "
002490			wimages delimited by "   " 
002500                   '"><span>' delimited BY  SIZE
002510          DESC-MENU DELIMITED BY "    " "</span><div>"
002520              DELIMITED BY SIZE INTO DATI-WEB.
002530
002540          PERFORM LINE-WEB        THRU EX-LINE-WEB.
002550          
002560              
002570 EX-MAKE-ENTITA.
002580          EXIT.
002590          
002600          
002610                          
002620 MAKE-FUNZIONE.
002630 
002640          
002650          IF DISABLED
002660          string
002670          '            <div data-options="disabled:true">'  
002680          DESC-MENU DELIMITED BY "     " "</div>"
002690              DELIMITED BY SIZE INTO DATI-WEB
002700          ELSE
002710          STRING
002720          '            <div>'  DELIMITED BY SIZE
002730          DESC-MENU DELIMITED BY "     " "</div>"
002740              DELIMITED BY SIZE INTO DATI-WEB.
002750
002760          IF DISABLED
002770			MOVE "disabled:true"		to wdisable
002780			else
002790			MOVE "disabled:false"		to wdisable.
002800
002810          IF IMG-MENU > ZEROS 
002820			AND IMG-MENU < 20
002830			MOVE WIMAGE(IMG-MENU)		TO WIMAGES
002840  	
002850			else
002860			MOVE SPACES          		to wIMAGES.
002870
002880          STRING "             " DELIMITED BY SIZE
002890			'<div data-options="' 
002900			wdisable delimited by  "  "
002910			wimages delimited by "   " 
002920			'"><a style="text-decoration:none;" href="' DELIMITED BY SIZE
002930			PROG-MENU DELIMITED BY "   "  
002940			".exe?MK-KEY=" SECTION-WEB 
002950*			'" onClick="window.location.reload()" class="easyui-menulink">'
002960			'" class="easyui-menulink">'
002970
002980          DESC-MENU DELIMITED BY "    " "</a></div>"
002990              DELIMITED BY SIZE INTO DATI-WEB.
003000
003010
003020          PERFORM LINE-WEB        THRU EX-LINE-WEB.
003030          
003040              
003050 EX-MAKE-FUNZIONE.
003060          EXIT.
