000010*
000020* Copyright (C) 2010-2020 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENTA07.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230 SPECIAL-NAMES.
000240          DECIMAL-POINT IS COMMA.
000250 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELTAB.CBL".
000301			COPY "SELJSON.CBL".
000310
000320
000330
000340 DATA             DIVISION.
000350 FILE SECTION.
000360
000370          COPY "FDEWEB.CBL".
000380          COPY "FDEVIEW.CBL".
000390          COPY "FDETAB.CBL".
000400			COPY "FDEJSON.CBL".
000401
000410 WORKING-STORAGE  SECTION.
000420
000430          COPY "COBW3.CBL".
000440          COPY "GLOBALS.CBL".
000450          COPY "IMAGES.CBL".
000460*
000470 PROCEDURE  DIVISION.
000480*
000490          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000500
000510          PERFORM OPEN-I-TAB   THRU EX-OPEN-I-TAB.
000520
000530          COPY "INIZIALI.CBL".
000540
000550
000560          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000570
000580          MOVE "TEMPLATE/TABELL07.HTM"    TO PAGE-WEB
000590          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000600
000610
000620 FINE.
000630          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000640          PERFORM CLOSE-TAB    THRU EX-CLOSE-TAB.
000650
000660
000670          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000680
000690          GOBACK.
000700
000710          COPY "PIOWEB.CBL".
000720          COPY "PIOVIEW.CBL".
000730          COPY "PIOTAB.CBL".
000731			COPY "PIOJSON.CBL".
000740
000750
000760 LOAD-VIEW.
000770
000780          MOVE SECTION-WEB        TO STRINGA-VIEW.
000790          MOVE "SECTION-WEB"      TO NOME-VIEW
000800          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000810
000830          MOVE "TABELL07"		 	TO NOME-JSON.
000831			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
000832
000836			STRING "/OpenPA/" FILE-JSON 
000837			 DELIMITED BY SIZE INTO STRINGA-VIEW.
000838
000840          MOVE "FILE-JSON"        TO NOME-VIEW
000841          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000843			
000844          MOVE LOW-VALUE          TO CHIAVE-TAB.
000845          MOVE "07"               TO TIPO-TAB.
000850          MOVE 1                  TO ENTE-TAB.
000860          PERFORM STARTO-TAB      THRU EX-STARTO-TAB.
000870
000880          if ESITO-NOK GO TO FINE-TABELLA.
000881
000882
000883			MOVE '{"rows":['		TO DATI-JSON.
000884			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
000885
000890
001080 CICLO-TABELLA.
001081
001082			PERFORM LEGGO-NEXT-TAB	THRU EX-LEGGO-NEXT-TAB.
001083
001084			IF TIPO-TAB NOT = "07" MOVE "S" TO FINE-FILE.
001085
001087			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001088		
001089			STRING 
001090
001091			'{"ELEMENTO":"'	DELIMITED BY SIZE
001092			ELEMENTO-TAB    DELIMITED BY "   "
001093			'","'			DELIMITED BY SIZE
001094		 
001095			'"DESCRIZ":"'	DELIMITED BY SIZE
001096			DESC-TAB        DELIMITED BY "     "
001097			'","'			DELIMITED BY SIZE
001098			'"LINK":"'	    DELIMITED BY SIZE
001099			'<a href=openta01.exe?MK-KEY='
001100			 SECTION-WEB DELIMITED BY SIZE
001101			'>variazione</a>' delimited by size 
001102          "}," DELIMITED BY SIZE 
001103			into dati-JSON
001104
001105			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001106
001107
001108			GO TO CICLO-TABELLA.
001109
001110
001111 FINE-TABELLA.
001112
001113			CLOSE ARKJSON.
001114
001115
001116 EX-LOAD-VIEW.
001117          EXIT.
001120
001130 LETTURA.
001131
001133
001134			IF FINE-FILE = "S" GO TO EX-LETTURA.
001135
001136          MOVE DATI-WEB(7:) TO FILE-LIB.
001137
001140
001141 CICLO-LETTURA.
001142
001143
001144		    PERFORM LEGGO-NEXT-TAB  THRU EX-LEGGO-NEXT-TAB.
001145
001146			IF TIPO-TAB NOT = "07" MOVE "S" TO FINE-FILE.
001147
001148		    IF FINE-FILE = "S" GO TO EX-LETTURA.
001149*
001150*** CICLA E PREPARA TABLE HTML
001151*			
001152
001153		    MOVE DESC-TAB		    TO BUFFER.
001154			PERFORM LETTURA-LIB		THRU EX-LETTURA-LIB.
001155
001156
001157			GO TO CICLO-LETTURA.			
001158
001159 EX-LETTURA.
001160		    EXIT.
001180
001190
001200 REPLACE-WEB.
001210
001220          IF DATI-WEB(1:5) = "@LOOP"
001230           PERFORM LETTURA        THRU EX-LETTURA
001240           MOVE SPACES            TO DATI-WEB(1:8).
001250
001260          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001270
001280
001290 EX-REPLACE-WEB.
001300          EXIT.
001310
