000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENPA00.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000260 SPECIAL-NAMES.
000270
000280                  ENVIRONMENT-NAME  ENV-NAME
000290                  ENVIRONMENT-VALUE ENV-VALUE
000300
000310                  DECIMAL-POINT IS COMMA.
000320
000330 INPUT-OUTPUT     SECTION.
000340 FILE-CONTROL.
000350
000360          COPY "SELWEB.CBL".
000370	     	COPY "SELVIEW.CBL".
000380          COPY "SELUTEN.CBL".
000390       	COPY "SELTAB.CBL".
000400	    	COPY "SELMENU.CBL".
000410	        COPY "SELABI.CBL".
000420
000430		
000440
000450 DATA             DIVISION.
000460 FILE SECTION.
000470
000480          COPY "FDEWEB.CBL".
000490	        COPY "FDEVIEW.CBL".
000500          COPY "FDEUTEN.CBL".
000510          COPY "FDETAB.CBL".
000520          COPY "FDEMENU.CBL".
000530	        COPY "FDEABI.CBL".
000540
000550 WORKING-STORAGE  SECTION.
000560
000570          COPY "COBW3.CBL".
000580          COPY "GLOBALS.CBL".
000590			COPY "IMAGES.CBL".
000600*
000610 PROCEDURE  DIVISION.
000620
000630 DECLARATIVES.
000640 ERROR-ARCHIVIO SECTION.
000650			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW.
000660 EX-ERRORE-ARCHIVIO.
000670			EXIT.
000680 END DECLARATIVES.
000690
000700*
000710          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000720
000730 
000740          MOVE "MK-KEY"        TO FIELD-WEB
000750          PERFORM READ-WEB     THRU EX-READ-WEB
000760
000770          MOVE VALUE-WEB       TO SECTION-WEB(1:).
000780
000790			IF SECTION-WEB  = SPACES
000800		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000810			GO TO USCITA.
000820
000830
000840          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000850			PERFORM OPEN-I-MENU  THRU EX-OPEN-I-MENU.
000860			PERFORM OPEN-I-ABI   THRU EX-OPEN-I-ABI.
000870          PERFORM OPEN-IO-VIEW THRU EX-OPEN-IO-VIEW.
000880
000890
000900			PERFORM VALIDITA	 THRU EX-VALIDITA.
000910
000920			IF ESITO-NOK
000930		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000940			GO TO FINE.
000950
000960          MOVE "UTENTE"        TO NOME-VIEW
000970          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000980
000990          MOVE STRINGA-VIEW    TO NOME-UTEN.
001000          PERFORM LETTURA-UTEN THRU EX-LETTURA-UTEN.
001010          
001020           IF ESITO-NOK
001030            STRING "SESSIONE SCADUTA O UTENTE NON LOGGATO:" CHIAVE-UTEN
001040			  DELIMITED BY SIZE INTO MESSAGGIO
001050            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
001060           ELSE
001070
001080          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN
001090
001100			PERFORM LOAD-VIEW	 THRU EX-LOAD-VIEW
001110
001120          MOVE "TEMPLATE/ADMIN.HTM"    TO PAGE-WEB
001130          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
001140		
001150			PERFORM CLOSE-VIEW	THRU EX-CLOSE-VIEW.
001160          
001170 FINE.
001180			PERFORM CLOSE-UTEN   THRU EX-CLOSE-UTEN.
001190          PERFORM CLOSE-MENU   THRU EX-CLOSE-MENU.
001200	    	PERFORM CLOSE-ABI    THRU EX-CLOSE-ABI.
001210 USCITA.
001220
001230	        PERFORM FINE-WEB     THRU EX-FINE-WEB.
001240
001250          GOBACK.
001260
001270	    	COPY "PIOWEB.CBL".
001280         	COPY "PIOVIEW.CBL".
001290          COPY "PIOTAB.CBL".
001300          COPY "PIOMENU.CBL".
001310          COPY "PIOABI.CBL".
001320          COPY "PIOUTEN.CBL".
001330
001340
001350 LOAD-VIEW.
001360
001370	        STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
001380           DELIMITED BY SIZE INTO STRINGA-VIEW.
001390
001400          MOVE "SCADENZA"       TO NOME-VIEW
001410          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001420
001430
001440          MOVE "VALIDITA"      TO NOME-VIEW
001450		    MOVE SPACES			 TO STRINGA-VIEW.
001460
001470			STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
001480			DELIMITED BY SIZE INTO STRINGA-VIEW.
001490
001500          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001510 
001520
001530 EX-LOAD-VIEW.
001540		   EXIT.
001550
001560 TRATTA-WEB.
001570
001580	        PERFORM REPLACE-WEB  THRU EX-REPLACE-WEB.
001590
001600          PERFORM LINE-WEB     THRU EX-LINE-WEB.
001610          
001620 EX-TRATTA-WEB.
001630          EXIT.
001640
001650
001660 REPLACE-WEB.
001670
001680          IF DATI-WEB(1:5) = "@MENU"
001690           PERFORM LETTURA-MENU	THRU EX-LETTURA-MENU
001700           MOVE SPACES		TO DATI-WEB(1:8).
001710
001720          IF DATI-WEB(1:5) = "@LOAD"
001730           PERFORM LETTURA-MOD THRU EX-LETTURA-MOD
001740           MOVE SPACES		TO DATI-WEB(1:8).
001750
001760			PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
001770
001780 EX-REPLACE-WEB.
001790          EXIT.
001800
001810
001820 LETTURA-MENU.
001830
001840	        INITIALIZE ABILITAZIONE.
001850
001860			MOVE GRUPPO-UTEN		TO GRUPPO-ABI.
001870			IF GRUPPO-ABI = ZEROS 
001880			 MOVE 1				    TO GRUPPO-ABI.
001890			MOVE 01				    TO ENTE-ABI.
001900			MOVE DATI-WEB(6:2)	   	TO MOD-ABI.
001910
001920          PERFORM ABILITAZIONI 	THRU EX-ABILITAZIONI.
001930
001940			IF DISABLED 
001950			 INSPECT DATI-WEB REPLACING ALL "false" BY "true ".
001960
001970
001980 EX-LETTURA-MENU.
001990          EXIT.
002000
002010 LETTURA-MOD.
002020 
002030          INITIALIZE MENU.
002040          
002050
002060          MOVE DATI-WEB(6:2)      TO DEP-MOD.
002070          
002080          PERFORM STARTO-MENU     THRU EX-STARTO-MENU.
002090          IF ESITO-NOK 
002100          STRING  "MANCA MENU" MOD-MENU DELIMITED BY SIZE INTO MESSAGGIO
002110           PERFORM VIS-MESS    THRU EX-VIS-MESS
002120            GO TO EX-LETTURA-MOD.
002130            
002140          SET FIRST-TIME  TO TRUE.
002150 
002160 CICLO-LETTURA-MOD.
002170  
002180          PERFORM LEGGO-NEXT-MENU THRU EX-LEGGO-NEXT-MENU.
002190          
002200          
002210          IF FINE-FILE = "S" GO TO END-LETTURA-MOD.
002220
002230          IF MOD-MENU NOT = DEP-MOD GO CICLO-LETTURA-MOD.
002240          
002250          IF ENT-MENU = SPACES GO TO CICLO-LETTURA-MOD.
002260
002270
002280			IF FUNCTION UPPER-CASE(DESC-MENU) = "SEPARATORE"
002290			MOVE '        <div class="menu-sep"></div>' TO DATI-WEB
002300			PERFORM LINE-WEB	THRU EX-LINE-WEB
002310			 GO TO CICLO-LETTURA-MOD.
002320
002330          INITIALIZE ABILITAZIONE.
002340          
002350          MOVE GRUPPO-UTEN	TO GRUPPO-ABI.
002360	        IF GRUPPO-ABI = ZEROS 
002370            MOVE 1	        TO GRUPPO-ABI.
002380            
002390	        MOVE 01			TO ENTE-ABI.
002400	        MOVE CHIAVE-SEC-MENU    TO CHIAMATA-ABI.
002410
002420          PERFORM ABILITAZIONI 	THRU EX-ABILITAZIONI.
002430
002440          
002450          IF FUNZ-MENU = SPACES   
002460              PERFORM MAKE-ENTITA   THRU EX-MAKE-ENTITA     
002470           ELSE
002480              PERFORM MAKE-FUNZIONE THRU EX-MAKE-FUNZIONE.
002490
002500          GO TO CICLO-LETTURA-MOD.
002510          
002520 END-LETTURA-MOD.
002530 
002540          MOVE "          </div></div>"     TO DATI-WEB
002550          PERFORM LINE-WEB                  THRU EX-LINE-WEB.
002560
002570 EX-LETTURA-MOD.
002580          EXIT.
002590
002600 ABILITAZIONI.
002610		
002620	        PERFORM LEGGO-ABI	THRU EX-LEGGO-ABI.
002630
002640	        IF ESITO-NOK
002650           SET DISABLED           TO TRUE.
002660
002670			IF NOME-UTEN = "ADMIN" OR GRUPPO-UTEN > 99
002680 			MOVE "N"		TO FLAG-DISABLED.
002690
002700 EX-ABILITAZIONI.
002710	    	EXIT.          
002720 MAKE-ENTITA.
002730 
002740          IF NOT FIRST-TIME 
002750          MOVE   "        </div></div>"     TO DATI-WEB
002760          PERFORM LINE-WEB        THRU EX-LINE-WEB
002770          ELSE
002780          MOVE "N"		        TO FLAG-TIME.
002790
002800
002810          
002820          IF DISABLED
002830			MOVE "disabled:true"		to wdisable
002840	    	else
002850			MOVE "disabled:false"		to wdisable.
002860
002870          IF IMG-MENU > ZEROS 
002880			AND IMG-MENU < 20
002890			MOVE WIMAGE(IMG-MENU)		TO WIMAGES
002900
002910		    else
002920			MOVE SPACES          		to wIMAGES.
002930
002940          STRING "             " DELIMITED BY SIZE
002950          '<div data-options="' 
002960			wdisable delimited by  "  "
002970			wimages delimited by "   " 
002980                   '"><span>' delimited BY  SIZE
002990          DESC-MENU DELIMITED BY "    " "</span><div>"
003000              DELIMITED BY SIZE INTO DATI-WEB.
003010
003020          PERFORM LINE-WEB        THRU EX-LINE-WEB.
003030          
003040              
003050 EX-MAKE-ENTITA.
003060          EXIT.
003070          
003080          
003090                          
003100 MAKE-FUNZIONE.
003110 
003120          
003130          IF DISABLED
003140          string
003150          '            <div data-options="disabled:true">'  
003160          DESC-MENU DELIMITED BY "     " "</div>"
003170              DELIMITED BY SIZE INTO DATI-WEB
003180          ELSE
003190          STRING
003200          '            <div>'  DELIMITED BY SIZE
003210          DESC-MENU DELIMITED BY "     " "</div>"
003220              DELIMITED BY SIZE INTO DATI-WEB.
003230
003240          IF DISABLED
003250			MOVE "disabled:true"		to wdisable
003260			else
003270			MOVE "disabled:false"		to wdisable.
003280
003290          IF IMG-MENU > ZEROS 
003300			AND IMG-MENU < 20
003310			MOVE WIMAGE(IMG-MENU)		TO WIMAGES
003320  	
003330			else
003340			MOVE SPACES          		to wIMAGES.
003350
003360          STRING "             " DELIMITED BY SIZE
003370			'<div data-options="' 
003380			wdisable delimited by  "  "
003390			wimages delimited by "   " 
003400			'"><a style="text-decoration:none;" href="' DELIMITED BY SIZE
003410			PROG-MENU DELIMITED BY "   "  
003420			".exe?MK-KEY=" SECTION-WEB DELIMITED BY SIZE
003421					"&MK-ENTITA=" ENT-MENU DELIMITED BY SIZE
003422					"&MK-FUNZIONE=" FUNZ-MENU DELIMITED BY SIZE
003423
003430*			'" onClick="window.location.reload()" class="easyui-menulink">'
003440			'" class="easyui-menulink">'
003450
003460          DESC-MENU DELIMITED BY "    " "</a></div>"
003470              DELIMITED BY SIZE INTO DATI-WEB.
003480
003490
003500          PERFORM LINE-WEB        THRU EX-LINE-WEB.
003510          
003520              
003530 EX-MAKE-FUNZIONE.
003540          EXIT.
