000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200 IDENTIFICATION   DIVISION.
000210 PROGRAM-ID       OPENPA01.
000220 ENVIRONMENT      DIVISION.
000230 CONFIGURATION    SECTION.
000240
000250			COPY "SPECIAL.CBL".
000260
000270 INPUT-OUTPUT     SECTION.
000280 FILE-CONTROL.
000290
000300          COPY "SELWEB.CBL".
000310          COPY "SELVIEW.CBL".
000320          COPY "SELUTEN.CBL".
000330          COPY "SELTAB.CBL".
000340          COPY "SELMENU.CBL".
000350          COPY "SELABI.CBL".
000360
000370
000380
000390 DATA             DIVISION.
000400 FILE SECTION.
000410
000420          COPY "FDEWEB.CBL".
000430          COPY "FDEVIEW.CBL".
000440          COPY "FDEUTEN.CBL".
000450          COPY "FDETAB.CBL".
000460          COPY "FDEMENU.CBL".
000470          COPY "FDEABI.CBL".
000480
000490 WORKING-STORAGE  SECTION.
000500
000510          COPY "COBW3.CBL".
000520          COPY "GLOBALS.CBL".
000530          COPY "IMAGES.CBL".
000540*
000550 PROCEDURE  DIVISION.
000560*
000570          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000580
000590          PERFORM OPEN-IO-UTEN THRU EX-OPEN-IO-UTEN.
000600
000610          MOVE "MK-UTENTE"    TO FIELD-WEB
000620          PERFORM READ-WEB    THRU EX-READ-WEB
000630
000640          MOVE FUNCTION UPPER-CASE(VALUE-WEB)   TO NOME-UTEN
000650
000660          PERFORM LEGGO-UTEN  THRU EX-LEGGO-UTEN.
000700
000710          IF ESITO-NOK
000720		    INITIALIZE UTENTE
000730			ELSE
000740		 	PERFORM SESSIONE	THRU EX-SESSIONE.
000750 
000760          PERFORM OPEN-O-VIEW THRU EX-OPEN-O-VIEW.
000770
000780          PERFORM LOAD-VIEW   THRU EX-LOAD-VIEW.
000790          
000791
000792			MOVE "MK-PASSWORD"  TO FIELD-WEB
000793	        PERFORM READ-WEB    THRU EX-READ-WEB
000794
000803			MOVE VALUE-WEB      TO FIELD-WEB.
000810          PERFORM SHA-WEB     THRU EX-SHA-WEB.
000820          
000850
000851          MOVE VALUE-WEB      TO STRINGA-VIEW.
000852          MOVE "SHA3-WEB"     TO NOME-VIEW
000853          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
000854          
000860
000870          IF VALUE-WEB NOT = PASSWORD-UTEN
000880			OR PASSWORD-UTEN = SPACES
000890          MOVE "ERRORE LOGIN UTENTE" TO MESSAGGIO
000900          PERFORM VIS-LOGIN   THRU EX-VIS-LOGIN
000910              ELSE
000920          MOVE "TEMPLATE/ADMIN.HTM"    TO PAGE-WEB
000930
000940
000950          PERFORM OPEN-I-MENU THRU EX-OPEN-I-MENU
000960          PERFORM OPEN-I-ABI  THRU EX-OPEN-I-ABI
000970
000980          PERFORM MAKE-WEB    THRU EX-MAKE-WEB
000990
001000          PERFORM CLOSE-MENU  THRU EX-CLOSE-MENU
001010          PERFORM CLOSE-ABI   THRU EX-CLOSE-ABI.
001020          PERFORM CLOSE-VIEW  THRU EX-CLOSE-VIEW.
001030
001040
001050
001060
001070 FINE.
001080          PERFORM CLOSE-UTEN  THRU EX-CLOSE-UTEN.
001090
001100
001110          PERFORM FINE-WEB    THRU EX-FINE-WEB.
001120
001130          GOBACK.
001140
001150          COPY "PIOWEB.CBL".
001160          COPY "PIOUTEN.CBL".
001170          COPY "PIOVIEW.CBL".
001180          COPY "PIOTAB.CBL".
001190          COPY "PIOMENU.CBL".
001200          COPY "PIOABI.CBL".
001210
001220 TRATTA-WEB.
001230
001240          PERFORM REPLACE-WEB THRU EX-REPLACE-WEB.
001250
001260          PERFORM LINE-WEB    THRU EX-LINE-WEB.
001270
001280 EX-TRATTA-WEB.
001290          EXIT.
001300
001310 LOAD-VIEW.
001320
001330          MOVE SPACES TO STRINGA-VIEW.
001340          DISPLAY "REMOTE_ADDR" UPON ENV-NAME
001350          ACCEPT STRINGA-VIEW   FROM ENV-VALUE
001360          ON EXCEPTION CONTINUE
001370          END-ACCEPT.
001380
001390          MOVE "REMOTE-IP"       TO NOME-VIEW
001400          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001410
001420          MOVE SPACES TO STRINGA-VIEW.
001430
001440          DISPLAY "REMOTE_PORT" UPON ENV-NAME
001450          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001460          ON EXCEPTION CONTINUE
001470          END-ACCEPT.
001480
001490          MOVE "REMOTE-PORT"     TO NOME-VIEW
001500          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001510
001520
001530
001540          DISPLAY "TEST_PORT" UPON ENV-NAME 
001550
001560          DISPLAY "FEDERICO" UPON ENV-VALUE
001570
001580          ACCEPT STRINGA-VIEW FROM ENV-VALUE
001590          ON EXCEPTION CONTINUE
001600          END-ACCEPT.
001610
001620          MOVE "TEST-PORT"  TO NOME-VIEW
001630          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001640
001650
001660
001670
001680          MOVE SECTION-WEB    TO STRINGA-VIEW.
001690          MOVE "SECTION-WEB"  TO NOME-VIEW
001700          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001710
001720
001730          PERFORM OPEN-I-TAB  THRU EX-OPEN-I-TAB.
001740          MOVE 1                  TO PROG-TAB.
001750          MOVE "01"           TO TIPO-TAB.
001760          MOVE 01             TO ENTE-TAB.
001770          PERFORM LEGGO-TAB   THRU EX-LEGGO-TAB.
001780
001790          IF ESITO-NOK MOVE "ENTE DI PROVA" TO DESC-ENTE-001.
001800
001810          CLOSE ARKTAB.
001820
001830          MOVE DESC-ENTE-001  TO STRINGA-VIEW.
001840          MOVE "DESC-ENTE"    TO NOME-VIEW
001850          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001860
001870
001880          MOVE NOME-UTEN      TO STRINGA-VIEW
001890          MOVE "UTENTE"       TO NOME-VIEW
001900          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
001910
001920
001930
001940
001950          ACCEPT DATA-SYS FROM DATE.
001960          MOVE GG-SYS         TO GG-WEB.
001970          MOVE MM-SYS         TO MM-WEB.
001980          MOVE AA-SYS         TO AA-WEB.
001990          ADD 2000                        TO AA-WEB.
002000
002010          MOVE DATA-WEB       TO DATA-VIEW
002020          MOVE "OGGI  "       TO NOME-VIEW
002030          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002040
002050
002060
002070          MOVE "MK-DATA"      TO FIELD-WEB
002080          PERFORM READ-WEB    THRU EX-READ-WEB
002090
002100          MOVE DATA-WEB       TO DATA-VIEW
002110
002120          MOVE "ACCESSO"      TO NOME-VIEW
002130          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002140
002150          STRING ORA-SCA-UTEN ":" MIN-SCA-UTEN
002160           DELIMITED BY SIZE INTO STRINGA-VIEW.
002170
002180          MOVE "SCADENZA"       TO NOME-VIEW
002190          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002200
002210
002220          MOVE "VALIDITA"      TO NOME-VIEW
002230          MOVE SPACES          TO STRINGA-VIEW.
002240
002250          STRING AA-WEB MM-WEB GG-WEB MINUTI-SCA-UTEN
002260          DELIMITED BY SIZE INTO STRINGA-VIEW.
002270
002280          PERFORM SCRITTURA-VIEW THRU EX-SCRITTURA-VIEW.
002290
002300
002310
002320 EX-LOAD-VIEW.
002330          EXIT.
002340
002350 REPLACE-WEB.
002360
002370          IF DATI-WEB(1:5) = "@MENU"
002380           PERFORM LETTURA-MENU   THRU EX-LETTURA-MENU
002390           MOVE SPACES            TO DATI-WEB(1:8).
002400
002410          IF DATI-WEB(1:5) = "@LOAD"
002420           PERFORM LETTURA-MOD THRU EX-LETTURA-MOD
002430           MOVE SPACES            TO DATI-WEB(1:8).
002440
002450          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
002460
002470 EX-REPLACE-WEB.
002480          EXIT.
002490
002500
002510 LETTURA-MENU.
002520
002530          INITIALIZE ABILITAZIONE.
002540
002550          MOVE GRUPPO-UTEN                TO GRUPPO-ABI.
002560          IF GRUPPO-ABI = ZEROS
002570          MOVE 1                          TO GRUPPO-ABI.
002580          MOVE 01                         TO ENTE-ABI.
002590          MOVE DATI-WEB(6:2)              TO MOD-ABI.
002600
002610          PERFORM ABILITAZIONI    THRU EX-ABILITAZIONI.
002620
002630          IF DISABLED
002640          INSPECT DATI-WEB REPLACING ALL "false" BY "true ".
002650
002660
002670 EX-LETTURA-MENU.
002680          EXIT.
002690
002700 LETTURA-MOD.
002710
002720          INITIALIZE MENU.
002730
002740
002750          MOVE DATI-WEB(6:2)      TO DEP-MOD.
002760
002770          PERFORM STARTO-MENU     THRU EX-STARTO-MENU.
002780          IF ESITO-NOK
002790          STRING  "MANCA MENU" MOD-MENU DELIMITED BY SIZE INTO MESSAGGIO
002800           PERFORM VIS-MESS    THRU EX-VIS-MESS
002810            GO TO EX-LETTURA-MOD.
002820
002830          SET FIRST-TIME  TO TRUE.
002840
002850 CICLO-LETTURA-MOD.
002860
002870          PERFORM LEGGO-NEXT-MENU THRU EX-LEGGO-NEXT-MENU.
002880
002890
002900          IF FINE-FILE = "S" GO TO END-LETTURA-MOD.
002910
002920          IF MOD-MENU NOT = DEP-MOD GO CICLO-LETTURA-MOD.
002930
002940          IF ENT-MENU = SPACES GO TO CICLO-LETTURA-MOD.
002950
002960
002970          IF FUNCTION UPPER-CASE(DESC-MENU) = "SEPARATORE"
002980           MOVE '        <div class="menu-sep"></div>' TO DATI-WEB
002990           PERFORM LINE-WEB        THRU EX-LINE-WEB
003000            GO TO CICLO-LETTURA-MOD.
003010
003020          INITIALIZE ABILITAZIONE.
003030
003040          MOVE GRUPPO-UTEN        TO GRUPPO-ABI.
003050          IF GRUPPO-ABI = ZEROS
003060            MOVE 1                TO GRUPPO-ABI.
003070
003080          MOVE 01                 TO ENTE-ABI.
003090          MOVE CHIAVE-SEC-MENU    TO CHIAMATA-ABI.
003100
003110          PERFORM ABILITAZIONI    THRU EX-ABILITAZIONI.
003120
003130
003140          IF FUNZ-MENU = SPACES
003150              PERFORM MAKE-ENTITA   THRU EX-MAKE-ENTITA
003160           ELSE
003170              PERFORM MAKE-FUNZIONE THRU EX-MAKE-FUNZIONE.
003180
003190          GO TO CICLO-LETTURA-MOD.
003200
003210 END-LETTURA-MOD.
003220
003230          MOVE "          </div></div>"     TO DATI-WEB
003240          PERFORM LINE-WEB                  THRU EX-LINE-WEB.
003250
003260 EX-LETTURA-MOD.
003270          EXIT.
003280
003290 ABILITAZIONI.
003300
003310          PERFORM LEGGO-ABI       THRU EX-LEGGO-ABI.
003320
003330          IF ESITO-NOK
003340           SET DISABLED           TO TRUE.
003350
003360          IF NOME-UTEN = "ADMIN" OR GRUPPO-UTEN > 99
003370           MOVE "N"                TO FLAG-DISABLED.
003380
003390 EX-ABILITAZIONI.
003400          EXIT.
003410 MAKE-ENTITA.
003420
003430          IF NOT FIRST-TIME
003440          MOVE   "        </div></div>"     TO DATI-WEB
003450          PERFORM LINE-WEB        THRU EX-LINE-WEB
003460          ELSE
003470          MOVE "N"                        TO FLAG-TIME.
003480
003490
003500
003510          IF DISABLED
003520                  MOVE "disabled:true"            to wdisable
003530          else
003540                  MOVE "disabled:false"           to wdisable.
003550
003560          IF IMG-MENU > ZEROS
003570                  AND IMG-MENU < 20
003580                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
003590
003600              else
003610                  MOVE SPACES                     to wIMAGES.
003620
003630          STRING "             " DELIMITED BY SIZE
003640          '<div data-options="'
003650                  wdisable delimited by  "  "
003660                  wimages delimited by "   "
003670                   '"><span>' delimited BY  SIZE
003680          DESC-MENU DELIMITED BY "    " "</span><div>"
003690              DELIMITED BY SIZE INTO DATI-WEB.
003700
003710          PERFORM LINE-WEB        THRU EX-LINE-WEB.
003720
003730
003740 EX-MAKE-ENTITA.
003750          EXIT.
003760
003770
003780
003790 MAKE-FUNZIONE.
003800
003810
003820          IF DISABLED
003830          string
003840          '            <div data-options="disabled:true">'
003850          DESC-MENU DELIMITED BY "     " "</div>"
003860              DELIMITED BY SIZE INTO DATI-WEB
003870          ELSE
003880          STRING
003890          '            <div>'  DELIMITED BY SIZE
003900          DESC-MENU DELIMITED BY "     " "</div>"
003910              DELIMITED BY SIZE INTO DATI-WEB.
003920
003930          IF DISABLED
003940                  MOVE "disabled:true"            to wdisable
003950                  else
003960                  MOVE "disabled:false"           to wdisable.
003970
003980          IF IMG-MENU > ZEROS
003990                  AND IMG-MENU < 20
004000                  MOVE WIMAGE(IMG-MENU)           TO WIMAGES
004010
004020                  else
004030                  MOVE SPACES                     to wIMAGES.
004040
004050          STRING "             " DELIMITED BY SIZE
004060                  '<div data-options="'
004070                  wdisable delimited by  "  "
004080                  wimages delimited by "   "
004090                  '"><a style="text-decoration:none;" href="' DELIMITED BY SIZE
004100                  PROG-MENU DELIMITED BY "   "
004110                  ".exe?MK-KEY=" SECTION-WEB DELIMITED BY SIZE
004120					"&MK-ENTITA=" ENT-MENU DELIMITED BY SIZE 
004130					"&MK-FUNZIONE=" FUNZ-MENU DELIMITED BY SIZE
004140
004150*                 '" onClick="window.location.reload()" class="easyui-menulink">'
004160                  '" class="easyui-menulink">'
004170
004180          DESC-MENU DELIMITED BY "    " "</a></div>"
004190              DELIMITED BY SIZE INTO DATI-WEB.
004200
004210
004220          PERFORM LINE-WEB        THRU EX-LINE-WEB.
004230
004240
004250 EX-MAKE-FUNZIONE.
004260          EXIT.
004270
004280 SESSIONE.
004350
004360          ACCEPT TIME-SECTION-WEB FROM TIME.
004370
004380          ACCEPT DATA-SYS FROM DATE.
004390          MOVE GG-SYS         TO GG-SECTION-WEB.
004400          MOVE MM-SYS         TO MM-SECTION-WEB.
004410          MOVE AA-SYS         TO AA-SECTION-WEB.
004420          ADD 2000            TO AA-SECTION-WEB.
004430
004440          PERFORM CALCOLO-SESSIONE-UTEN THRU EX-CALCOLO-SESSIONE-UTEN.
004450
004460 EX-SESSIONE.
004470			EXIT.
004480
