000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190 IDENTIFICATION   DIVISION.
000200 PROGRAM-ID       OPENORAR.
000210 ENVIRONMENT      DIVISION.
000220 CONFIGURATION    SECTION.
000230 SPECIAL-NAMES.
000240          DECIMAL-POINT IS COMMA.
000250 INPUT-OUTPUT     SECTION.
000260 FILE-CONTROL.
000270
000280          COPY "SELWEB.CBL".
000290          COPY "SELVIEW.CBL".
000300          COPY "SELORA.CBL".
000310		    COPY "SELJSON.CBL".
000320
000330
000340
000350 DATA             DIVISION.
000360 FILE SECTION.
000370
000380          COPY "FDEWEB.CBL".
000390          COPY "FDEVIEW.CBL".
000400          COPY "FDEORA.CBL".
000410		    COPY "FDEJSON.CBL".
000420
000430 WORKING-STORAGE  SECTION.
000440
000450          COPY "COBW3.CBL".
000460          COPY "GLOBALS.CBL".
000470          COPY "IMAGES.CBL".
000480*
000490 PROCEDURE  DIVISION.
000500*
000510          PERFORM INIZIO-WEB   THRU EX-INIZIO-WEB.
000520
000530          PERFORM OPEN-I-ORA  THRU EX-OPEN-I-ORA.
000540
000550          COPY "INIZIALI.CBL".
000560
000570          PERFORM LOAD-VIEW    THRU EX-LOAD-VIEW
000580
000590		    MOVE "TEMPLATE/ORARI.HTM" TO PAGE-WEB.
000600
000610          PERFORM MAKE-WEB     THRU EX-MAKE-WEB.
000620
000630
000640 FINE.
000650          PERFORM CLOSE-VIEW   THRU EX-CLOSE-VIEW.
000660          PERFORM CLOSE-ORA   THRU EX-CLOSE-ORA.
000670
000680          PERFORM FINE-WEB     THRU EX-FINE-WEB.
000690
000700          GOBACK.
000710
000720          COPY "PIOWEB.CBL".
000730          COPY "PIOVIEW.CBL".
000740  	    COPY "PIOJSON.CBL".
000750          COPY "PIOORA.CBL".
000760
000770 LOAD-VIEW.
000780
000790          MOVE SECTION-WEB        TO STRINGA-VIEW.
000800          MOVE "SECTION-WEB"      TO NOME-VIEW
000810          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000820
000830
000840          MOVE "MK-ENTITA"     	TO FIELD-WEB NOME-VIEW.
000850          PERFORM READ-WEB     	THRU EX-READ-WEB
000860          MOVE VALUE-WEB       	TO STRINGA-VIEW
000870          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000880
000890          MOVE "MK-FUNZIONE"   	TO FIELD-WEB NOME-VIEW.
000900          PERFORM READ-WEB     	THRU EX-READ-WEB
000910          MOVE VALUE-WEB       	TO STRINGA-VIEW
000920          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000930
000940
000950          MOVE SPACES             TO STRINGA-VIEW.
000960
000970
000980			STRING 
000990
001000			'<a href="openorar.exe?MK-KEY='
001010			 SECTION-WEB DELIMITED BY SIZE
001020			"&MK-ENTITA=" ENTITA-WEB  DELIMITED BY SIZE
001030			"&MK-FUNZIONE=" FUNZIONE-WEB  DELIMITED BY SIZE
001040			'" class="easyui-linkbutton" data-options="iconCls:'
001050			"'icon-undo'"
001060			'" style="padding:5px 0px;width:25%; margin-left:20px">'
001070			' <span style="font-size:14px;">Indietro</span></a>'  
001080			DELIMITED BY SIZE INTO STRINGA-VIEW.
001090            
001100
001110           MOVE "GOBACK"           TO NOME-VIEW
001120           PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001130
001140
001150			STRING "ORARI" FUNZIONE-WEB 				
001160			DELIMITED BY SIZE INTO  NOME-JSON.
001170
001180			PERFORM OPEN-O-JSON		THRU EX-OPEN-O-JSON.
001190
001200			STRING "/OpenPA/" FILE-JSON 
001210			 DELIMITED BY SIZE INTO STRINGA-VIEW.
001220
001230          MOVE "FILE-JSON"        TO NOME-VIEW
001240          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
001250
001260			MOVE ZEROS				TO CONTA.
001270
001280			PERFORM CONTA-RECORD	THRU EX-CONTA-RECORD.
001290
001300			PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > LENGTH OF CONTA
001310			 OR CONTA(IND:1) > "0"
001320			 CONTINUE
001330			END-PERFORM.
001340
001350			STRING '{"total":' CONTA(IND:) ',"rows":['		
001360			DELIMITED BY SIZE INTO DATI-JSON.
001370			PERFORM SCRITTURA-JSON  THRU EX-SCRITTURA-JSON.
001380
001390			MOVE SPACES				TO DATI-JSON.
001400
001410           MOVE LOW-VALUE          TO CHIAVE-ORA.
001420           PERFORM STARTO-ORA     THRU EX-STARTO-ORA.
001430
001440           if ESITO-NOK GO TO FINE-TABELLA.
001450
001460
001470 CICLO-TABELLA.
001480
001490			PERFORM LEGGO-NEXT-ORA THRU EX-LEGGO-NEXT-ORA.
001500
001510			IF FINE-FILE = "S" GO TO FINE-TABELLA.
001520
001530			IF DATI-JSON > SPACES
001540			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
001550
001560***** ELIMINA EVENTUALI ELEMENTI NOCIVI PER LA JSON
001570
001580			INSPECT ORARIO REPLACING ALL "\" BY " ".			
001590
001600				
001610**** ITEM
001620		
001630			STRING 
001640
001650			'   {"ELEMENTO":"'	DELIMITED BY SIZE
001660			CODICE-ORA   DELIMITED BY "   "
001670			'",'			DELIMITED BY SIZE
001680			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001690
001700**** ITEM
001710			STRING "        "
001720			'"DESC":"'	DELIMITED BY SIZE
001730			DESC-ORA       DELIMITED BY "     "
001740			'",'			DELIMITED BY SIZE
001750			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001760**** ITEM
001770			STRING "        "
001780			'"TIPO":"'	DELIMITED BY SIZE
001790			TIPO-ORA       DELIMITED BY "     "
001800			'",'			DELIMITED BY SIZE
001810			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001820**** ITEM
001830			STRING "        "
001840			'"DESC1":"'	DELIMITED BY SIZE
001850			TESTO-ORA      DELIMITED BY "     "
001860			'",'			DELIMITED BY SIZE
001870			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
001880**** ITEM
001890			STRING "        "
001900			'"' 		
001910			'CANCELLA":"'	DELIMITED BY SIZE
001920			'<a href=opencanc.exe?MK-KEY='
001930			 SECTION-WEB DELIMITED BY SIZE
001940			"&MK-ITEM=" DELIMITED BY SIZE
001950			CHIAVE-ORA
001960			"&MK-FILE=OR" DELIMITED BY SIZE
001970			'>' delimited by size 
001980			"<img src='/openpa/images/cancella.gif' BORDER='0'></a>",
001990				delimited by size 
002000			'",'			DELIMITED BY SIZE
002010			INTO DATI-JSON  PERFORM SCRITTURA-JSON THRU EX-SCRITTURA-JSON.
002020**** ITEM
002030			STRING "        "
002040			'"' 		
002050			'MODIFICA":"'	DELIMITED BY SIZE
002060			'<a href=openmoor.exe?MK-KEY='
002070			 SECTION-WEB DELIMITED BY SIZE
002080			"&MK-ITEM=" DELIMITED BY SIZE
002090			CHIAVE-ORA
002100			'>' delimited by size 
002110			"<img src='/openpa/images/ok.png' BORDER='0'></a>"
002120				delimited by size 
002130          '"},' DELIMITED BY SIZE 
002140			into dati-JSON.
002150
002160
002170			GO TO CICLO-TABELLA.
002180
002190
002200 FINE-TABELLA.
002210
002220			INSPECT DATI-JSON REPLACING all "}, " BY
002230										    "}  ".
002240
002250			PERFORM SCRITTURA-JSON		THRU EX-SCRITTURA-JSON.
002260
002270
002280			MOVE "]}"					TO DATI-JSON.
002290			PERFORM SCRITTURA-JSON  	THRU EX-SCRITTURA-JSON.
002300
002310			CLOSE ARKJSON.
002320
002330
002340 EX-LOAD-VIEW.
002350          EXIT.
002360
002370 CONTA-RECORD.
002380
002390          MOVE LOW-VALUE          TO CHIAVE-ORA.
002400          PERFORM STARTO-ORA     THRU EX-STARTO-ORA.
002410			
002420			IF ESITO-NOK GO TO EX-CONTA-RECORD.
002430
002440 CICLO-CONTA-RECORD.
002450
002460			PERFORM LEGGO-NEXT-ORA THRU EX-LEGGO-NEXT-ORA.
002470
002480			IF FINE-FILE = "S" GO TO EX-CONTA-RECORD.
002490
002500			ADD 1					TO CONTA.
002510
002520			GO TO CICLO-CONTA-RECORD.
002530
002540 EX-CONTA-RECORD.
002550			EXIT.
002560
002570 REPLACE-WEB.
002580
002590          PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB.
002600
002610 EX-REPLACE-WEB.
002620          EXIT.
002630
