000010*
000020* Copyright (C) 2010-2021 Federico Priolo TP ONE SRL federico.priolo@tp-one.it
000030*
000040* This program is free software; you can redistribute it and/or modify
000050* it under the terms of the GNU General Public License as published by
000060* the Free Software Foundation; either version 2, or (at your option)
000070* any later version.
000080*
000090* This program is distributed in the hope that it will be useful,
000100* but WITHOUT ANY WARRANTY; without even the implied warranty of
000110* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000120* GNU General Public License for more details.
000130*
000140* You should have received a copy of the GNU General Public License
000150* along with this software; see the file COPYING.  If not, write to
000160* the Free Software Foundation, 51 Franklin Street, Fifth Floor
000170* Boston, MA 02110-1301 USA
000180*
000190*
000200
000210 IDENTIFICATION   DIVISION.
000220 PROGRAM-ID       OPENPA99.
000230 ENVIRONMENT      DIVISION.
000240 CONFIGURATION    SECTION.
000250
000320			COPY "SPECIAL.CBL".
000321
000330 INPUT-OUTPUT     SECTION.
000340 FILE-CONTROL.
000350
000360          COPY "SELWEB.CBL".
000370	     	COPY "SELVIEW.CBL".
000420			COPY "SELUTEN.CBL".
000430		
000440
000450 DATA             DIVISION.
000460 FILE SECTION.
000470
000480          COPY "FDEWEB.CBL".
000481			COPY "FDEUTEN.CBL".
000490	        COPY "FDEVIEW.CBL".
000540
000550 WORKING-STORAGE  SECTION.
000560
000570          COPY "COBW3.CBL".
000580          COPY "GLOBALS.CBL".
000590			COPY "IMAGES.CBL".
000600*
000610 PROCEDURE  DIVISION.
000620
000630 DECLARATIVES.
000640 ERROR-ARCHIVIO SECTION.
000650			USE AFTER STANDARD ERROR PROCEDURE ON ARKVIEW.
000660 EX-ERRORE-ARCHIVIO.
000670			EXIT.
000680 END DECLARATIVES.
000690
000700*
000710          PERFORM INIZIO-WEB  THRU EX-INIZIO-WEB.
000720
000730 
000740          MOVE "MK-KEY"        TO FIELD-WEB
000750          PERFORM READ-WEB     THRU EX-READ-WEB
000760
000770          MOVE VALUE-WEB       TO SECTION-WEB(1:).
000780
000790			IF SECTION-WEB  = SPACES
000800		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000810			GO TO USCITA.
000820
000830
000870          PERFORM OPEN-IO-VIEW THRU EX-OPEN-IO-VIEW.
000890          PERFORM OPEN-IO-UTEN  THRU EX-OPEN-IO-UTEN.
000891
000900			PERFORM VALIDITA	 THRU EX-VALIDITA.
000910
000920			IF ESITO-NOK
000930		    PERFORM VIS-LOGIN    THRU EX-VIS-LOGIN
000940			GO TO FINE.
000950
000960          MOVE "UTENTE"        TO NOME-VIEW
000970          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
000980
000990          MOVE STRINGA-VIEW    TO NOME-UTEN.
001000          PERFORM LETTURA-UTEN THRU EX-LETTURA-UTEN.
001010          
001020           IF ESITO-NOK
001030            STRING "SESSIONE SCADUTA O UTENTE NON LOGGATO:" CHIAVE-UTEN
001040			  DELIMITED BY SIZE INTO MESSAGGIO
001050            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
001060           GO TO FINE.
001070
001091			perform CANCELLO-VIEW THRU EX-CANCELLO-VIEW
001092
001094          STRING "SESSIONE TERMINATA - UTENTE  " NOME-UTEN 
001104			" DISCONNESSO "  DELIMITED BY SIZE INTO MESSAGGIO
001114
001115			MOVE ZEROS 			TO MINUTI-SCA-UTEN
001116
001117			PERFORM AGGIORNO-UTEN THRU EX-AGGIORNO-UTEN.
001118
001119			MOVE MESSAGGIO      TO VALUE-WEB.
001120			MOVE "MK-MESSAGE"   TO FIELD-WEB.
001121			PERFORM METTI-WEB   THRU EX-METTI-WEB.
001122
001123			MOVE "DISCONNESSIONE UTENTE"	TO VALUE-WEB.
001124			MOVE "MK-TITLE"     TO FIELD-WEB.
001125			PERFORM METTI-WEB   THRU EX-METTI-WEB.
001126
001127
001134			MOVE "TEMPLATE/LOGOUT.HTM"  TO PAGE-WEB.
001135			PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001136
001140 FINE.
001141		
001150			PERFORM CLOSE-VIEW	THRU EX-CLOSE-VIEW.
001151
001153			CALL "CBL_DELETE_FILE" USING FILE-VIEW.
001154
001160			PERFORM CLOSE-UTEN	THRU EX-CLOSE-UTEN.
001161          
001210
001211 USCITA.
001220
001230	        PERFORM FINE-WEB     THRU EX-FINE-WEB.
001240
001250          GOBACK.
001251
001260			COPY "PIOUTEN.CBL".
001270	    	COPY "PIOWEB.CBL".
001280         	COPY "PIOVIEW.CBL".
001550
001640 
001650
001660 REPLACE-WEB.
001670
001780 EX-REPLACE-WEB.
001790          EXIT.
001800
