000010*
000020* CAMPI DI WORKING COMUNI ALLA MAGGIOR PARTE
000030* DEI PROGRAMMI
000040*
000050  01 MESSAGGIO         PIC X(256).
000060  01 TITOLO            PIC X(256).
000070  01 COMANDO-RUN       PIC X(200).
000080  01 FINESTRA-RUN      PIC S9(4) COMP-5.
000090  01 TIPO-RUN          PIC S9(4) COMP-5.
000100  01 RITORNO-RUN       PIC s9(9) COMP-5.
000110  01 SW-LAVORO		 PIC X(20) VALUE SPACES.
000120  01 VIS-DATA          GLOBAL.
000130    02 GG-VIS          PIC 99.
000140    02 MM-VIS          PIC 99.
000150    02 AA-VIS          PIC 9999.
000160  01 CONTA			 PIC 9(9)  VALUE ZEROS.
000170  01 SW-DATA           PIC 9      VALUE ZEROS GLOBAL.
000180  01 ANNO-ESTESO       PIC 9(4)   VALUE ZEROS GLOBAL.
000190  01 MESE-RIFERIMENTO  PIC 99     GLOBAL.
000200      88 MESE-RIFERIMENTO-OK VALUE 1 THRU 12.
000210
000220*
000230  01 DATA-NORMALE GLOBAL.
000240     05 GG-NORMALE     PIC 99.
000250     05 MM-NORMALE     PIC 99.
000260     05 AA-NORMALE     PIC 9999.
000270
000280  01 GIORNO-NORMALE    PIC 9 GLOBAL.
000290       88 FERIALE      VALUE 1 THRU 6.
000300       88 SABATO       VALUE 6.
000310       88 DOMENICA     VALUE 7.
000320
000330  01 DATA-GIRATA GLOBAL.
000340     02 AA-GIRATA      PIC 9999.
000350     02 MM-GIRATA      PIC 99.
000360     02 GG-GIRATA      PIC 99.
000370
000380  01 TIME-SYS GLOBAL.
000390     05 ORA-SYS        PIC 99.
000400     05 MIN-SYS        PIC 99.
000410     05 SEC-SYS        PIC 99.
000420     05 MIC-SYS        PIC 99.
000430
000440  01 DATA-SYS GLOBAL.
000450     05 AA-SYS         PIC 99.
000460     05 MM-SYS         PIC 99.
000470     05 GG-SYS         PIC 99.
000480
000490  01 VIS-ORA GLOBAL.
000500     05 VIS-H          PIC Z9.
000510     05 FILLER         PIC X VALUE ":".
000520     05 VIS-M          PIC 99.
000530
000540
000550  01 CARICA-TABELLA-SETTIMANA IS GLOBAL.
000560          02 FILLER  PIC X(09) VALUE "LUNEDI".
000570          02 FILLER  PIC X(09) VALUE "MARTEDI".
000580          02 FILLER  PIC X(09) VALUE "MERCOLEDI".
000590          02 FILLER  PIC X(09) VALUE "GIOVEDI".
000600          02 FILLER  PIC X(09) VALUE "VENERDI".
000610          02 FILLER  PIC X(09) VALUE "SABATO".
000620          02 FILLER  PIC X(09) VALUE "DOMENICA".
000630
000640  01 TABELLA-SETTIMANA REDEFINES CARICA-TABELLA-SETTIMANA
000650                       IS GLOBAL.
000660          02 GIORNO-SETTIMANA PIC X(09) OCCURS 7 TIMES.
000670
000680  01 CARICA-TABELLA-MESI IS GLOBAL.
000690          02      FILLER  PIC X(11) VALUE "GENNAIO  31".
000700          02      FILLER  PIC X(11) VALUE "FEBBRAIO 28".
000710          02      FILLER  PIC X(11) VALUE "MARZO    31".
000720          02      FILLER  PIC X(11) VALUE "APRILE   30".
000730          02      FILLER  PIC X(11) VALUE "MAGGIO   31".
000740          02      FILLER  PIC X(11) VALUE "GIUGNO   30".
000750          02      FILLER  PIC X(11) VALUE "LUGLIO   31".
000760          02      FILLER  PIC X(11) VALUE "AGOSTO   31".
000770          02      FILLER  PIC X(11) VALUE "SETTEMBRE30".
000780          02      FILLER  PIC X(11) VALUE "OTTOBRE  31".
000790          02      FILLER  PIC X(11) VALUE "NOVEMBRE 30".
000800          02      FILLER  PIC X(11) VALUE "DICEMBRE 31".
000810
000820  01 TABELLA-MESI REDEFINES CARICA-TABELLA-MESI
000830                       IS GLOBAL.
000840          02      LIVELLO-MESI     OCCURS 12 TIMES.
000850           05     MESE-IN-CORSO    PIC X(09).
000860           05     NUM-GG-MESE      PIC 99.
000870  01 GIORNO-SETT                   PIC 9 IS GLOBAL.
000880
000890
000900  01 TAB-STRINGA                   PIC X(18) IS GLOBAL.
000910  01 TAB-NUMERO                    PIC S9(18) IS GLOBAL.
000920  01 NUMERO                        PIC S9(18) IS GLOBAL.
000930
000940  01 DA                            PIC 999999.
000950  01 A                             PIC 999999.
000960  01 TEMPO                         PIC 99.
000970
000980  01 PARAMETRI-TRASCOD IS GLOBAL.
000990    02 NUMERO-TRASCOD              PIC 9(12).
001000    02 CIFRA-TRASCOD               PIC X(100).
001010
001020  01 W-TABELLA-ORARI IS GLOBAL.
001030     02 ORARIO-INI.
001040       09 ORA-INI                  PIC 99.
001050       09 MIN-INI                  PIC 99.
001060     02 ORE-INI REDEFINES ORARIO-INI PIC 9(4).
001070     02 ORARIO-FIN.
001080       09 ORA-FIN                  PIC 99.
001090       09 MIN-FIN                  PIC 99.
001100     02 ORE-FIN REDEFINES ORARIO-FIN PIC 9(4).
001110     02 ORARIO-DUR.
001120       09 ORA-DUR                  PIC 99.
001130       09 MIN-DUR                  PIC 99.
001140     02 ORE-DUR REDEFINES ORARIO-DUR PIC 9(4).
001150     02 ORARIO-TOT.
001160       09 ORA-TOT                  PIC 9999.
001170       09 MIN-TOT                  PIC 99.
001180     02 ORE-TOT REDEFINES ORARIO-TOT PIC 9(6).
001190
001200     02 W-INIZIO                   PIC S9(9) COMP-5.
001210     02 W-FINE                     PIC S9(9) COMP-5.
001220     02 W-DURATA                   PIC S9(9) COMP-5.
001230
001240*
001250* campo di appoggio chiamata liste file tabelle
001260*
001270 01 DATI-GLOBALI IS GLOBAL.
001280*
001290
001300    07 LOCK-STATUS     	PIC XX    VALUE "99".
001310
001320    07 ANNO-FILE.
001330      08 PRIMA-CIFRA   	PIC 9.
001340      08 ANNO-EST      	PIC 999.
001350
001360   07 FINE-FILE        	PIC XX    VALUE ALL SPACES.
001370   07 ESITO            	PIC XX    VALUE ALL SPACES.
001380    88 ESITO-OK        	VALUE "SI".
001390    88 ESITO-NOK       	VALUE "NO".
001400
001410
001420   07 FLAG-WEB         	PIC X.
001430    88 OPENED-WEB      	VALUE "O".
001440
001450   07 EOF-WEB          	PIC X.
001460    88 EOF-FILE-WEB    	VALUE "Y".
001470
001480   07 ON-OFF-WEB       	PIC X.
001490    88 ON-WEB          	VALUE "Y".
001500    88 OFF-WEB         	VALUE "N".
001510
001520
001530
001540
001550   07 FILE-LIB         	PIC X(256) VALUE SPACE.
001560   07 STATUS-LIB       	PIC XX.
001570
001580
001590   07 FLAG-LIB         	PIC X.
001600    88 OPENED-LIB      	VALUE "O".
001610
001620   07 EOF-LIB          	PIC X.
001630    88 EOF-FILE-LIB    	VALUE "Y".
001640
001650   07 ON-OFF-LIB       	PIC X.
001660    88 ON-LIB          	VALUE "Y".
001670    88 OFF-LIB         	VALUE "N".
001680
001690   07 BUFFER            	PIC X(2048).
001700   07 BUFFER1           	PIC X(2048).
001710
001720   07 FILE-WEB          	PIC X(256) VALUE SPACE.
001730   07 STATUS-WEB        	PIC XX.
001740   07 PAGE-WEB          	PIC X(256) VALUE SPACE.
001750   07 FIELD-WEB         	PIC X(30)  VALUE SPACE.
001760   07 INDEX-WEB         	PIC 9(9)   VALUE ZEROS.
001770   07 VALUE-WEB         	PIC X(1024) VALUE SPACE.
001780   07 LIBRERIA-WEB      	PIC X(256)  VALUE SPACE.
001790   07 PROGRAMMA-WEB     	PIC X(256)  VALUE SPACE.
001800   07 RITORNO-WEB       	PIC S9(4)   COMP-5.
001810   07 SECTION-WEB.
001820    09 DATA-SECTION-WEB.
001830     12 AA-SECTION-WEB  	PIC 9999.
001840     12 MM-SECTION-WEB  	PIC 99.
001850     12 GG-SECTION-WEB  	PIC 99.
001860    09 TIME-SECTION-WEB.
001870     12 ORE-SECTION-WEB 	PIC 99.
001880     12 MIN-SECTION-WEB 	PIC 99.
001890     12 SEC-SECTION-WEB 	PIC 9999.
001900   07 ENTITA-WEB        	PIC XX.
001901   07 FUNZIONE-WEB      	PIC XX.
001910
001920   07 SECTION-NOW.
001930    09 DATA-SECTION-NOW.
001940     12 AA-SECTION-NOW 	PIC 9999.
001950     12 MM-SECTION-NOW 	PIC 99.
001960     12 GG-SECTION-NOW 	PIC 99.
001970    09 TIME-SECTION-NOW.
001980     12 ORE-SECTION-NOW 	PIC 99.
001990     12 MIN-SECTION-NOW 	PIC 99.
002000     12 SEC-SECTION-NOW 	PIC 9999.
002010
002020
002030   07 ORARIO-WEB.
002040
002050    08 DATA-WEB.
002060     09 AA-WEB         	PIC 9999.
002070     09 MM-WEB         	PIC 99.
002080     09 GG-WEB         	PIC 99.
002090    08 MINUTI-WEB      	PIC 9(9).
002100
002110   07 NUMERO-WEB       	PIC 9(18).
002120   07 IMPORTO-WEB      	PIC S9(12)V99.
002130   07 TAB-NUMERO-WEB   	PIC 9(18).
002170
002180   07 PASSWORD-WEB     	PIC X(100)  VALUE SPACE.
002190   07 IND-WEB          	PIC 9(9)    VALUE ZERO.
002200   07 IND1-WEB         	PIC 9(9)    VALUE ZERO.
002140   07 IND2-WEB         	PIC 9(9)    VALUE ZERO.
002150   07 IND3-WEB         	PIC 9(9)    VALUE ZERO.
002160   07 IND4-WEB         	PIC 9(9)    VALUE ZERO.
         07 SIZE-WEB            PIC 9(9)    VALUE ZERO.

002210   07 IND-LIB          	PIC 99999   VALUE ZERO.
002220   07 IND1-LIB         	PIC 99999   VALUE ZERO.
002230   07 FILE-UTEN        	PIC X(256)  VALUE SPACE.
002240   07 STATUS-UTEN      	PIC XX      VALUE "00".
002250   07 FILE-VIEW        	PIC X(256)  VALUE SPACE.
002260   07 STATUS-VIEW      	PIC XX      VALUE "00".
002270   07 FILE-TAB         	PIC X(256)  VALUE SPACE.
002280   07 STATUS-TAB       	PIC XX      VALUE "00".
002290   07 FILE-MENU        	PIC X(256)  VALUE SPACE.
002300   07 STATUS-MENU      	PIC XX      VALUE "00".
002310   07 FILE-ABI         	PIC X(256)  VALUE SPACE.
002320   07 STATUS-ABI       	PIC XX      VALUE "00".
002330   07 FILE-PROF        	PIC X(256)  VALUE SPACE.
002340   07 STATUS-PROF      	PIC XX      VALUE "00".
002350   07 FILE-PRES        	PIC X(256)  VALUE SPACE.
002360   07 STATUS-PRES      	PIC XX      VALUE "00".
002370   07 FILE-ORIG        	PIC X(256)  VALUE SPACE.
002380   07 STATUS-ORIG      	PIC XX      VALUE "00".
002390   07 FILE-CAUS        	PIC X(256)  VALUE SPACE.
002400   07 STATUS-CAUS      	PIC XX      VALUE "00".
002410   07 FILE-CART        	PIC X(256)  VALUE SPACE.
002420   07 STATUS-CART      	PIC XX      VALUE "00".
002430   07 FILE-CALC        	PIC X(256)  VALUE SPACE.
002440   07 STATUS-CALC      	PIC XX      VALUE "00".
002450   07 FILE-ELAB        	PIC X(256)  VALUE SPACE.
002460   07 STATUS-ELAB      	PIC XX      VALUE "00".
002470   07 FILE-MESE        	PIC X(256)  VALUE SPACE.
002480   07 STATUS-MESE      	PIC XX      VALUE "00".
002490   07 FILE-ANNO        	PIC X(256)  VALUE SPACE.
002500   07 STATUS-ANNO      	PIC XX      VALUE "00".
002510   07 FILE-JSON        	PIC X(256)  VALUE SPACE.
002511   07 STATUS-JSON      	PIC XX      VALUE "00".
002512   07 NOME-JSON        	PIC X(08)   VALUE SPACES.
002520   07 FILE-DATO        	PIC X(256)  VALUE SPACE.
002521   07 STATUS-DATO      	PIC XX      VALUE "00".
002520   07 FILE-ORA        	PIC X(256)  VALUE SPACE.
002521   07 STATUS-ORA      	PIC XX      VALUE "00".
002522
002530***** CAMPI GENERICI
002540   77 IND              	PIC 9(9)    VALUE ZERO.
002550   77 DUMMY            	PIC X       VALUE SPACE.
002560
002570
002580
002590
002600   77 REC-DAT          	PIC X(512).
002610   77 SIZE-DAT         	PIC 9999.
002620
002630   77 DEP-MOD          	PIC XX.
002640   77 FLAG-TIME        	PIC X.
002650      88 FIRST-TIME    	VALUE "Y".
002660   77 FLAG-DISABLED    	PIC X.
002670      88 DISABLED      	VALUE "Y".
002680
002690   77 WDISABLE         	PIC X(100).
002700   77 WIMAGES          	PIC X(100).
002710
002720
