000010*
000011***** OPERAZIONI INIZIALI COMUNI A TUTTI I PROGRAMMI
000012*
000030
000040
000050
000060          MOVE "MK-KEY"        	TO FIELD-WEB
000070          PERFORM READ-WEB     	THRU EX-READ-WEB
000080          MOVE VALUE-WEB       	TO SECTION-WEB(1:)
000081
000100          PERFORM OPEN-IO-VIEW 	THRU EX-OPEN-IO-VIEW.
000102
000103
000104          MOVE SECTION-WEB      	TO STRINGA-VIEW.
000105          MOVE "SECTION-WEB"    	TO NOME-VIEW
000106          PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000107
000110
000120          PERFORM VALIDITA     THRU EX-VALIDITA.
000130
000140          IF ESITO-NOK
000150            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
000160		      GO TO FINE.
000170
000180
000190          MOVE "MK-ENTITA"        TO FIELD-WEB            
000200          PERFORM READ-WEB        THRU EX-READ-WEB
000210          
000220***** se non c'e il campo ENTITA allora e' nel file di sessione
000230
000240          IF COBW3-SEARCH-FLAG-NON
000250            MOVE "MK-ENTITA"      TO NOME-VIEW
000260            PERFORM LEGGO-VIEW    THRU EX-LEGGO-VIEW
000270            MOVE STRINGA-VIEW     TO ENTITA-WEB
000280          ELSE
000290            MOVE VALUE-WEB        TO ENTITA-WEB
000292            MOVE "MK-ENTITA"     	TO NOME-VIEW
000294            MOVE VALUE-WEB       	TO STRINGA-VIEW 
000295            PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000303
000310          MOVE "MK-FUNZIONE"      TO FIELD-WEB            
000320          PERFORM READ-WEB        THRU EX-READ-WEB
000330          
000340***** se non c'e il campo FUNZIONE allora e' nel file di sessione
000350
000360          IF COBW3-SEARCH-FLAG-NON
000370           MOVE "MK-FUNZIONE" 	TO NOME-VIEW
000380           PERFORM LEGGO-VIEW     THRU EX-LEGGO-VIEW
000390           MOVE STRINGA-VIEW      TO FUNZIONE-WEB
000400          ELSE
000410            MOVE VALUE-WEB        TO FUNZIONE-WEB
000412            MOVE "MK-FUNZIONE"    TO NOME-VIEW
000413            MOVE VALUE-WEB       	TO STRINGA-VIEW 
000414            PERFORM SCRITTURA-VIEW  THRU EX-SCRITTURA-VIEW.
000473
000474
000475
000480
