000120
000130
000140
000150
000160
000170          MOVE "MK-KEY"        TO FIELD-WEB
000180          PERFORM READ-WEB     THRU EX-READ-WEB
000190          MOVE VALUE-WEB       TO SECTION-WEB(1:)
000200
000210          PERFORM OPEN-IO-VIEW THRU EX-OPEN-IO-VIEW.
000220
000230          PERFORM VALIDITA     THRU EX-VALIDITA.
000240
000250          IF ESITO-NOK
000260            PERFORM VIS-LOGIN  THRU EX-VIS-LOGIN
000270		      GO TO FINE.

                MOVE "MK-ENTITA"   	 TO NOME-VIEW
000612          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
                MOVE STRINGA-VIEW    TO ENTITA-WEB.
                
                MOVE "MK-FUNZIONE" 	 TO NOME-VIEW
000612          PERFORM LEGGO-VIEW   THRU EX-LEGGO-VIEW.
                MOVE STRINGA-VIEW    TO FUNZIONE-WEB.
                

