000010*
000020* OPERAZIONI DI I-O SU ARCHIVIO DATO
000030*
000040  OPEN-I-DATO.
000041
000050          PERFORM PREPARA-DATO THRU EX-PREPARA-DATO.
000051
000060          OPEN INPUT ARKDATO.
000070          IF STATUS-DATO NOT = ZEROS
000080           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO
000090           CLOSE ARKDATO
000100           GO TO OPEN-I-DATO.
000110
000120  EX-OPEN-I-DATO.
000130          EXIT.
000140*
000150***
000160*
000170  OPEN-IO-DATO.
000180
000181          PERFORM PREPARA-DATO THRU EX-PREPARA-DATO.
000182
000190          OPEN I-O ARKDATO.
000200          IF STATUS-DATO NOT = ZEROS
000210           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO
000220           CLOSE ARKDATO
000230           GO TO OPEN-IO-DATO.
000240
000250  EX-OPEN-IO-DATO.
000260          EXIT.
000270*
000280  STARTO-COBOL-DATO.
000290          MOVE "SI"       TO ESITO.
000300          START ARKDATO KEY IS NOT < NOME-COBOL-DATO
000310           INVALID KEY
000320           MOVE "NO"      TO ESITO.
000330          IF STATUS-DATO(1:1) > "2"
000340           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
000350  EX-STARTO-COBOL-DATO.
000360          EXIT.
000370
000380*
000390***
000400*
000410  STARTO-DATO.
000420          MOVE "SI"       TO ESITO.
000430          START ARKDATO KEY IS NOT < CHIAVE-DATO
000440           INVALID KEY
000450           MOVE "NO"      TO ESITO.
000460          IF STATUS-DATO(1:1) > "2"
000470           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
000480  EX-STARTO-DATO.
000490          EXIT.
000500
000510*
000520***
000530*
000540  LEGGO-NEXT-DATO.
000550          MOVE         "N"        TO FINE-FILE.
000560          READ ARKDATO NEXT RECORD NO LOCK
000570           AT END MOVE "S"        TO FINE-FILE.
000580          IF STATUS-DATO(1:1) > "2"
000590           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
000600  EX-LEGGO-NEXT-DATO.
000610          EXIT.
000620*
000630***
000640*
000650  LEGGO-DATO.
000660          MOVE "SI"       TO ESITO.
000670          READ ARKDATO KEY IS CHIAVE-DATO
000680           INVALID KEY
000690          MOVE "NO"       TO ESITO.
000700
000710          IF STATUS-DATO = LOCK-STATUS
000720           MOVE "Record in uso presso altro terminale"
000730            TO MESSAGGIO
000740            PERFORM VIS-MESS     THRU EX-VIS-MESS
000750             GO TO LEGGO-DATO.
000760
000770          IF STATUS-DATO(1:1) > "2"
000780           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
000790  EX-LEGGO-DATO.
000800          EXIT.
000810
000820  LEGGO-COBOL-DATO.
000830          MOVE "SI"       TO ESITO.
000840          READ ARKDATO KEY IS NOME-COBOL-DATO
000850           INVALID KEY
000860          MOVE "NO"       TO ESITO.
000870
000880          IF STATUS-DATO = LOCK-STATUS
000890           MOVE "Record in uso presso altro terminale"
000900            TO MESSAGGIO
000910            PERFORM VIS-MESS     THRU EX-VIS-MESS
000920             GO TO LEGGO-COBOL-DATO.
000930
000940          IF STATUS-DATO(1:1) > "2"
000950           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
000960
000970  EX-LEGGO-COBOL-DATO.
000980          EXIT.
000990
001000***
001010*
001020  SCRIVO-DATO.
001030
001040          MOVE "SI"       TO ESITO.
001050          WRITE DATO
001060          INVALID KEY
001070          MOVE "NO"       TO ESITO.
001080
001090          IF STATUS-DATO(1:1) > "2"
001100           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
001110
001120  EX-SCRIVO-DATO.
001130          EXIT.
001140*
001150***
001160*
001170  AGGIORNO-DATO.
001180
001190          MOVE "SI"       TO ESITO.
001200          REWRITE DATO
001210           INVALID KEY
001220           MOVE "NO"      TO ESITO.
001230
001240          IF STATUS-DATO(1:1) > "2"
001250           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
001260
001270  EX-AGGIORNO-DATO.
001280          EXIT.
001290*
001300***
001310*
001320  CANCELLO-DATO.
001330
001340          MOVE "SI"       TO ESITO.
001350          DELETE ARKDATO
001360           INVALID KEY
001370           MOVE "NO"      TO ESITO.
001380
001390          IF STATUS-DATO(1:1) > "2"
001400           PERFORM ERRORE-DATO THRU EX-ERRORE-DATO.
001410
001420  EX-CANCELLO-DATO.
001430          EXIT.
001440
001450  ERRORE-DATO.
001460
001503          STRING "ERRORE SU " DELIMITED BY SIZE
001504          FILE-DATO DELIMITED BY "   "
001505          " STATO:" STATUS-DATO
001506          DELIMITED BY  SIZE INTO MESSAGGIO
001507          PERFORM VIS-MESS        THRU EX-VIS-MESS.
001511
001512  EX-ERRORE-DATO.
001520          EXIT.
001530
001540  CLOSE-DATO.
001541
001542			CLOSE ARKDATO.
001543
001544  EX-CLOSE-DATO.
001545			EXIT.
001550  PREPARA-DATO.
001560
001570          MOVE "FILES/ARKDATO"  TO FILE-DATO.
001580
001590  EX-PREPARA-DATO.
001600          EXIT.
