000010*
000020  OPEN-I-ORA.
000030
000040          PERFORM PREPARA-ORA THRU EX-PREPARA-ORA.
000050
000060          MOVE ZEROS      TO STATUS-ORA.
000070
000080          OPEN INPUT ARKORA.
000090
000100          IF STATUS-ORA = "35" OR "39"
000110           OPEN OUTPUT ARKORA
000120           PERFORM INIZIALIZZA-ORA  THRU EX-INIZIALIZZA-ORA
000130           CLOSE ARKORA
000140
000150            GO TO OPEN-I-ORA.
000160
000170          IF STATUS-ORA NOT = ZEROS
000180           PERFORM ERRORE-ORA THRU EX-ERRORE-ORA
000190           CLOSE ARKORA.
000200
000210          INITIALIZE ORARIO.
000220
000230  EX-OPEN-I-ORA.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-ORA.
000290
000300          PERFORM PREPARA-ORA THRU EX-PREPARA-ORA.
000310
000320          MOVE ZEROS      TO STATUS-ORA.
000330
000340          OPEN I-O ARKORA.
000350
000360          IF STATUS-ORA = "35" OR "39"
000370           OPEN OUTPUT ARKORA
000380           PERFORM INIZIALIZZA-ORA  THRU EX-INIZIALIZZA-ORA
000390           CLOSE ARKORA
000400            GO TO OPEN-IO-ORA.
000410
000420          IF STATUS-ORA NOT = ZEROS
000430           PERFORM ERRORE-ORA THRU EX-ERRORE-ORA
000440           CLOSE ARKORA.
000450
000460           INITIALIZE ORARIO.
000470
000480  EX-OPEN-IO-ORA.
000490          EXIT.
000500*
000510  ERRORE-ORA.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-ORA DELIMITED BY "   "
000550          " STATO:" STATUS-ORA
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-ORA.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-ORA.
000660          MOVE "SI"       TO ESITO.
000670          START ARKORA KEY IS NOT < CHIAVE-ORA
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-ORA.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-ORA.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKORA NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-ORA.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-ORA.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKORA KEY IS CHIAVE-ORA
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-ORA = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-ORA.
000980
000990  EX-LEGGO-ORA.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-ORA.
001050
001060          perform FISSE-ORA THRU EX-FISSE-ORA.
001070
001080          MOVE "SI"       TO ESITO.
001090          WRITE ORARIO
001100           INVALID KEY
001110           MOVE "NO"      TO ESITO.
001120
001130          IF STATUS-ORA(1:1) > "2"
001140           PERFORM ERRORE-ORA THRU EX-ERRORE-ORA.
001150  EX-SCRIVO-ORA.
001160          EXIT.
001170*
001180***
001190*
001200  AGGIORNO-ORA.
001210
001220          perform FISSE-ORA THRU EX-FISSE-ORA.
001230
001240          MOVE "SI"       TO ESITO.
001250          REWRITE ORARIO
001260           INVALID KEY
001270           MOVE "NO"      TO ESITO.
001280
001290          IF STATUS-ORA(1:1) > "2"
001300           PERFORM ERRORE-ORA THRU EX-ERRORE-ORA.
001310
001320  EX-AGGIORNO-ORA.
001330          EXIT.
001340*
001350***
001360*
001370  CANCELLO-ORA.
001380          MOVE "SI"       TO ESITO.
001390          DELETE ARKORA
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-ORA(1:1) > "2"
001440           PERFORM ERRORE-ORA THRU EX-ERRORE-ORA.
001450
001460  EX-CANCELLO-ORA.
001470          EXIT.
001480
001490  CLOSE-ORA.
001500          CLOSE ARKORA.
001510  EX-CLOSE-ORA.
001520          EXIT.
001530
001540  INIZIALIZZA-ORA.
001550
001560           INITIALIZE ORARIO.
001580
001590           MOVE "ORARIO NORMALE"  TO DESC-ORA.
001600           MOVE 1                 TO CODICE-ORA.
001610           MOVE "C"               TO TIPO-ORA.
001611
001620
001630           WRITE ORARIO.
001640
001641           MOVE "RIPOSO"          TO DESC-ORA.
001642           MOVE 99                TO CODICE-ORA.
001643           MOVE "C"               TO TIPO-ORA.
001644
001645           WRITE ORARIO.
001646
001647
001650  EX-INIZIALIZZA-ORA.
001660          EXIT.
001670
001680  PREPARA-ORA.
001690
001700          MOVE "FILES/ARKORA"  TO FILE-ORA.
001710
001720  EX-PREPARA-ORA.
001730          EXIT.
001740
001750  FISSE-ORA.
001760
001770
001780  EX-FISSE-ORA.
001790
001800          EXIT.
001810
