000010*
000020  OPEN-I-TAB.
000030
000040          PERFORM PREPARA-TAB THRU EX-PREPARA-TAB.
000050
000060          MOVE ZEROS      TO STATUS-TAB.
000070
000080          OPEN INPUT ARKTAB.
000090
000100          IF STATUS-TAB = "35"
000110           OPEN OUTPUT ARKTAB
000120           PERFORM INIZIALIZZA-TAB  THRU EX-INIZIALIZZA-TAB
000130           CLOSE ARKTAB
000140
000150            GO TO OPEN-I-TAB.
000160
000170          IF STATUS-TAB NOT = ZEROS
000180           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB
000190           CLOSE ARKTAB.
000200
000210          INITIALIZE TABELLA.
000220
000230  EX-OPEN-I-TAB.
000240          EXIT.
000250*
000260***
000270*
000280  OPEN-IO-TAB.
000290
000300          PERFORM PREPARA-TAB THRU EX-PREPARA-TAB.
000310
000320          MOVE ZEROS      TO STATUS-TAB.
000330
000340          OPEN I-O ARKTAB.
000350
000360          IF STATUS-TAB = "35"
000370           OPEN OUTPUT ARKTAB
000380           PERFORM INIZIALIZZA-TAB  THRU EX-INIZIALIZZA-TAB
000390           CLOSE ARKTAB
000400            GO TO OPEN-IO-TAB.
000410
000420          IF STATUS-TAB NOT = ZEROS
000430           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB
000440           CLOSE ARKTAB.
000450
000460           INITIALIZE TABELLA.
000470
000480  EX-OPEN-IO-TAB.
000490          EXIT.
000500*
000510  ERRORE-TAB.
000520
000530          STRING "ERRORE SU " DELIMITED BY SIZE
000540          FILE-TAB DELIMITED BY "   "
000550          " STATO:" STATUS-TAB
000560          DELIMITED BY  SIZE INTO MESSAGGIO
000570          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000580
000590  EX-ERRORE-TAB.
000600          EXIT.
000610
000620*
000630***
000640*
000650  STARTO-TAB.
000660          MOVE "SI"       TO ESITO.
000670          START ARKTAB KEY IS NOT < CHIAVE-TAB
000680           INVALID KEY
000690           MOVE "NO"      TO ESITO.
000700  EX-STARTO-TAB.
000710          EXIT.
000720*
000730***
000740*
000750***
000760*
000770  LEGGO-NEXT-TAB.
000780          MOVE         "N"     TO FINE-FILE.
000790          READ ARKTAB NEXT RECORD  NO LOCK
000800           AT END MOVE "S"     TO FINE-FILE.
000810  EX-LEGGO-NEXT-TAB.
000820          EXIT.
000830*
000840***
000850*
000860  LEGGO-TAB.
000870
000880          MOVE "SI"       TO ESITO.
000890          READ ARKTAB KEY IS CHIAVE-TAB
000900           INVALID KEY
000910           MOVE "NO"      TO ESITO.
000920
000930          IF STATUS-TAB = LOCK-STATUS
000940           MOVE "Record in uso presso altro terminale"
000950            TO MESSAGGIO
000960            PERFORM VIS-MESS     THRU EX-VIS-MESS
000970             GO TO LEGGO-TAB.
000980
000990  EX-LEGGO-TAB.
001000          EXIT.
001010
001020***
001030*
001040  SCRIVO-TAB.
001050
001060          MOVE "SI"       TO ESITO.
001070          WRITE TABELLA
001080           INVALID KEY
001090           MOVE "NO"      TO ESITO.
001100
001110          IF STATUS-TAB(1:1) > "2"
001120           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB.
001130  EX-SCRIVO-TAB.
001140          EXIT.
001150*
001160***
001170*
001180  AGGIORNO-TAB.
001190          MOVE "SI"       TO ESITO.
001200          REWRITE TABELLA
001210           INVALID KEY
001220           MOVE "NO"      TO ESITO.
001230
001240          IF STATUS-TAB(1:1) > "2"
001250           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB.
001260
001270  EX-AGGIORNO-TAB.
001280          EXIT.
001290*
001300***
001310*
001320  CANCELLO-TAB.
001330          MOVE "SI"       TO ESITO.
001340          DELETE ARKTAB
001350           INVALID KEY
001360           MOVE "NO"      TO ESITO.
001370
001380          IF STATUS-TAB(1:1) > "2"
001390           PERFORM ERRORE-TAB THRU EX-ERRORE-TAB.
001400
001410  EX-CANCELLO-TAB.
001420          EXIT.
001430
001440  CLOSE-TAB.
001450          CLOSE ARKTAB.
001460  EX-CLOSE-TAB.
001470          EXIT.
001480
001490  INIZIALIZZA-TAB.
001500
001510           INITIALIZE TABELLA-001
001520
001530           MOVE 01    TO ENTE-TAB
001540           MOVE "01"  TO TIPO-TAB
001550           MOVE 1     TO PROG-TAB.
001560
001570           MOVE "ENTE DIMOSTRATIVO" TO DESC-ENTE-001.
001580
001590           WRITE TABELLA.
001600
001610  EX-INIZIALIZZA-TAB.
001620          EXIT.
001630
001640  PREPARA-TAB.
001650
001660          MOVE "FILES/ARKTAB"  TO FILE-TAB.
001670  EX-PREPARA-TAB.
001680          EXIT.
