000010  OPEN-O-VIEW.
000020
000030          PERFORM PREPARA-VIEW THRU EX-PREPARA-VIEW.
000040
000050          MOVE ZEROS      TO STATUS-VIEW.
000060
000070          OPEN OUTPUT ARKVIEW
000080
000090          IF STATUS-VIEW NOT = ZEROS
000100           PERFORM ERRORE-VIEW THRU EX-ERRORE-VIEW
000110           CLOSE ARKVIEW.
000120
000130          CLOSE ARKVIEW.
000140
000150          OPEN I-O ARKVIEW.
000160
000170          INITIALIZE VIEW.
000180
000190  EX-OPEN-O-VIEW.
000200          EXIT.
000210
000220
000230*
000240  OPEN-I-VIEW.
000250
000260          PERFORM PREPARA-VIEW THRU EX-PREPARA-VIEW.
000270
000280          MOVE ZEROS      TO STATUS-VIEW.
000290
000300          OPEN INPUT ARKVIEW.
000310
000320          IF STATUS-VIEW = "35"
000330           OPEN OUTPUT ARKVIEW
000340           CLOSE ARKVIEW
000350            GO TO OPEN-I-VIEW.
000360
000370          IF STATUS-VIEW NOT = ZEROS
000380           PERFORM ERRORE-VIEW THRU EX-ERRORE-VIEW
000390           CLOSE ARKVIEW.
000400
000410  EX-OPEN-I-VIEW.
000420          EXIT.
000430*
000440***
000450*
000460  OPEN-IO-VIEW.
000470
000480          PERFORM PREPARA-VIEW THRU EX-PREPARA-VIEW.
000490
000500          MOVE ZEROS      TO STATUS-VIEW.
000510
000520          OPEN I-O ARKVIEW.
000530
000540          IF STATUS-VIEW = "35"
000550           OPEN OUTPUT ARKVIEW
000560           CLOSE ARKVIEW
000570            GO TO OPEN-IO-VIEW.
000580
000590          IF STATUS-VIEW NOT = ZEROS
000600           PERFORM ERRORE-VIEW THRU EX-ERRORE-VIEW
000610           CLOSE ARKVIEW.
000620
000630  EX-OPEN-IO-VIEW.
000640          EXIT.
000650*
000660  ERRORE-VIEW.
000670
000680          STRING "ERRORE SU " DELIMITED BY SIZE
000690          FILE-VIEW DELIMITED BY "   "
000700          " STATO:" STATUS-VIEW
000710          DELIMITED BY  SIZE INTO MESSAGGIO
000720          PERFORM VIS-MESS        THRU EX-VIS-MESS.
000730
000740  EX-ERRORE-VIEW.
000750          EXIT.
000760
000770*
000780***
000790*
000800  STARTO-VIEW.
000810          MOVE "SI"       TO ESITO.
000820          START ARKVIEW KEY IS NOT < CHIAVE-VIEW
000830           INVALID KEY
000840           MOVE "NO"      TO ESITO.
000850  EX-STARTO-VIEW.
000860          EXIT.
000870*
000880***
000890*
000900***
000910*
000920  LEGGO-NEXT-VIEW.
000930          MOVE         "N"     TO FINE-FILE.
000940          READ ARKVIEW NEXT RECORD  NO LOCK
000950           AT END MOVE "S"     TO FINE-FILE.
000960  EX-LEGGO-NEXT-VIEW.
000970          EXIT.
000980*
000990***
001000*
001010  LEGGO-VIEW.
001020
001030          MOVE FUNCTION UPPER-CASE(CHIAVE-VIEW) TO CHIAVE-VIEW.
001040
001050          MOVE "SI"       TO ESITO.
001060          READ ARKVIEW KEY IS CHIAVE-VIEW
001070           INVALID KEY
001080           MOVE "NO"      TO ESITO.
001090
001100           IF STATUS-VIEW = LOCK-STATUS
001110            MOVE "Record in uso presso altro terminale"
001120            TO MESSAGGIO
001130            PERFORM VIS-MESS     THRU EX-VIS-MESS
001140             GO TO LEGGO-VIEW.
001150
001160  EX-LEGGO-VIEW.
001170          EXIT.
001180
001190***
001200*
001210  SCRIVO-VIEW.
001220
001230          MOVE "SI"       TO ESITO.
001240          WRITE VIEW
001250           INVALID KEY
001260           MOVE "NO"      TO ESITO.
001270
001280          IF STATUS-VIEW(1:1) > "2"
001290           PERFORM ERRORE-VIEW THRU EX-ERRORE-VIEW.
001300
001310
001320  EX-SCRIVO-VIEW.
001330          EXIT.
001340*
001350***
001360*
001370  AGGIORNO-VIEW.
001380          MOVE "SI"       TO ESITO.
001390          REWRITE VIEW
001400           INVALID KEY
001410           MOVE "NO"      TO ESITO.
001420
001430          IF STATUS-VIEW(1:1) > "2"
001440           PERFORM ERRORE-VIEW THRU EX-ERRORE-VIEW.
001450
001460  EX-AGGIORNO-VIEW.
001470          EXIT.
001480*
001490***
001500*
001510  CANCELLO-VIEW.
001520          MOVE "SI"       TO ESITO.
001530          DELETE ARKVIEW
001540           INVALID KEY
001550           MOVE "NO"      TO ESITO.
001560
001570          IF STATUS-VIEW(1:1) > "2"
001580           PERFORM ERRORE-VIEW THRU EX-ERRORE-VIEW.
001590
001600  EX-CANCELLO-VIEW.
001610          EXIT.
001620
001630  CLOSE-VIEW.
001640          CLOSE ARKVIEW.
001650  EX-CLOSE-VIEW.
001660          EXIT.
001670
001680  PREPARA-VIEW.
001681
001690* DE/COMMENTARE PRIMA DI COMPILARE PER LA PRODUZIONE ! 
001700          STRING "c:/TEMP/ARKVIEW"
001710                  SECTION-WEB     
001720           DELIMITED BY SIZE INTO FILE-VIEW.
001730
001740  EX-PREPARA-VIEW.
001750          EXIT.
001760
001770  SCRITTURA-VIEW.
001780
001790
001800
001810           IF TIPO-VIEW = SPACES
001820
001830            IF STRINGA-VIEW > SPACES
001840             MOVE "X" TO TIPO-VIEW
001850            END-IF
001860
001870            IF IMPORTO-VIEW NOT = ZEROS
001880             MOVE "I" TO TIPO-VIEW
001890            END-IF
001900
001910            IF NUMERO-VIEW NOT = ZEROS
001920             MOVE "N" TO TIPO-VIEW
001930            END-IF
001940
001950            IF AA-VIEW NOT = ZEROS
001960             MOVE "D" TO TIPO-VIEW
001970            END-IF
001980
001990           END-IF.
002000
002010          MOVE SPACES TO EDIT-VIEW
002020           EVALUATE TIPO-VIEW
002030
002040            WHEN "X" MOVE STRINGA-VIEW    TO EDIT-VIEW
002050            WHEN "I" MOVE IMPORTO-VIEW    TO VIS-VIEW
002060                     MOVE VIS-VIEW        TO EDIT-VIEW
002070            WHEN "N" MOVE NUMERO-VIEW     TO EDIT-VIEW
002080            WHEN "D"
002090                     STRING GG-VIEW "-" MM-VIEW "-" AA-VIEW
002100                      DELIMITED BY  SIZE INTO EDIT-VIEW
002110            WHEN OTHER MOVE STRINGA-VIEW  TO EDIT-VIEW
002120
002130          END-EVALUATE.
002140
002150          INSPECT VIEW REPLACING ALL x"00" BY X"20".
002160
002170          PERFORM CANCELLO-VIEW THRU EX-CANCELLO-VIEW.
002180
002190          PERFORM SCRIVO-VIEW THRU EX-SCRIVO-VIEW.
002200
002210          INITIALIZE VIEW.
002220
002230  EX-SCRITTURA-VIEW.
002240          EXIT.
002250
002260
002270  VALIDITA.
002280
002290           MOVE "VALIDITA"     TO NOME-VIEW
002300
002310           PERFORM LEGGO-VIEW  THRU EX-LEGGO-VIEW.
002320
002330
002340           IF ESITO-NOK MOVE "NO" TO ESITO
002350            GO TO EX-VALIDITA.
002360
002370
002380           ACCEPT DATA-SYS FROM DATE.
002390
002400           MOVE GG-SYS         TO GG-WEB.
002410           MOVE MM-SYS         TO MM-WEB.
002420           MOVE AA-SYS         TO AA-WEB.
002430           ADD 2000            TO AA-WEB.
002440
002450
002460           ACCEPT TIME-SECTION-NOW FROM TIME.
002470
002480           COMPUTE MINUTI-WEB = ORE-SECTION-NOW * 60 +
002490              MIN-SECTION-NOW.
002500
002510           IF ORARIO-WEB > STRINGA-VIEW
002520              MOVE "NO"        TO ESITO.


                 MOVE SPACES TO STRINGA-VIEW.  
001530           DISPLAY "REMOTE_ADDR" UPON ENV-NAME
001540           ACCEPT BUFFER   FROM ENV-VALUE
001550           ON EXCEPTION CONTINUE
001560           END-ACCEPT.
002530
                 MOVE "REMOTE-IP"       TO NOME-VIEW
002300
002310           PERFORM LEGGO-VIEW  THRU EX-LEGGO-VIEW.
002320 
002340           IF ESITO-NOK 
002360             MOVE "NO" TO ESITO.

                 IF BUFFER NOT = STRINGA-VIEW
                   MOVE "NO" TO ESITO.
002540
002550  EX-VALIDITA.
002560          EXIT.
