000010  INIZIO-WEB.
000020
000030      CALL  "COBW3_INIT"      USING  COBW3 .
000040
000050* SET the CONTENT-TYPE to HTML
000060      SET COBW3-CONTENT-TYPE-HTML TO TRUE .
000070
000080* COMMENTARE PER DISATTIVARE IL DEBUG NATIVO
000090      MOVE "1"             TO COBW3-DMODE.
000100
000110  EX-INIZIO-WEB.
000120        EXIT.
000130
000140
000150  FINE-WEB.
000160
000170      CALL  "COBW3_FREE"       USING  COBW3 .
000180
000190  EX-FINE-WEB.
000200        EXIT.
000210
000220  LETTURA-WEB.
000230
000240         IF NOT OPENED-WEB
000250          OPEN INPUT ARKWEB
000260           SET OPENED-WEB    TO TRUE
000270           MOVE "N"          TO EOF-WEB
000280           IF STATUS-WEB NOT = "00"
000290           STRING " ERRORE APERTURA " FILE-WEB
000300            DELIMITED BY SIZE INTO MESSAGGIO
000310            PERFORM VIS-MESS  THRU EX-VIS-MESS
000320             GO TO END-LETTURA-WEB.
000330
000340          READ ARKWEB NEXT RECORD AT END
000350           GO TO END-LETTURA-WEB.
000360
000370          IF DATI-WEB = SPACES GO TO LETTURA-WEB.
000380
000390          PERFORM REPLACE-WEB THRU EX-REPLACE-WEB.
000400
000410          PERFORM LINE-WEB    THRU EX-LINE-WEB.
000420
000430
000440          GO TO EX-LETTURA-WEB.
000450
000460  END-LETTURA-WEB.
000470
000480          SET EOF-FILE-WEB  TO TRUE.
000490          MOVE SPACE        TO FLAG-WEB.
000500
000510          CLOSE ARKWEB.
000520
000530  EX-LETTURA-WEB.
000540          EXIT.
000550
000560
000570  VIS-MESS.
000580
000590          MOVE MESSAGGIO      TO VALUE-WEB.
000600          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000610          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000620
000630          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000640          MOVE "MK-TITLE"     TO FIELD-WEB.
000650          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000660
000670          MOVE SECTION-WEB    TO VALUE-WEB.
000680          MOVE "MK-KEY"       TO FIELD-WEB.
000690          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000700
000710
000720			MOVE "GOBACK"		TO NOME-VIEW.
000730			PERFORM LEGGO-VIEW	THRU EX-LEGGO-VIEW.
000740			IF ESITO-NOK MOVE SPACES TO STRINGA-VIEW.
000750
000760          MOVE STRINGA-VIEW   TO VALUE-WEB.
000770          MOVE "MK-BACK"      TO FIELD-WEB.
000780          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000790
000800
000810
000820          MOVE "TEMPLATE/MESSAGE.HTM"  TO PAGE-WEB.
000830          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000840
000850  EX-VIS-MESS.
000860          EXIT.
000870
000880  VIS-MENU.
000890
000900          MOVE MESSAGGIO      TO VALUE-WEB.
000910          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000920          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000930
000940          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000950          MOVE "MK-TITLE"     TO FIELD-WEB.
000960          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000970
000980          MOVE SECTION-WEB    TO VALUE-WEB.
000990          MOVE "MK-KEY"       TO FIELD-WEB.
001000          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001010
001020
001030          MOVE "TEMPLATE/GOMENU.HTM"  TO PAGE-WEB.
001040          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001050
001060  EX-VIS-MENU.
001070          EXIT.
001080
001090  VIS-LOGIN.
001100
001110          move spaces to messaggio
001120
001130          string "Utente non presente o sessione di lavoro"
001140           " scaduta  - e' necessario effettuare "
001150           " la login" DELIMITED BY SIZE INTO messaggio
001160          MOVE MESSAGGIO      TO VALUE-WEB.
001170          MOVE "MK-MESSAGE"   TO FIELD-WEB.
001180          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001190
001200          MOVE "SEGNALAZIONE" TO VALUE-WEB.
001210          MOVE "MK-TITLE"     TO FIELD-WEB.
001220          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001230
001240
001250
001260          MOVE "TEMPLATE/GOLOGIN.HTM"    TO PAGE-WEB.
001270          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001280
001290  EX-VIS-LOGIN.
001300          EXIT.
001310
001320
001330  METTI-WEB.
001340
001350          MOVE FIELD-WEB    TO COBW3-CNV-NAME.
001360          MOVE VALUE-WEB    TO COBW3-CNV-VALUE.
001370          MOVE ZEROS        TO COBW3-CNV-NAME-LENGTH.
001380          MOVE ZEROS        TO COBW3-CNV-VALUE-LENGTH.
001390          CALL "COBW3_CNV_SET" USING COBW3.
001400          MOVE SPACES       TO COBW3-CNV-VALUE.
001410
001420  EX-METTI-WEB.
001430          EXIT.
001440
001450
001460  SHOW-WEB.
001470
001480          MOVE PAGE-WEB     TO COBW3-HTML-FILENAME.
001490          CALL "COBW3_PUT_HTML" USING COBW3.
001500
001510  EX-SHOW-WEB.
001520          EXIT.
001530
001540  LINE-WEB.
001550
001560          IF DATI-WEB > SPACES
001570          MOVE DATI-WEB       TO     COBW3-PUT-STRING
001580          MOVE ZEROS          TO     COBW3-PUT-STRING-LENGTH
001590          CALL  "COBW3_PUT_TEXT"   USING  COBW3
001600
001610          MOVE SPACES             TO DATI-WEB.
001620
001630  EX-LINE-WEB.
001640          EXIT.
001650
001660
001670  READ-WEB.
001680
001690        IF INDEX-WEB NOT > 1
001700          MOVE 1          TO  COBW3-NUMBER
001710         ELSE
001720          MOVE INDEX-WEB TO  COBW3-NUMBER.
001730
001740        MOVE FIELD-WEB   TO  COBW3-SEARCH-DATA
001750        CALL "COBW3_NAME" USING COBW3
001760        MOVE COBW3-GET-DATA (1:COBW3-GET-LENGTH) TO VALUE-WEB.
001770
001780        IF  COBW3-SEARCH-FLAG-EXIST
001790         SET ON-WEB TO TRUE
001800         ELSE
001810         SET OFF-WEB TO TRUE.
001820
001830         IF VALUE-WEB(1:2) NUMERIC
001840          AND VALUE-WEB(3:1) = "/"
001850           AND VALUE-WEB(4:2) NUMERIC
001860            AND VALUE-WEB(6:1) = "/"
001870             AND VALUE-WEB(7:4) NUMERIC
001880
001890             MOVE VALUE-WEB(1:2) TO GG-WEB
001900             MOVE VALUE-WEB(4:2) TO MM-WEB
001910             MOVE VALUE-WEB(7:4) TO AA-WEB
001920              ELSE
001930              INITIALIZE DATA-WEB.
001940
001950
001960          PERFORM ALFA-TO-NUM-WEB THRU EX-ALFA-TO-NUM-WEB.
001970
001980
001990  EX-READ-WEB.
002000          EXIT.
002010
002020  MAKE-WEB.
002030
002040          MOVE PAGE-WEB TO FILE-WEB.
002050          MOVE "N"      TO EOF-WEB.
002060          PERFORM UNTIL EOF-FILE-WEB
002070          PERFORM LETTURA-WEB THRU EX-LETTURA-WEB
002080          END-PERFORM.
002090
002100  EX-MAKE-WEB.
002110          EXIT.
002120
002130
002140  ESEGUI-WEB.
002150*
002160**** mettere il comando in COBW3-SYSTEMINFO.
002170*
002180          CALL "COBW3_SYSTEM" USING COBW3.
002190          MOVE SPACES       TO COBW3-SYSTEMINFO.
002200
002210  EX-ESEGUI-WEB.
002220          EXIT.
002230
002240
002250  SHA-WEB.
002260
002270			MOVE SPACES TO COBW3-SYSTEMINFO.
002280
002290          STRING 'openSSL passwd -salt x ' DELIMITED BY SIZE
002300          FIELD-WEB DELIMITED BY "   "
002310          " > /temp/SHA" DELIMITED BY SIZE 
002320           SECTION-WEB ".log" 
002330            DELIMITED BY SIZE INTO COBW3-SYSTEMINFO.
002340			 
002350          PERFORM ESEGUI-WEB 	  THRU EX-ESEGUI-WEB.
002351
002353			CALL "SAVESHA3" USING SECTION-WEB
002354			 RETURNING VALUE-WEB.
002355
002356			CANCEL "SAVESHA3".
002357
002360
002370  EX-SHA-WEB.
002380			EXIT.
002390
002400  CALL-WEB.
002410
002420          CALL "POWEROPENSHEET" USING PROGRAMMA-WEB
002430                                      LIBRERIA-WEB
002440                          RETURNING RITORNO-WEB.
002450
002460
002470  EX-CALL-WEB.
002480          EXIT.
002490
002500  REPLACE-STANDARD-WEB.
002510
002520
002530          MOVE SPACES     TO FILE-LIB
002540
002550          MOVE ZEROS TO IND1-WEB IND-WEB.
002560*
002570*** separatori ammesssi @varibile@   diventa 'varibile'
002580*
002590*** separatori ammesssi $varibile$   diventa  varibile
002600*
002610          INSPECT DATI-WEB TALLYING IND1-WEB FOR ALL "@"
002620
002630          MOVE SPACES     TO FILE-LIB
002640
002650          IF IND1-WEB  = 2
002660          MOVE SPACES     TO NOME-VIEW
002670           unstring DATI-WEB DELIMITED BY "@"
002680            INTO DUMMY NOME-VIEW FILE-LIB
002690              GO TO LETTURA-STANDARD-WEB.
002700
002710  CICLO-DOLLARO-WEB.
002720
002730          MOVE ZEROS TO IND-WEB.
002740
002750          INSPECT DATI-WEB TALLYING IND-WEB FOR ALL "$"
002760
002770**** COPPIE DI $ DEFINISCONO UNA VARIABILE
002780
002790          IF IND-WEB  < 2 GO TO EX-REPLACE-STANDARD-WEB.
002800
002810          MOVE SPACES TO NOME-VIEW.
002820
002830          PERFORM VARYING IND-WEB FROM 1 BY 1 UNTIL
002840          IND-WEB > LENGTH OF DATI-WEB OR DATI-WEB(IND-WEB:1) = "$"
002850           CONTINUE
002860          END-PERFORM.
002870
002880          MOVE  IND-WEB TO IND1-WEB.
002890
002900          ADD 1  TO IND1-WEB.
002910
002920          MOVE ZERO TO SIZE-WEB.
002930
002940          PERFORM VARYING IND1-WEB FROM IND1-WEB BY 1 UNTIL
002950          IND1-WEB > LENGTH OF DATI-WEB OR DATI-WEB(IND1-WEB:1) = "$"
002960
002970           ADD 1    TO SIZE-WEB
002980
002990          END-PERFORM.
003000
003010
003020
003030***** SALVA DA DOPO IL 2 $ $VARIABILE$->------ IN BUFFER
003040
003050			COMPUTE IND2-WEB = IND1-WEB + 1.
003060
003070          MOVE DATI-WEB(IND2-WEB:) TO BUFFER.
003080
003090			COMPUTE IND2-WEB = IND-WEB + 1.
003100
003110
003120          MOVE DATI-WEB(IND2-WEB:SIZE-WEB)  TO NOME-VIEW
003130
003140          PERFORM LEGGO-VIEW THRU EX-LEGGO-VIEW.
003150
003160          UNLOCK ARKWEB RECORD.
003170
003180          IF ESITO-NOK MOVE  SPACES TO EDIT-VIEW.
003190
003200          MOVE EDIT-VIEW  TO DATI-WEB(IND-WEB:)
003210
003220          IF DATI-WEB = SPACES
003230           MOVE BUFFER TO DATI-WEB
003240             GO TO EX-REPLACE-STANDARD-WEB.
003250
003260          PERFORM VARYING IND-WEB FROM LENGTH OF DATI-WEB
003270            BY -1 UNTIL DATI-WEB(IND-WEB:1) > SPACES
003280            CONTINUE
003290          END-PERFORM.
003300
003310          ADD 1 TO IND-WEB.
003320
003330          MOVE "/DIVISORE/" TO DATI-WEB(IND-WEB:).
003340
003350          MOVE SPACES     TO BUFFER1.
003360
003370          STRING DATI-WEB DELIMITED BY "/DIVISORE/"
003380              BUFFER DELIMITED BY SIZE INTO BUFFER1.
003390
003400          MOVE BUFFER1    TO  DATI-WEB.
003410
003420          GO TO CICLO-DOLLARO-WEB.
003430
003440  LETTURA-STANDARD-WEB.
003450
003460**** SE PRESENTE UN FILE LIBRERIA DESUME LA STRUTTURA DAL RELATIVO FILE NEL QUALE SOSTITUISCE @DATA@ CON LA VARIABILE...
003470*
003480*       @VARIABILE@FILE=/TEMPLATE/FILE.LIB
003490*
003500
003510          PERFORM PREPARA-WEB   THRU EX-PREPARA-WEB.
003520
003530          IF FILE-LIB(1:5) = "FILE="
003540			 MOVE FILE-LIB(6:)    TO LIBRERIA-WEB
003550			  MOVE LIBRERIA-WEB   TO FILE-LIB
003560             PERFORM TRATTA-LIB THRU EX-TRATTA-LIB.
003570
003580
003590
003600  EX-REPLACE-STANDARD-WEB.
003610          EXIT.
003620
003630  PREPARA-WEB.
003640*
003650**  SE NOME UGUALE AD INCLUDE ALLORA C'E UN @INCLUDE@FILE=/TEMPLATE/FILE.HTM CHE VIENE CARICATO
003660*			
003670
003680          PERFORM LEGGO-VIEW THRU EX-LEGGO-VIEW.
003690
003700          IF ESITO-NOK MOVE  SPACES TO EDIT-VIEW.
003710
003720          UNLOCK ARKWEB RECORD.
003730
003740          MOVE SPACES        TO BUFFER.
003750
003760          STRING "             '" DELIMITED BY SIZE
003770          EDIT-VIEW  DELIMITED BY "             "
003780           "'" DELIMITED BY SIZE INTO BUFFER
003790           MOVE BUFFER           TO DATI-WEB.
003800
003810
003820  EX-PREPARA-WEB.
003830          EXIT.
003840
003850
003860  LETTURA-LIB.
003870
003880         IF NOT OPENED-LIB
003890          OPEN INPUT ARKLIB
003900           SET OPENED-LIB    TO TRUE
003910           MOVE "N"          TO EOF-LIB
003920           IF STATUS-LIB NOT = "00"
003930           STRING " ERRORE APERTURA " FILE-LIB
003940            DELIMITED BY SIZE INTO MESSAGGIO
003950            PERFORM VIS-MESS  THRU EX-VIS-MESS
003960             GO TO END-LETTURA-LIB.
003970
003980          READ ARKLIB NEXT RECORD AT END
003990           GO TO END-LETTURA-LIB.
004000
004010          IF DATI-LIB = SPACES GO TO LETTURA-LIB.
004020
004030          MOVE ZEROS          TO IND-LIB.
004040
004050          INSPECT DATI-LIB TALLYING IND-LIB FOR ALL "@DATA@"
004060
004070          IF IND-LIB  = 1
004080           MOVE BUFFER        TO DATI-LIB.
004090
004100          MOVE ZEROS          TO IND-LIB.
004110
004120          INSPECT DATI-LIB TALLYING IND-LIB FOR ALL "@"
004130
004140          IF IND-LIB  = 2
004150           MOVE DATI-LIB      TO DATI-WEB
004160			  PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB
004170            PERFORM LINE-WEB    THRU EX-LINE-WEB
004180				GO TO LETTURA-LIB.
004190
004200
004210          MOVE DATI-LIB       TO DATI-WEB.
004220
004230          PERFORM LINE-WEB    THRU EX-LINE-WEB.
004240
004250
004260          GO TO LETTURA-LIB.
004270
004280  END-LETTURA-LIB.
004290
004300          SET EOF-FILE-LIB  TO TRUE.
004310          MOVE SPACE        TO FLAG-LIB.
004320
004330          CLOSE ARKLIB.
004340
004350  EX-LETTURA-LIB.
004360          EXIT.
004370
004380
004390  TRATTA-LIB.
004400
004410          MOVE "N"      TO EOF-LIB.
004420          PERFORM UNTIL EOF-FILE-LIB
004430          PERFORM LETTURA-LIB THRU EX-LETTURA-LIB
004440          END-PERFORM.
004450
004460  EX-TRATTA-LIB.
004470          EXIT.
004480
004490
004500  ALFA-TO-NUM-WEB.
004510
004520
004530          MOVE ALL ZEROS          TO TAB-NUMERO-WEB.
004540
004550          MOVE 18                 TO IND3-WEB
004560          PERFORM VARYING IND2-WEB FROM 18 BY -1 UNTIL IND2-WEB = ZERO
004570
004580          IF VALUE-WEB(IND2-WEB:1) NUMERIC
004590          MOVE  VALUE-WEB(IND2-WEB:1)   TO TAB-NUMERO-WEB(IND3-WEB:1)
004600          SUBTRACT 1 FROM IND3-WEB
004610          END-IF
004620
004630          END-PERFORM.
004640
004650          MOVE TAB-NUMERO-WEB     TO NUMERO-WEB.
004660
004670
004680  EX-ALFA-TO-NUM-WEB.
004690          EXIT.
