000010  INIZIO-WEB.
000020
000030      CALL  "COBW3_INIT"      USING  COBW3 .
000040
000050* SET the CONTENT-TYPE to HTML
000060      SET COBW3-CONTENT-TYPE-HTML TO TRUE .
000070
000080* COMMENTARE PER DISATTIVARE IL DEBUG NATIVO
000090      MOVE "1"             TO COBW3-DMODE.
000100
000110  EX-INIZIO-WEB.
000120        EXIT.
000130
000140
000150  FINE-WEB.
000160
000170      CALL  "COBW3_FREE"       USING  COBW3 .
000180
000190  EX-FINE-WEB.
000200        EXIT.
000210
000220  LETTURA-WEB.
000230
000240         IF NOT OPENED-WEB
000250          OPEN INPUT ARKWEB
000260           SET OPENED-WEB    TO TRUE
000270           MOVE "N"          TO EOF-WEB
000280           IF STATUS-WEB NOT = "00"
000290           STRING " ERRORE APERTURA " FILE-WEB
000300            DELIMITED BY SIZE INTO MESSAGGIO
000310            PERFORM VIS-MESS  THRU EX-VIS-MESS
000320             GO TO END-LETTURA-WEB.
000330
000340          READ ARKWEB NEXT RECORD AT END
000350           GO TO END-LETTURA-WEB.
000360
000370          IF DATI-WEB = SPACES GO TO LETTURA-WEB.
000380
000390          PERFORM REPLACE-WEB THRU EX-REPLACE-WEB.
000400
000410          PERFORM LINE-WEB    THRU EX-LINE-WEB.
000420
000430
000440          GO TO EX-LETTURA-WEB.
000450
000460  END-LETTURA-WEB.
000470
000480          SET EOF-FILE-WEB  TO TRUE.
000490          MOVE SPACE        TO FLAG-WEB.
000500
000510          CLOSE ARKWEB.
000520
000530  EX-LETTURA-WEB.
000540          EXIT.
000550
000560
000570  VIS-MESS.
000580
000590          MOVE MESSAGGIO      TO VALUE-WEB.
000600          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000610          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000620
000630          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000640          MOVE "MK-TITLE"     TO FIELD-WEB.
000650          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000660
000670          MOVE SECTION-WEB    TO VALUE-WEB.
000680          MOVE "MK-KEY"       TO FIELD-WEB.
000690          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000700
000710
000720          MOVE "TEMPLATE/MESSAGE.HTM"  TO PAGE-WEB.
000730          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000740
000750  EX-VIS-MESS.
000760          EXIT.
000770
000780  VIS-MENU.
000790
000800          MOVE MESSAGGIO      TO VALUE-WEB.
000810          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000820          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000830
000840          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000850          MOVE "MK-TITLE"     TO FIELD-WEB.
000860          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000870
000880          MOVE SECTION-WEB    TO VALUE-WEB.
000890          MOVE "MK-KEY"       TO FIELD-WEB.
000900          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000910
000920
000930          MOVE "TEMPLATE/GOMENU.HTM"  TO PAGE-WEB.
000940          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000950
000960  EX-VIS-MENU.
000970          EXIT.
000980
000990  VIS-LOGIN.
001000
001010          move spaces to messaggio
001020
001030          string "La sessione corrente di lavoro"
001040           " e' scaduta  - e' necessario rifare "
001050           " la login" DELIMITED BY SIZE INTO messaggio
001060          MOVE MESSAGGIO      TO VALUE-WEB.
001070          MOVE "MK-MESSAGE"   TO FIELD-WEB.
001080          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001090
001100          MOVE "SEGNALAZIONE" TO VALUE-WEB.
001110          MOVE "MK-TITLE"     TO FIELD-WEB.
001120          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001130
001140
001150
001160          MOVE "TEMPLATE/GOLOGIN.HTM"    TO PAGE-WEB.
001170          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001180
001190  EX-VIS-LOGIN.
001200          EXIT.
001210
001220
001230  METTI-WEB.
001240
001250          MOVE FIELD-WEB    TO COBW3-CNV-NAME.
001260          MOVE VALUE-WEB    TO COBW3-CNV-VALUE.
001270          MOVE ZEROS        TO COBW3-CNV-NAME-LENGTH.
001280          MOVE ZEROS        TO COBW3-CNV-VALUE-LENGTH.
001290          CALL "COBW3_CNV_SET" USING COBW3.
001300          MOVE SPACES       TO COBW3-CNV-VALUE.
001310
001320  EX-METTI-WEB.
001330          EXIT.
001340
001350
001360  SHOW-WEB.
001370
001380          MOVE PAGE-WEB     TO COBW3-HTML-FILENAME.
001390          CALL "COBW3_PUT_HTML" USING COBW3.
001400
001410  EX-SHOW-WEB.
001420          EXIT.
001430
001440  LINE-WEB.
001450
001460          IF DATI-WEB > SPACES
001470          MOVE DATI-WEB       TO     COBW3-PUT-STRING
001480          MOVE ZEROS          TO     COBW3-PUT-STRING-LENGTH
001490          CALL  "COBW3_PUT_TEXT"   USING  COBW3
001500
001510          MOVE SPACES             TO DATI-WEB.
001520
001530  EX-LINE-WEB.
001540          EXIT.
001550
001560
001570  READ-WEB.
001580
001590        IF INDEX-WEB NOT > 1
001600          MOVE 1          TO  COBW3-NUMBER
001610         ELSE
001620          MOVE INDEX-WEB TO  COBW3-NUMBER.
001630
001640        MOVE FIELD-WEB   TO  COBW3-SEARCH-DATA
001650        CALL "COBW3_NAME" USING COBW3
001660        MOVE COBW3-GET-DATA (1:COBW3-GET-LENGTH) TO VALUE-WEB.
001670
001680        IF  COBW3-SEARCH-FLAG-EXIST
001690         SET ON-WEB TO TRUE
001700         ELSE
001710         SET OFF-WEB TO TRUE.
001720
001730         IF VALUE-WEB(1:2) NUMERIC
001740          AND VALUE-WEB(3:1) = "/"
001750           AND VALUE-WEB(4:2) NUMERIC
001760            AND VALUE-WEB(6:1) = "/"
001770             AND VALUE-WEB(7:4) NUMERIC
001780
001790             MOVE VALUE-WEB(1:2) TO GG-WEB
001800             MOVE VALUE-WEB(4:2) TO MM-WEB
001810             MOVE VALUE-WEB(7:4) TO AA-WEB
001820              ELSE
001830              INITIALIZE DATA-WEB.
001840
001850
001860          PERFORM ALFA-TO-NUM-WEB THRU EX-ALFA-TO-NUM-WEB.
001870
001880
001890  EX-READ-WEB.
001900          EXIT.
001910
001920  MAKE-WEB.
001930
001940          MOVE PAGE-WEB TO FILE-WEB.
001950          MOVE "N"      TO EOF-WEB.
001960          PERFORM UNTIL EOF-FILE-WEB
001970          PERFORM LETTURA-WEB THRU EX-LETTURA-WEB
001980          END-PERFORM.
001990
002000  EX-MAKE-WEB.
002010          EXIT.
002020
002030  CALL-WEB.
002040
002050          CALL "POWEROPENSHEET" USING PROGRAMMA-WEB
002060                                      LIBRERIA-WEB
002070                          RETURNING RITORNO-WEB.
002080
002090
002100  EX-CALL-WEB.
002110          EXIT.
002120
002130  REPLACE-STANDARD-WEB.
002140
002150
002160          MOVE SPACES     TO FILE-LIB
002170
002180          MOVE ZEROS TO IND1-WEB IND-WEB.
002190
002200          INSPECT DATI-WEB TALLYING IND1-WEB FOR ALL "@"
002210
002220          MOVE SPACES     TO FILE-LIB
002230
002240          IF IND1-WEB  = 2
002250          MOVE SPACES     TO NOME-VIEW
002260           unstring DATI-WEB DELIMITED BY "@"
002270            INTO DUMMY NOME-VIEW FILE-LIB
002280              GO TO LETTURA-STANDARD-WEB.
002290
002300          MOVE ZEROS TO IND-WEB.
002310
002320          INSPECT DATI-WEB TALLYING IND-WEB FOR ALL "$"
002330
002340          IF IND-WEB NOT = 2 GO TO EX-REPLACE-STANDARD-WEB.
002350
002360          MOVE SPACES TO NOME-VIEW.
002370          unstring DATI-WEB DELIMITED BY "$"
002380          INTO DUMMY NOME-VIEW FILE-LIB.
002390
002400
002410  LETTURA-STANDARD-WEB.
002420
002430**** SE PRESENTE UN FILE LIBRERIA DESUME LA STRUTTURA DAL RELATIVO FILE NEL QUALE SOSTITUISCE @DATA@ CON LA VARIABILE...
002431*
002433*       @VARIABILE@FILE=/TEMPLATE/FILE.LIB
002434*
002440
002450
002460
002470          PERFORM PREPARA-WEB   THRU EX-PREPARA-WEB.
002480
002490          IF FILE-LIB(1:5) = "FILE="
002500             PERFORM TRATTA-LIB THRU EX-TRATTA-LIB.
002510
002520
002530
002540  EX-REPLACE-STANDARD-WEB.
002550          EXIT.
002560
002570  PREPARA-WEB.
002580
002590
002600          PERFORM LEGGO-VIEW THRU EX-LEGGO-VIEW.
002610
002620          IF ESITO-NOK MOVE  SPACES TO EDIT-VIEW.
002630
002640          MOVE SPACES        TO BUFFER.
002650
002660          IF IND1-WEB  = 2
002670          STRING "             '" DELIMITED BY SIZE
002680          EDIT-VIEW  DELIMITED BY "             "
002690           "'" DELIMITED BY SIZE INTO BUFFER
002700           MOVE BUFFER           TO DATI-WEB
002710                  ELSE
002720          STRING "              " DELIMITED BY SIZE
002730          EDIT-VIEW  DELIMITED BY "             "
002740           " " DELIMITED BY SIZE INTO BUFFER
002750           PERFORM REPLACE-BUFFER THRU EX-REPLACE-BUFFER.
002751
002770
002780  EX-PREPARA-WEB.
002790          EXIT.
002800
002810
002820  REPLACE-BUFFER.
002830
002831		    perform varying ind4-web from length of DATI-WEB BY -1
002832			  UNTIL DATI-WEB(IND4-WEB:1) = "$"
002840            OR IND4-WEB = ZERO
002841            CONTINUE
002842          END-PERFORM.
002843  
002844          IF IND4-WEB  > ZERO 
002845           ADD 1 TO IND4-WEB
002846           IF DATI-WEB(IND4-WEB:) = SPACES
002847            MOVE BUFFER         TO DATI-WEB
002848             GO TO EX-REPLACE-BUFFER.
002849
002850           MOVE DATI-WEB(IND4-WEB:) TO BUFFER1
002851
002852		    perform varying ind4-web from 1 BY 1 
002853			 UNTIL IND4-WEB > length of DATI-WEB 
002854			  OR DATI-WEB(IND4-WEB:1) = "$"
002856            CONTINUE
002857          END-PERFORM.
002858
002859	
002860		    PERFORM VARYING IND3-WEB FROM 1 BY 1 UNTIL
002861			 IND3-WEB > LENGTH OF BUFFER
002862			 OR BUFFER(IND3-WEB:1) > SPACES
002863			 CONTINUE
002864			END-PERFORM
002865	
002866		    IF IND3-WEB > ZEROS
002872			MOVE BUFFER(IND3-WEB:)	TO DATI-WEB(IND4-WEB:)
002873
002877			ELSE
002878			MOVE BUFFER           	TO DATI-WEB(IND4-WEB:).
002879
002880			MOVE SPACES			    TO BUFFER
002881
002882		    STRING DATI-WEB DELIMITED BY "                            "
002883			 BUFFER1 DELIMITED BY SIZE INTO BUFFER
002884
002885		   MOVE BUFFER			TO DATI-WEB.
002886
002887          
002888  EX-REPLACE-BUFFER.
002889          EXIT.
002890
002891  LETTURA-LIB.
002892
002900         IF NOT OPENED-LIB
002910          OPEN INPUT ARKLIB
002920           SET OPENED-LIB    TO TRUE
002930           MOVE "N"          TO EOF-LIB
002940           IF STATUS-LIB NOT = "00"
002950           STRING " ERRORE APERTURA " FILE-LIB
002960            DELIMITED BY SIZE INTO MESSAGGIO
002970            PERFORM VIS-MESS  THRU EX-VIS-MESS
002980             GO TO END-LETTURA-LIB.
002990
003000          READ ARKLIB NEXT RECORD AT END
003010           GO TO END-LETTURA-LIB.
003020
003030          IF DATI-LIB = SPACES GO TO LETTURA-LIB.
003040
003050          MOVE ZEROS          TO IND-LIB.
003060
003070          INSPECT DATI-LIB TALLYING IND-WEB FOR ALL "@DATA@"
003080
003090          IF IND-WEB  = 1
003100           MOVE BUFFER        TO DATI-LIB.
003110
003120
003130          MOVE DATI-LIB       TO DATI-WEB.
003140
003150          PERFORM LINE-WEB    THRU EX-LINE-WEB.
003160
003170
003180          GO TO LETTURA-LIB.
003190
003200  END-LETTURA-LIB.
003210
003220          SET EOF-FILE-LIB  TO TRUE.
003230          MOVE SPACE        TO FLAG-LIB.
003240
003250          CLOSE ARKLIB.
003260
003270  EX-LETTURA-LIB.
003280          EXIT.
003290
003300
003310  TRATTA-LIB.
003320
003330          MOVE "N"      TO EOF-LIB.
003340          PERFORM UNTIL EOF-FILE-LIB
003350          PERFORM LETTURA-LIB THRU EX-LETTURA-LIB
003360          END-PERFORM.
003370
003380  EX-TRATTA-LIB.
003390          EXIT.
003400
003410
003420  ALFA-TO-NUM-WEB.
003430
003440
003450          MOVE ALL ZEROS          TO TAB-NUMERO-WEB.
003460
003470          MOVE 18                 TO IND3-WEB
003480          PERFORM VARYING IND2-WEB FROM 18 BY -1 UNTIL IND2-WEB = ZERO
003490
003500          IF VALUE-WEB(IND2-WEB:1) NUMERIC
003510          MOVE  VALUE-WEB(IND2-WEB:1)   TO TAB-NUMERO-WEB(IND3-WEB:1)
003520          SUBTRACT 1 FROM IND3-WEB
003530          END-IF
003540
003550          END-PERFORM.
003560
003570          MOVE TAB-NUMERO-WEB     TO NUMERO-WEB.
003580
003590
003600  EX-ALFA-TO-NUM-WEB.
003610          EXIT.
