000010  INIZIO-WEB.
000020
000030      CALL  "COBW3_INIT"      USING  COBW3 .
000040
000050* SET the CONTENT-TYPE to HTML
000060      SET COBW3-CONTENT-TYPE-HTML TO TRUE .
000070
000080* COMMENTARE PER DISATTIVARE IL DEBUG NATIVO
000090      MOVE "1"             TO COBW3-DMODE.
000100
000110  EX-INIZIO-WEB.
000120        EXIT.
000130
000140
000150  FINE-WEB.
000160
000170      CALL  "COBW3_FREE"       USING  COBW3 .
000180
000190  EX-FINE-WEB.
000200        EXIT.
000210
000220  LETTURA-WEB.
000230
000240         IF NOT OPENED-WEB
000250          OPEN INPUT ARKWEB
000260           SET OPENED-WEB    TO TRUE
000270           MOVE "N"          TO EOF-WEB
000280           IF STATUS-WEB NOT = "00"
000290           STRING " ERRORE APERTURA " FILE-WEB
000300            DELIMITED BY SIZE INTO MESSAGGIO
000310            PERFORM VIS-MESS  THRU EX-VIS-MESS
000320             GO TO END-LETTURA-WEB.
000330
000340          READ ARKWEB NEXT RECORD AT END
000350           GO TO END-LETTURA-WEB.
000360
000370          IF DATI-WEB = SPACES GO TO LETTURA-WEB.
000380
000390          PERFORM REPLACE-WEB THRU EX-REPLACE-WEB.
000400
000410          PERFORM LINE-WEB    THRU EX-LINE-WEB.
000420
000430
000440          GO TO EX-LETTURA-WEB.
000450
000460  END-LETTURA-WEB.
000470
000480          SET EOF-FILE-WEB  TO TRUE.
000490          MOVE SPACE        TO FLAG-WEB.
000500
000510          CLOSE ARKWEB.
000520
000530  EX-LETTURA-WEB.
000540          EXIT.
000550
000560
000570  VIS-MESS.
000580
000590          MOVE MESSAGGIO      TO VALUE-WEB.
000600          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000610          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000620
000630          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000640          MOVE "MK-TITLE"     TO FIELD-WEB.
000650          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000660
000670          MOVE SECTION-WEB    TO VALUE-WEB.
000680          MOVE "MK-KEY"       TO FIELD-WEB.
000690          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000700
000710
000720			MOVE "GOBACK"		TO NOME-VIEW.
000730			PERFORM LEGGO-VIEW	THRU EX-LEGGO-VIEW.
000740			IF ESITO-NOK MOVE SPACES TO STRINGA-VIEW.
000750
000760          MOVE STRINGA-VIEW   TO VALUE-WEB.
000770          MOVE "MK-BACK"      TO FIELD-WEB.
000780          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000810
000820          MOVE "TEMPLATE/MESSAGE.HTM"  TO PAGE-WEB.
000830          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
000840          MOVE SPACES         TO MESSAGGIO.

000850  EX-VIS-MESS.
000860          EXIT.
000870
000880  VIS-MENU.
000890
000900          MOVE MESSAGGIO      TO VALUE-WEB.
000910          MOVE "MK-MESSAGE"   TO FIELD-WEB.
000920          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000930
000940          MOVE "SEGNALAZIONE" TO VALUE-WEB.
000950          MOVE "MK-TITLE"     TO FIELD-WEB.
000960          PERFORM METTI-WEB   THRU EX-METTI-WEB.
000970
000980          MOVE SECTION-WEB    TO VALUE-WEB.
000990          MOVE "MK-KEY"       TO FIELD-WEB.
001000          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001010
001020
001030          MOVE "TEMPLATE/GOMENU.HTM"  TO PAGE-WEB.
001040          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001050
001060  EX-VIS-MENU.
001070          EXIT.
001080
001090  VIS-LOGIN.
001100
001110          move spaces to messaggio
001120
001130          string "Utente non presente o sessione di lavoro"
001140           " scaduta  - e' necessario effettuare "
001150           " la login" DELIMITED BY SIZE INTO messaggio
001160          MOVE MESSAGGIO      TO VALUE-WEB.
001170          MOVE "MK-MESSAGE"   TO FIELD-WEB.
001180          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001190
001200          MOVE "SEGNALAZIONE" TO VALUE-WEB.
001210          MOVE "MK-TITLE"     TO FIELD-WEB.
001220          PERFORM METTI-WEB   THRU EX-METTI-WEB.
001230
001240
001250
001260          MOVE "TEMPLATE/GOLOGIN.HTM"    TO PAGE-WEB.
001270          PERFORM SHOW-WEB    THRU EX-SHOW-WEB.
001280
001290  EX-VIS-LOGIN.
001300          EXIT.
001310
001320
001330  METTI-WEB.
001340
001350          MOVE FIELD-WEB    TO COBW3-CNV-NAME.
001360          MOVE VALUE-WEB    TO COBW3-CNV-VALUE.
001370          MOVE ZEROS        TO COBW3-CNV-NAME-LENGTH.
001380          MOVE ZEROS        TO COBW3-CNV-VALUE-LENGTH.
001390          CALL "COBW3_CNV_SET" USING COBW3.
001400          MOVE SPACES       TO COBW3-CNV-VALUE.
001410
001420  EX-METTI-WEB.
001430          EXIT.
001440
001450
001460  SHOW-WEB.
001470
001480          MOVE PAGE-WEB     TO COBW3-HTML-FILENAME.
001490          CALL "COBW3_PUT_HTML" USING COBW3.
001500
001510  EX-SHOW-WEB.
001520          EXIT.
001530
001540  LINE-WEB.
001550
001560          IF DATI-WEB > SPACES
001570          MOVE DATI-WEB       TO     COBW3-PUT-STRING
001580          MOVE ZEROS          TO     COBW3-PUT-STRING-LENGTH
001590          CALL  "COBW3_PUT_TEXT"   USING  COBW3
001600
001610          MOVE SPACES             TO DATI-WEB.
001620
001630  EX-LINE-WEB.
001640          EXIT.
001650
001660
001670  READ-WEB.
001680
001690        IF INDEX-WEB NOT > 1
001700          MOVE 1          TO  COBW3-NUMBER
001710         ELSE
001720          MOVE INDEX-WEB TO  COBW3-NUMBER.
001730
001740        MOVE FIELD-WEB   TO  COBW3-SEARCH-DATA
001750        CALL "COBW3_NAME" USING COBW3
001760        MOVE COBW3-GET-DATA (1:COBW3-GET-LENGTH) TO VALUE-WEB.
001770
001780        IF  COBW3-SEARCH-FLAG-EXIST
001790         SET ON-WEB TO TRUE
001800         ELSE
001810         SET OFF-WEB TO TRUE.
001820
001830         IF VALUE-WEB(1:2) NUMERIC
001840          AND VALUE-WEB(3:1) = "/"
001850           AND VALUE-WEB(4:2) NUMERIC
001860            AND VALUE-WEB(6:1) = "/"
001870             AND VALUE-WEB(7:4) NUMERIC
001880
001890             MOVE VALUE-WEB(1:2) TO GG-WEB
001900             MOVE VALUE-WEB(4:2) TO MM-WEB
001910             MOVE VALUE-WEB(7:4) TO AA-WEB
001920              ELSE
001930              INITIALIZE DATA-WEB.
001940
001950
001960          PERFORM ALFA-TO-NUM-WEB THRU EX-ALFA-TO-NUM-WEB.
001970
001980
001990  EX-READ-WEB.
002000          EXIT.
002010
002020  MAKE-WEB.
002030
002040          MOVE PAGE-WEB TO FILE-WEB.
002050          MOVE "N"      TO EOF-WEB.
002060          PERFORM UNTIL EOF-FILE-WEB
002070          PERFORM LETTURA-WEB THRU EX-LETTURA-WEB
002080          END-PERFORM.
002090
002100  EX-MAKE-WEB.
002110          EXIT.
002120
002130
002140  ESEGUI-WEB.
002150*
002160**** mettere il comando in COBW3-SYSTEMINFO.
002170*
002180          CALL "COBW3_SYSTEM" USING COBW3.
002190          MOVE SPACES       TO COBW3-SYSTEMINFO.
002200
002210  EX-ESEGUI-WEB.
002220          EXIT.
002230
002240
002250  SHA-WEB.
002260
002270			MOVE SPACES TO COBW3-SYSTEMINFO.
002280
002290          STRING 'openSSL passwd -salt x ' DELIMITED BY SIZE
002300          FIELD-WEB DELIMITED BY "   "
002310          " > /temp/SHA" DELIMITED BY SIZE 
002320           SECTION-WEB ".log" 
002330            DELIMITED BY SIZE INTO COBW3-SYSTEMINFO.
002340			 
002350          PERFORM ESEGUI-WEB 	  THRU EX-ESEGUI-WEB.
002360
002370			CALL "SAVESHA3" USING SECTION-WEB
002380			 RETURNING VALUE-WEB.
002390
002400			CANCEL "SAVESHA3".
002410
002420
002430  EX-SHA-WEB.
002440			EXIT.
002450
002460  CALL-WEB.
002470
002480          CALL "POWEROPENSHEET" USING PROGRAMMA-WEB
002490                                      LIBRERIA-WEB
002500                          RETURNING RITORNO-WEB.
002510
002520
002530  EX-CALL-WEB.
002540          EXIT.
002550
002560  REPLACE-STANDARD-WEB.
002570*
002580* qui processa un include di file <cobol include=template.hmt></cobol>
002590*
002600          MOVE SPACES     TO FILE-LIB
002610
002620          MOVE ZEROS      TO IND1-WEB IND-WEB.
002630
002640          INSPECT FUNCTION UPPER-CASE(DATI-WEB) TALLYING IND1-WEB 
002650              FOR ALL "<COBOL INCLUDE="
002660
002670          MOVE SPACES     TO FILE-LIB
002680
002690          IF IND1-WEB  = 1
002700          MOVE SPACES     TO NOME-VIEW
002710
002720          PERFORM VARYING IND-WEB FROM 1 BY 1 
002730          UNTIL IND-WEB > LENGTH OF DATI-WEB 
002740           OR FUNCTION UPPER-CASE(DATI-WEB(IND-WEB:8)) = "INCLUDE="
002750            CONTINUE
002760          END-PERFORM
002770
002780          IF FUNCTION UPPER-CASE(DATI-WEB(IND-WEB:8)) = "INCLUDE="
002790          ADD 8       TO IND-WEB          
002800          MOVE 1      TO IND1-WEB
002810          PERFORM VARYING IND-WEB FROM IND-WEB BY 1 
002820           UNTIL IND-WEB > LENGTH OF DATI-WEB                                 
002830            OR DATI-WEB(IND-WEB:1) = ">"
002840              MOVE DATI-WEB(IND-WEB:1) TO FILE-LIB(IND1-WEB:1)
002850              ADD 1 TO IND1-WEB
002860          END-PERFORM
002870
002880          PERFORM TRATTA-LIB THRU EX-TRATTA-LIB.
002890
002900
002910  CICLO-COBOL-WEB. 
002920*
002930*         <cobol>NAME</cobol>  --> return the variable 
002940*
002950*         <cobol argument=" ">NAME</cobol>  --> return the variable with arguments
002960*
002970
002980          MOVE ZEROS TO IND-WEB.
002990
003000          INSPECT FUNCTION UPPER-CASE(DATI-WEB) 
003010             TALLYING IND-WEB FOR ALL "<COBOL"
003020          INSPECT FUNCTION UPPER-CASE(DATI-WEB) 
003030             TALLYING IND-WEB FOR ALL "</COBOL>"
003040
003050**** COPPIE DI <cobol DEFINISCONO UNA VARIABILE
003060
003070          IF IND-WEB  < 2 GO TO EX-REPLACE-STANDARD-WEB.
003080
003090          MOVE SPACES TO NOME-VIEW.
003100
003110          PERFORM VARYING IND-WEB FROM 1 BY 1 UNTIL
003120          IND-WEB > LENGTH OF DATI-WEB 
003130           OR FUNCTION UPPER-CASE(DATI-WEB(IND-WEB:6)) = "<COBOL"
003140           CONTINUE
003150          END-PERFORM.
003160
003170**** NB. la variabile dovra iniziare da INIZIO-WEB..  <COBOL>NAME</COBOL> -->'VALUE'
003180
003190         MOVE IND-WEB     TO POS-WEB
003200*        
003210*    se siamo in presenza di <cobol arguments="values...">NAME </cobol>
003220*    vuol dire che c'e bisogno di leggere un template in "template=" e gli argmenti 
003230*    vengono inseriti nella lettura
003240*
003250          IF FUNCTION UPPER-CASE(DATI-WEB(IND-WEB:7)) = "<COBOL>"
003260          ADD 7           TO IND-WEB
003270
003280          ELSE
003290          
003300          MOVE  DATI-WEB(IND-WEB:)                    TO ARGUMENT
003310
003320          PERFORM VARYING IND-WEB FROM 1 BY 1 
003330          UNTIL IND-WEB > LENGTH OF DATI-WEB 
003340           OR FUNCTION UPPER-CASE(DATI-WEB(IND-WEB:9)) = "TEMPLATE="
003350            CONTINUE
003360          END-PERFORM
003370
003380          IF FUNCTION UPPER-CASE(DATI-WEB(IND-WEB:9)) = "TEMPLATE="
003390          ADD 9       TO IND-WEB          
003400          move "TEMPLATE/"    TO FILE-LIB
003410          MOVE 10     TO IND1-WEB
003420          PERFORM VARYING IND-WEB FROM IND-WEB BY 1 
003430           UNTIL IND-WEB > LENGTH OF DATI-WEB                                 
003440            OR DATI-WEB(IND-WEB:1) = " "
003450              MOVE DATI-WEB(IND-WEB:1) TO FILE-LIB(IND1-WEB:1)
003460              ADD 1 TO IND1-WEB
003470          END-PERFORM
003480
003490          PERFORM TRATTA-LIB THRU EX-TRATTA-LIB
003500         
003510          MOVE SPACES         TO DATI-WEB
003520          
003530          GO TO CICLO-COBOL-WEB.
003540*          
003550** IND-WEB ora punta alla stringa <cobol>STRINGA</cobol>
003560*
003570          MOVE  IND-WEB   TO IND1-WEB.
003580
003590          MOVE ZERO TO SIZE-WEB.
003600
003610          PERFORM VARYING IND1-WEB FROM IND1-WEB BY 1 UNTIL
003620           IND1-WEB > LENGTH OF DATI-WEB 
003630            OR FUNCTION UPPER-CASE(DATI-WEB(IND1-WEB:8)) = "</COBOL>"
003640
003650            ADD 1    TO SIZE-WEB
003660
003670          END-PERFORM.
003680
003690** SIZE-WEB ha la dimensione della stringa <cobol>STRINGA</cobol>
003700*                                                 {LENGTH}
003710***** SALVA DA DOPO </COBOL>------ IN BUFFER
003720
003730			COMPUTE IND2-WEB = IND1-WEB + 8.
003740
003750          MOVE DATI-WEB(IND2-WEB:) TO BUFFER.
003760
003770			
003780          MOVE DATI-WEB(IND-WEB:SIZE-WEB)  TO NOME-VIEW
003790
003800          PERFORM LEGGO-VIEW THRU EX-LEGGO-VIEW.
003810
003820          UNLOCK ARKWEB RECORD.
003830
003840          IF ESITO-NOK MOVE  SPACES TO EDIT-VIEW.
003850
003860          MOVE EDIT-VIEW  TO DATI-WEB(POS-WEB:)
003870
003880          IF DATI-WEB = SPACES
003890           MOVE BUFFER TO DATI-WEB
003900             GO TO EX-REPLACE-STANDARD-WEB.
003910
003920          PERFORM VARYING IND-WEB FROM LENGTH OF DATI-WEB
003930            BY -1 UNTIL DATI-WEB(IND-WEB:1) > SPACES
003940            CONTINUE
003950          END-PERFORM.
003960
003970          ADD 1 TO IND-WEB.
003980
003990          MOVE "/DIVISORE/" TO DATI-WEB(IND-WEB:).
004000
004010          MOVE SPACES     TO BUFFER1.
004020
004030          STRING DATI-WEB DELIMITED BY "/DIVISORE/"
004040              BUFFER DELIMITED BY SIZE INTO BUFFER1.
004050
004060          MOVE BUFFER1    TO  DATI-WEB.
004070
004080          GO TO CICLO-COBOL-WEB.
004090
004100
004110  EX-REPLACE-STANDARD-WEB.
004120          EXIT.
004130
004140
004150
004160  LETTURA-LIB.
004170
004180         IF NOT OPENED-LIB
004190          OPEN INPUT ARKLIB
004200           SET OPENED-LIB    TO TRUE
004210           MOVE "N"          TO EOF-LIB
004220           IF STATUS-LIB NOT = "00"
004230           STRING " ERRORE APERTURA " FILE-LIB
004240            DELIMITED BY SIZE INTO MESSAGGIO
004250            PERFORM VIS-MESS  THRU EX-VIS-MESS
004260             GO TO END-LETTURA-LIB.
004270
004280          READ ARKLIB NEXT RECORD AT END
004290           GO TO END-LETTURA-LIB.
004300
004310          IF DATI-LIB = SPACES GO TO LETTURA-LIB.
004320
004330*
004340*     un file lib non puo avere <cobol arguents=.....> </cobol>
004350* 
004360*     ma solo variabili <cobol>NAME</name> oppure variabili nella forma {VALUE} estratte da ARUGMENT
004370*
004380*
004390
004400
004410          MOVE ZEROS          TO IND-LIB.
004420          
004430          INSPECT DATI-LIB TALLYING IND-LIB FOR ALL "{"
004440          INSPECT DATI-LIB TALLYING IND-LIB FOR ALL "}"
004450          
004460** processiamo solo 6 parametri nella riga nella forma {NAME}
004470
004480          IF IND-LIB = 2 OR 4 OR 6 OR 8 OR 10 OR 12 
004490          PERFORM VARYING IND-LIB FROM 1 BY 1 
004500           UNTIL DATI-LIB(IND-LIB:20) = SPACES OR IND-LIB > LENGTH OF DATI-LIB
004510           IF DATI-LIB(IND-LIB:1) = "{"
004520            PERFORM ARGOMENTO-LIB  THRU EX-ARGOMENTO-LIB
004530             
004540           END-IF
004550
004560          END-PERFORM.
004570
004580          MOVE ZEROS          TO IND-LIB.
004590          
004600          INSPECT DATI-LIB TALLYING IND-LIB FOR ALL "{"
004610          INSPECT DATI-LIB TALLYING IND-LIB FOR ALL "}"
004620          
004630          IF IND-LIB NOT = ZEROS 
004640*
004650* rimuoviamo tutti i tag ancora presenti con {VALUE} in quanto non referenziati nella call <cobol...></cobol>
004660*
004670           PERFORM VARYING IND-LIB  FROM  LENGTH OF DATI-LIB BY -1 
004680              UNTIL IND-LIB = ZEROS           
004690                OR DATI-LIB(IND-LIB:2) = '}"'
004700                  CONTINUE
004710           END-PERFORM
004720           ADD 1 TO IND-LIB
004730           PERFORM  VARYING IND-LIB FROM IND-LIB BY -1 
004740                  UNTIL DATI-LIB(IND-LIB:1) = "{"
004750                  MOVE SPACES TO DATI-LIB(IND-LIB:1)
004760           END-PERFORM
004770
004780           PERFORM  VARYING IND-LIB FROM IND-LIB BY -1 
004790                  UNTIL DATI-LIB(IND-LIB:1) = " "
004800                  MOVE SPACES TO DATI-LIB(IND-LIB:1)
004810           END-PERFORM.
004820
004830          MOVE ZEROS          TO IND-LIB.
004840
004850          INSPECT FUNCTION UPPER-CASE(DATI-LIB) 
004860             TALLYING IND-LIB FOR ALL "<COBOL>"
004870          INSPECT FUNCTION UPPER-CASE(DATI-LIB) 
004880             TALLYING IND-LIB FOR ALL "</COBOL>"
004890
004900          IF IND-LIB  = 2
004910           MOVE DATI-LIB      TO DATI-WEB
004920			  PERFORM REPLACE-STANDARD-WEB THRU EX-REPLACE-STANDARD-WEB
004930            PERFORM LINE-WEB    THRU EX-LINE-WEB
004940				GO TO LETTURA-LIB.
004950
004960          
004970
004980          MOVE DATI-LIB       TO DATI-WEB.
004990
005000          PERFORM LINE-WEB    THRU EX-LINE-WEB.
005010
005020
005030          GO TO LETTURA-LIB.
005040
005050  END-LETTURA-LIB.
005060
005070          SET EOF-FILE-LIB  TO TRUE.
005080          MOVE SPACE        TO FLAG-LIB.
005090
005100          CLOSE ARKLIB.
005110
005120  EX-LETTURA-LIB.
005130          EXIT.
005140 
005150  ARGOMENTO-LIB.
005160  
005170          MOVE IND-LIB    TO IND2-LIB
005180
005190          ADD 1           TO IND-LIB
005200          MOVE ZEROS      TO SIZE-WEB
005210
005220
005230          PERFORM VARYING IND1-LIB FROM IND-LIB BY 1 UNTIL 
005240            IND1-LIB > LENGTH OF DATI-LIB    
005250            OR DATI-LIB(IND1-LIB:1) = "}"
005260              ADD 1  TO SIZE-WEB
005270              
005280           END-PERFORM
005290           
005300**** salva tutto quello c'e dopo } 
005310
005320           MOVE DATI-LIB(IND1-LIB + 1:)    TO BUFFER1
005330           MOVE SPACES                     TO BUFFER
005340           
005350           MOVE FUNCTION UPPER-CASE(DATI-LIB(IND-LIB:SIZE-WEB)) TO VALUE-WEB
005360
005370**** VALUE-WEB ora contiene tutto il nome della {VARIABILE} e la cerca in ARGUMENT
005380
005390           
005400           PERFORM VARYING IND2-WEB FROM 1 BY 1 UNTIL IND2-WEB > LENGTH OF ARGUMENT
005410
005420              OR FUNCTION UPPER-CASE(ARGUMENT (IND2-WEB:SIZE-WEB))
005430                EQUAL FUNCTION UPPER-CASE(VALUE-WEB(1:SIZE-WEB))
005440              
005450              CONTINUE
005460              
005470           END-PERFORM.
005480
005490          
005500          
005510*          
005520* ha trovato {TITLE} E title="qualcosa" ...deve sostituire "qualcosa" dove c'era {TITLE}
005530*                ^        ^   
005540*            DATI-LIB   ARGUMENT
005550
005560           IF IND2-WEB   NOT > LENGTH OF ARGUMENT 
005570
005580              IF FUNCTION UPPER-CASE(ARGUMENT (IND2-WEB:SIZE-WEB))
005590                EQUAL FUNCTION UPPER-CASE(VALUE-WEB(1:SIZE-WEB))
005600
005610                 ADD SIZE-WEB     TO IND2-WEB
005620                
005630                 PERFORM VARYING IND2-WEB FROM IND2-WEB BY 1 
005640                      UNTIL IND2-WEB > LENGTH OF ARGUMENT
005650                      OR ARGUMENT(IND2-WEB:2) = '="'
005660                      CONTINUE
005670                      
005680                 END-PERFORM
005690                 
005700                 ADD 2            TO IND2-WEB
005710                 
005720                 MOVE IND2-WEB    TO POS-WEB
005730                 MOVE ZEROS       TO SIZE-WEB
005740                 PERFORM VARYING IND2-WEB FROM IND2-WEB BY 1 
005750                      UNTIL IND2-WEB > LENGTH OF ARGUMENT
005760                      OR ARGUMENT(IND2-WEB:1) = '"'
005770                      ADD 1       TO SIZE-WEB
005780                 END-PERFORM
005790
005800                MOVE SPACES       TO BUFFER
005810                
005820                 STRING ARGUMENT(POS-WEB:SIZE-WEB) 
005830                         "/DIVISORE/" DELIMITED BY SIZE INTO BUFFER.
005840
005850
005860              IF FUNCTION UPPER-CASE(VALUE-WEB) = "SELF"
005870                MOVE SPACES               TO BUFFER       
005880                 PERFORM VARYING IND2-WEB FROM IND2-LIB BY 1 
005890                      UNTIL IND2-WEB  > LENGTH OF ARGUMENT
005900                      OR ARGUMENT(IND2-WEB:1) = ">"
005910                      CONTINUE
005920                      END-PERFORM
005930                      
005940                      ADD 1       TO IND2-WEB
005950                      MOVE ZEROS  TO SIZE-WEB
005960                      MOVE SPACES TO BUFFER
005970                      PERFORM  VARYING IND2-WEB FROM IND2-WEB BY 1
005980                      UNTIL IND2-WEB  > LENGTH OF ARGUMENT
005990                      OR FUNCTION UPPER-CASE(ARGUMENT(IND2-WEB:8)) = "</COBOL>"
006000                      ADD 1       TO SIZE-WEB
006010                      CONTINUE
006020                      END-PERFORM
006030                      SUBTRACT SIZE-WEB FROM IND2-WEB
006040                      STRING ARGUMENT(IND2-WEB:SIZE-WEB) 
006050                      "/DIVISORE/" DELIMITED BY SIZE INTO BUFFER.
006060                      
006070              
006080              MOVE SPACES TO DATI-WEB.
006090
006100              if BUFFER = SPACES          
006110**** BUFFER NON valorizzato: c'e un {VALUE} NON sostitutito si esce... dopo sopra lo leviamo
006120                   GO TO EX-ARGOMENTO-LIB.
006130              
006140  
006150  
006160       
006170
006180*  IND2-LIB = -> {  DOBBIAMO prendere la dalla sua sinistra a ritroso
006190
006200              SUBTRACT 1 FROM IND2-LIB.
006210
006220              STRING DATI-LIB(1:IND2-LIB)
006230                BUFFER DELIMITED BY "/DIVISORE/"
006240                  BUFFER1 DELIMITED BY "             "
006250                  INTO DATI-WEB.
006260            
006270              MOVE DATI-WEB   TO DATI-LIB.
006280
006290        
006300
006310  EX-ARGOMENTO-LIB.
006320          EXIT.
006330  
006340  TRATTA-LIB.
006350
006360          MOVE "N"      TO EOF-LIB.
006370          PERFORM UNTIL EOF-FILE-LIB
006380          PERFORM LETTURA-LIB THRU EX-LETTURA-LIB
006390          END-PERFORM.
006400
006410  EX-TRATTA-LIB.
006420          EXIT.
006430
006440
006450  ALFA-TO-NUM-WEB.
006460
006470
006480          MOVE ALL ZEROS          TO TAB-NUMERO-WEB.
006490
006500          MOVE 18                 TO IND3-WEB
006510          PERFORM VARYING IND2-WEB FROM 18 BY -1 UNTIL IND2-WEB = ZERO
006520
006530          IF VALUE-WEB(IND2-WEB:1) NUMERIC
006540          MOVE  VALUE-WEB(IND2-WEB:1)   TO TAB-NUMERO-WEB(IND3-WEB:1)
006550          SUBTRACT 1 FROM IND3-WEB
006560          END-IF
006570
006580          END-PERFORM.
006590
006600          MOVE TAB-NUMERO-WEB     TO NUMERO-WEB.
006610
006620
006630  EX-ALFA-TO-NUM-WEB.
006640          EXIT.
