000010*
000020* CAMPI DI WORKING COMUNI ALLA MAGGIOR PARTE
000030* DEI PROGRAMMI
000040*
000730  01 COMANDO-RUN                          PIC X(200).
000740  01 FINESTRA-RUN                         PIC S9(4) COMP-5.
000750  01 TIPO-RUN                             PIC S9(4) COMP-5.
000760  01 RITORNO-RUN                          PIC s9(9) COMP-5.
000420
000430  01 VIS-DATA          GLOBAL.
000440    02 GG-VIS          PIC 99.
000450    02 MM-VIS          PIC 99.
000460    02 AA-VIS          PIC 9999.
000470
000480  01 SW-DATA           PIC 9      VALUE ZEROS GLOBAL.
000490  01 ANNO-ESTESO       PIC 9(4)   VALUE ZEROS GLOBAL.
000500  01 MESE-RIFERIMENTO  PIC 99     GLOBAL.
000510      88 MESE-RIFERIMENTO-OK VALUE 1 THRU 12.
000520
000530*
000540  01 DATA-NORMALE GLOBAL.
000550     05 GG-NORMALE     PIC 99.
000560     05 MM-NORMALE     PIC 99.
000570     05 AA-NORMALE     PIC 9999.
000580
000590  01 GIORNO-NORMALE    PIC 9 GLOBAL.
000600       88 FERIALE      VALUE 1 THRU 6.
000610       88 SABATO       VALUE 6.
000620       88 DOMENICA     VALUE 7.
000630
000640  01 DATA-GIRATA GLOBAL.
000650     02 AA-GIRATA      PIC 9999.
000660     02 MM-GIRATA      PIC 99.
000670     02 GG-GIRATA      PIC 99.
000680
000690  01 TIME-SYS GLOBAL.
000700     05 ORA-SYS        PIC 99.
000710     05 MIN-SYS        PIC 99.
000720     05 SEC-SYS        PIC 99.
           05 MIC-SYS        PIC 99.
000730
000740  01 DATA-SYS GLOBAL.
000750     05 AA-SYS         PIC 99.
000760     05 MM-SYS         PIC 99.
000770     05 GG-SYS         PIC 99.
000780
000790  01 VIS-ORA GLOBAL.
000800     05 VIS-H          PIC Z9.
000810     05 FILLER         PIC X VALUE ":".
000820     05 VIS-M          PIC 99.
000830
000840
000850  01 CARICA-TABELLA-SETTIMANA IS GLOBAL.
000860          02 FILLER  PIC X(09) VALUE "LUNEDI".
000870          02 FILLER  PIC X(09) VALUE "MARTEDI".
000880          02 FILLER  PIC X(09) VALUE "MERCOLEDI".
000890          02 FILLER  PIC X(09) VALUE "GIOVEDI".
000900          02 FILLER  PIC X(09) VALUE "VENERDI".
000910          02 FILLER  PIC X(09) VALUE "SABATO".
000920          02 FILLER  PIC X(09) VALUE "DOMENICA".
000930
000940  01 TABELLA-SETTIMANA REDEFINES CARICA-TABELLA-SETTIMANA
000950                       IS GLOBAL.
000960          02 GIORNO-SETTIMANA PIC X(09) OCCURS 7 TIMES.
000970
000980  01 CARICA-TABELLA-MESI IS GLOBAL.
000990          02      FILLER  PIC X(11) VALUE "GENNAIO  31".
001000          02      FILLER  PIC X(11) VALUE "FEBBRAIO 28".
001010          02      FILLER  PIC X(11) VALUE "MARZO    31".
001020          02      FILLER  PIC X(11) VALUE "APRILE   30".
001030          02      FILLER  PIC X(11) VALUE "MAGGIO   31".
001040          02      FILLER  PIC X(11) VALUE "GIUGNO   30".
001050          02      FILLER  PIC X(11) VALUE "LUGLIO   31".
001060          02      FILLER  PIC X(11) VALUE "AGOSTO   31".
001070          02      FILLER  PIC X(11) VALUE "SETTEMBRE30".
001080          02      FILLER  PIC X(11) VALUE "OTTOBRE  31".
001090          02      FILLER  PIC X(11) VALUE "NOVEMBRE 30".
001100          02      FILLER  PIC X(11) VALUE "DICEMBRE 31".
001110
001120  01 TABELLA-MESI REDEFINES CARICA-TABELLA-MESI
001130                       IS GLOBAL.
001140          02      LIVELLO-MESI     OCCURS 12 TIMES.
001150           05     MESE-IN-CORSO    PIC X(09).
001160           05     NUM-GG-MESE      PIC 99.
001170  01 GIORNO-SETT                   PIC 9 IS GLOBAL.
001180
001190
001200  01 TAB-STRINGA                   PIC X(18) IS GLOBAL.
001210  01 TAB-NUMERO                    PIC S9(18) IS GLOBAL.
001220  01 NUMERO                        PIC S9(18) IS GLOBAL.
001230
000310  01 DA                            PIC 999999.
000320  01 A                             PIC 999999.
000330  01 TEMPO                         PIC 99.
001240
001250  01 PARAMETRI-TRASCOD IS GLOBAL.
001260    02 NUMERO-TRASCOD              PIC 9(12).
001270    02 CIFRA-TRASCOD               PIC X(100).
001280
001290  01 W-TABELLA-ORARI IS GLOBAL.
001300     02 ORARIO-INI.
001310       09 ORA-INI                  PIC 99.
001320       09 MIN-INI                  PIC 99.
001330     02 ORE-INI REDEFINES ORARIO-INI PIC 9(4).
001340     02 ORARIO-FIN.
001350       09 ORA-FIN                  PIC 99.
001360       09 MIN-FIN                  PIC 99.
001370     02 ORE-FIN REDEFINES ORARIO-FIN PIC 9(4).
001380     02 ORARIO-DUR.
001390       09 ORA-DUR                  PIC 99.
001400       09 MIN-DUR                  PIC 99.
001410     02 ORE-DUR REDEFINES ORARIO-DUR PIC 9(4).
001420     02 ORARIO-TOT.
001430       09 ORA-TOT                  PIC 9999.
001440       09 MIN-TOT                  PIC 99.
001450     02 ORE-TOT REDEFINES ORARIO-TOT PIC 9(6).
001460
001470     02 W-INIZIO                   PIC S9(9) COMP-5.
001480     02 W-FINE                     PIC S9(9) COMP-5.
001490     02 W-DURATA                   PIC S9(9) COMP-5.
001500
001510*
001520* campo di appoggio chiamata liste file tabelle
001530*
001540 01 DATI-GLOBALI IS GLOBAL.
001550*
001560    07 LOCK-STATUS     PIC XX    VALUE "99".
001570
001580
001590    07 ANNO-FILE.
001600      08 PRIMA-CIFRA   PIC 9.
001610      08 ANNO-EST      PIC 999.
001620
001630   07 FINE-FILE        PIC XX    VALUE ALL SPACES.
001640   07 ESITO            PIC XX    VALUE ALL SPACES.
001650    88 ESITO-OK        VALUE "SI".
001660    88 ESITO-NOK       VALUE "NO".
001670
         07 FLAG-WEB         PIC X.
          88 APERTO-WEB      VALUE "A".
          88 CHIUSO-WEB      VALUE SPACES.
         07 FILE-WEB         PIC X(256) VALUE SPACE.